[{"_id":"6729073036ada7837e780e8d","title":"Software Engineering - Software Engineer IV","company":"HCLTech","location":"Burlingame, CA, US","min_amount":152026,"max_amount":164081,"description":"**Description:**\n\nIs building products that make it easier for people to connect with the ones they love most, enjoy top-notch, wire-free VR, and push the future of computing platforms. We are a team of world-class experts developing and shipping products at the intersection of hardware, software and content.\n\nAs an OS Frameworks Engineer on the Reality Labs team at Meta, you will focus on testing and optimizing the performance of VR devices, specifically memory and OS usage by third-party apps. You will ensure the OS stays within its allocated 5GB memory budget and identify regressions, collaborating with the team to resolve issues.\n\n**Responsibilities:**\n\n* Lead performance testing and optimization efforts for VR devices, focusing on memory and OS usage by third-party apps.\n* Ensure OS stays within allocated 5GB memory budget.\n* Identify regressions and collaborate with the team to resolve memory and CPU issues.\n* Develop and maintain automated tests using **JavaScript**.\n* Utilize debugging tools like **Perfetto** to analyze CPU and memory usage.\n* Understand **Android OS** internals and app launching mechanisms.\n* Communicate effectively with cross-functional teams (XFN).\n* Drive discussions with other teams.\n* Make updates and fixes.\n\n**Requirements:**\n\n* Bachelor's degree or equivalent experience in Computer Science, Computer Engineering or similar field.\n* 3+ years of software development experience.\n* Experience with **Android internals, AOSP, or Linux OS development**.\n* Strong understanding of **JavaScript**.\n* Proficiency with debugging tools like **Perfetto**.\n* Knowledge of call stacks, memory allocation, and SQL.\n* Excellent debugging and analysis skills.\n\n**Preferred Qualifications:**\n\n* Mid-level experience (Level 3/4).\n* Experience with performance testing and optimization.\n* Familiarity with VR devices and Android-based systems.\n\n**Work Arrangement:**\n\n* Hybrid work arrangement: 3 days onsite in Burlingame (BUR).\n\nJob Types: Full-time, Contract\n\nPay: $152,026.00 - $164,081.00 per year\n\nBenefits:\n\n* 401(k)\n* Dental insurance\n* Health insurance\n\nAbility to Relocate:\n\n* Burlingame, CA 94010: Relocate before starting work (Required)\n\nWork Location: In person"},{"_id":"6729073036ada7837e780e8e","title":"Senior Software Engineer","company":"Public Storage","location":"Plano, TX, US","min_amount":110400,"max_amount":144000,"description":"**Company Description**  \n\nSince opening our first self-storage facility in 1972, **Public Storage** has grown to become the **largest owner and operator of self-storage facilities** in the world. With **thousands of locations** across the U.S. and Europe, and more than 170 million net rentable square feet of real estate, we're also one of the largest landlords.\n\n\nWe've been recognized as **A Great Place to Work** by the Great Place to Work Institute. And, our employees have also voted us as having **Best Career Growth**, ranked us in the **Top 5% for Work Culture**, and in the **Top 10% for Diversity and Inclusion**.\n\n\nWe're a member of the **S&P 500** and **FT Global 500**. Our common and preferred stocks trade on the New York Stock Exchange.\n\n **Job Description**  \n\nThe Senior Software Engineer engages directly with IT development, technical delivery teams, enterprise architects, resource managers, operations support teams and vendors to ensure the successful design, development and delivery of technology based solutions including a specialization in internal and consumer-facing web solutions, and front-end development.\n\n**Responsibilities**\n\n* Participates in the design, development and implementation of complex applications, often using new technologies, software, hardware and tools.\n* Responsible for solving technical and complex problems; go-to person for UI related technical issues\n* Participate in brainstorming sessions with associates to determine best solutions\n* Develops/designs integrated solutions to resolve technical issues\n* Establishes successful working and support relationships with cross-functional leaders and staff as well as third party vendors\n* Required .Net web development and expected to provide application support.\n\n  \n\n**Qualifications**  \n\n* 4+ years of experience as a software engineer or developer\n* Strong client-side and server side development using C# and ASP.net or .NET Core\n* Strong skills at profiling application both on server-side and client-side\n* Able to work in a team environment and focus on deadlines and deliverables\n* Understands technical solutions and business impact of the solution\n* Ability to work in a Lean-Agile environment\n* Knows how to diplomatically present a challenging position; is able to positively influence others without resorting to authority\n* Must have excellent background and understanding of HTML5, CSS3, Kendo, node.js as well as Web Sockets\n* Expert level knowledge in at least one advanced JavaScript framework such as Kendo, React, Angular, etc…\n* Experience with front end frameworks such as Bootstrap, react.js\n* Single Page Application/JS Templating/Client side MVC\n* Experienced in .NET framework development. i.e. .NET MVC, .NET Core, web API\n* Application development using MVVM, MVC, Restful WebAPI services, WCF, SOLID principles, OOPs, Dependency Injection, Inversion of Control (IoC), Multi-threading.\n* Optional experience with some common front-end development tools such as NPM, SASS and LESS\n\n  \n\n**Additional Information** **Compensation**\n\n**Base Pay Range**: $110400 - $144000\n\n\nCompensation may vary outside of this range depending on a number of factors, including a candidate’s qualifications, skills, competencies and experience, and location. Base pay is one part of our total awards approach to compensation which is provided to compensate and recognize employees for their work, and this role may be eligible for additional discretionary bonuses or incentives.\n\n\nOne of our values pillars is to work as OneTeam and we believe that there is no replacement for in-person collaboration but understand the value of some flexibility. Public Storage teammates are expected to work in the office five days each week with the option to take up to three flexible remote days per month.\n\n* Our office is based in Plano, east of I75 near E. Park Blvd, just North of Historic Downtown Plano.\n\n\nAll your information will be kept confidential according to EEO guidelines."},{"_id":"6729073036ada7837e780e8f","title":"Senior Embedded Software Engineer","company":"Your Medical Center","location":"Amityville, NY, US","min_amount":140000,"max_amount":200000,"description":"**Company Overview**\n\nNAPCO Security Technologies, a world-wide leader in the manufacturing of electronic security systems for over 40 years, headquartered in Amityville, Long Island NY, seeks an embedded software (firmware) developer to join our Engineering team. This Senior Engineering position involves the design of Software/Firmware for ARM microprocessor-based hardware platforms for use in the security industry such as Fire, Burglary, Access Control, and Home Control Systems.\n\n**Responsibilities**\n\n· Work with the development and Marketing teams to define system-level features, performance and specifications, and implement appropriate software architecture and firmware designs.\n\n· Design and code firmware for new security products using C.\n\n**Requirements**\n\n· Solid 8+ years of experience designing software for microprocessor-based products.\n\n· Expert knowledge of C language and ARM uP’s.\n\n· Experience with IDE’s such as IAR.\n\n· Experience developing/implementing communication protocols for wireless products.\n\n· Experience with Wireless/RF Microcontrollers such as TI1310 or equivalent, a plus.\n\n· Hardware design experience is a plus.\n\n· Security industry experience is a plus.\n\n· BS in CE, EE, or equivalent experience.\n\n**Compensation and Benefits**\n\nWe offer steady, stable, full-time work, and an attractive employment package, including a competitive salary, 401(k), paid vacation, personal time off, paid holidays, long-term disability insurance, tuition reimbursement, medical insurance, dental insurance, life insurance, promotional opportunities, and career growth.\n\nSalary : the salary ranges from 140k-200k depending on experience.\n\nJob Type: Full-time\n\nPay: $140,000.00 - $200,000.00 per year\n\nBenefits:\n\n* 401(k)\n* Dental insurance\n* Health insurance\n* Life insurance\n\nExperience:\n\n* Embedded software: 1 year (Preferred)\n\nAbility to Commute:\n\n* Amityville, NY 11701 (Required)\n\nAbility to Relocate:\n\n* Amityville, NY 11701: Relocate before starting work (Required)\n\nWork Location: In person"},{"_id":"6729073036ada7837e780e90","title":"Staff Software Engineer","company":"Expert Institute","location":"Milwaukee, WI, US","min_amount":120840,"max_amount":153011,"description":"**Company Description** **About Expert Institute**\n\n\nExpert Institute is a legal technology, data, and services company. We have been in operation for over a decade and are evolving into a leading data and solutions provider in our market. Expert Institute’s goal is to facilitate seamless expertise needs-matching and collaboration around legal matters, built on a foundation of high-quality data. As we continue to grow, we seek a Software Engineer to join our team.\n\n **Job Description** **The Role**\n\n\nAs a Staff Software Engineer on the Expert iQ development team, you’ll play a pivotal role in building and optimizing web applications that enhance the efficiency of connecting legal teams with expert witnesses. You will collaborate with cross-functional teams, designing and implementing innovative solutions that align with business objectives while ensuring a seamless user experience. You’ll be expected to contribute to both new and existing projects, develop and maintain secure APIs, and drive the adoption of infrastructure-as-code using tools like Terraform or CloudFormation. Your ability to navigate cloud platforms, optimize performance, and provide technical leadership will be crucial in tackling complex challenges. You will also play a key role in fostering a culture of continuous learning and innovation by embracing new technologies and frameworks.\n\n**Why You’ll Love This Role:**\n\n* High-impact projects: Your work will directly influence our platform, helping legal professionals solve complex cases with expert data.\n* Innovation at its core: We foster a culture of continuous learning and creativity, encouraging you to work with the latest technologies like AI, cloud infrastructure, and more.\n* Collaborative environment: Be part of a cross-functional team where your voice matters and your contributions are highly valued.\n* Career growth: Grow your technical and leadership skills as you work on complex challenges in a fast-growing company.\n\n**Key Responsibilities**\n\n* Collaborate with the engineering team to enhance web applications, system designs, and best practices.\n* Work with cross-functional teams to deliver innovative solutions aligned with business goals.\n* Participate in both existing projects and new developments, always focusing on the end user's needs.\n* Develop and maintain APIs for web applications, ensuring robust security and authentication.\n* Solve complex technical challenges, balancing requirements, design considerations, and trade-offs. You should feel comfortable with in-place re-architecture.\n* Embrace new technologies and frameworks, fostering a culture of innovation.\n* Implement infrastructure-as-code using tools like Terraform or CloudFormation.\n* Engage with cloud technologies and platforms to optimize performance and efficiency.\n* Deliver high-quality solutions, ensuring unit, integration, and end-to-end testing.\n\n **Qualifications** **Qualifications**\n\n* 6+ years of software engineering experience.\n* Bachelor of Science degree (or equivalent) in computer science, engineering, or relevant field.\n* Demonstrates understanding and usage of software development principles [SOLID, DRY, SOC] and architectural principles.\n* Proficiency with fundamental front-end languages JavaScript/TypeScript [Angular, React], HTML, SCSS, CSS [Tailwind, Bootstrap], NX\n* Proficiency with server-side languages and frameworks such as NodeJS/Express [NestJS, NextJS] Python [Flask, Django], C# / Java [Spring Boot]\n* Hands-on experience with SQL [Postgres], NoSQL databases, and domain modeling.\n* Hands-on experience developing RESTful APIs and an interest in API design, microservices, and event-driven architectures.\n* Proficiency with Git and Bitbucket/Github workflows.\n* Familiarity with cloud platforms like AWS, Azure, or GCP.\n* Knowledge of infrastructure-as-code tools (Terraform, CloudFormation) and DevOps practices.\n* Familiarity with authentication standards like OAuth, SAML, or OIDC is a plus.\n* Bonus: Experience integrating with AI services like Gemini and ChatGPT.\n* Ability to explain complex business and technical concepts to all audiences.\n\n**Why Join Expert Institute?**\n\n\nThis is a unique opportunity to join a talented team that is punching above its weight in a novel and growing niche. At Expert Institute, you will be part of an innovative environment that values creativity and impact. You will play a pivotal role in our journey to become a leading legal technology provider.\n\n **Additional Information**  \n\nAll your information will be kept confidential according to EEO guidelines."},{"_id":"6729073036ada7837e780e91","title":"Sr. Golang Developer","company":"Paramount Global US Inc","location":"Fairfax, VA, US","min_amount":47,"max_amount":57,"description":"Direct Client Requirement for “.Senior Golang Developer.” at \"Mc Lean VA(Hybrid)\" Only W2.\n\nWe are Hiring the below position, Please contact ASAP.\n\nRole : Sr Golang Developer Position\n\nExperience : 10+ Years\n\nLocation: McLean VA(Hybrid)\n\nDuration: 1 Year+ (Interview for sure)\n\nHigh Chances of Closure\n\nClient : Capital One(W2)\n\nPlease share the candidate LinkedIn URL, location and Visa status.\n\nanjali@qtechus.com\n\nJob Type: Contract\n\nPay: $47.58 - $57.30 per hour\n\nSchedule:\n\n* 8 hour shift\n\nExperience:\n\n* AWS: 1 year (Preferred)\n* ASP.NET: 1 year (Preferred)\n* APIs: 1 year (Preferred)\n\nAbility to Commute:\n\n* Fairfax, VA 22030 (Preferred)\n\nAbility to Relocate:\n\n* Fairfax, VA 22030: Relocate before starting work (Preferred)\n\nWork Location: In person"},{"_id":"6729073036ada7837e780e92","title":"Server-side .Net Developer","company":"OpenPath Products","location":"Annapolis, MD, US","min_amount":75000,"max_amount":95000,"description":"*Apply your C# and Java server skills to build next-generation back-end systems that improve the health, well-being, and security for millions of people. Grow your current skills and learn new ones as you partner with industry thought leaders, system architects, front-end developers, and a supportive QA team.* \n\nWe are seeking skilled server developers who can enthusiastically build next generation FinTech and IoT software to improve health, well-being, and security that will benefit millions of peoples. Candidates should be passionate about coding robust, reliable, and scalable products. The ideal candidate will demonstrate expertise with server-based development using .Net and Java and ideally with additional technologies including PHP and C++.\n\nExperience with team-based development using agile principles, Jira and git will be very helpful. Strong communication and collaboration skills will be essential. The candidate should be knowledgeable on current technologies and able to share new ideas and energy with the team and our customers.\n\n**Our Company**\n\nFounded in 2001 as one of the world’s first mobile application development companies, OpenPath Products provides advanced software engineering and quality assurance services to its world-wide clientele. Based in historic and beautiful Annapolis, Maryland, we develop for the Internet of Things, Financial Tech, media streaming and next generation technologies. We have delivered thousands of products for some of the largest and most innovative companies in the world.\n\nAt OpenPath Products you will continue to grow your skills while doing exciting and meaningful work. This is not a “program to spec” position. Your out-of-the box thinking, energy, and enthusiasm will be valued and will have a direct impact on our team and projects.\n\n**Your Position**\n\nYou will participate in requirements gathering, technical design, agile development, and customer interactions. You will apply your existing skills while staying abreast of the latest trends and tools. Most deployments will be cloud-based, but there is no “one size fits all” for every project. You will be expected to think through the gray areas of requirements and work with the team to map out a clear path for project success.\n\nRequired Skills and Experience\n\n* C# and Java language expertise, including using generics\n* Experience designing and developing building RESTful APIs\n* Hands-on experience with messaging-based architectures using JMS, MQTT, etc.\n* JavaScript (Node.js), PHP and C++ server development skills also highly desirable\n* Understanding of networking principles, including the OSI model and the use of Wireshark\n* Ability to conduct UML and database modeling\n* Organized, detail oriented, and a proven ability to troubleshoot\n* System-level architecture and documentation experience\n* Requirements documentation and traceability experience\n\n**Why Should You Apply?**\n\nOpenPath Products provides a unique balance of benefits and opportunities that are hard to find in today’s working world. We offer 19 years of stability, but we are never stagnant. We are always learning new technologies and bringing new ideas to solve tough problems. You will have many opportunities to grow and advance. We offer Excellent Health Insurance, Vision, Dental, Life, LTD and a 401k plan. Salary is commensurate with experience. We believe in continuous education and continuous improvement. Everyone’s opinion here matters and no one is just a “cog in the machine”.\n\nIf you are passionate about producing, learning and growing while doing meaningful work, OpenPath Products may be the place for you.\n\nJob Type: Full-time\n\nPay: $75,000.00 - $95,000.00 per year\n\nBenefits:\n\n* 401(k)\n* 401(k) matching\n* Dental insurance\n* Health insurance\n* Health savings account\n* Life insurance\n* Paid time off\n* Parental leave\n* Professional development assistance\n* Referral program\n* Tuition reimbursement\n* Vision insurance\n\nCompensation Package:\n\n* Bonus opportunities\n\nSchedule:\n\n* Monday to Friday\n\nWork Location: In person"},{"_id":"6729073036ada7837e780e93","title":"AWS Python Developer (Only W2)","company":"Tekcogno","location":"Dallas, TX, US","min_amount":100000,"max_amount":130000,"description":"**Title: PYTHON SOFTWARE ENGINEER – REMOTE/ HYBRID (ONLY W2)**\n\n**Location: Dallas, TX - WE need locals to Dallas, TX** \n\n**Required Skills & Qualifications**\n\n· **Technical Skills:**\n\no Must need 10+ Years’ experience\n\no Strong hands-on experience with **AWS services** (e.g., Lambda, API Gateway, S3, EC2, IAM).\n\no Proficient in **API development** (RESTful, GraphQL) and related tools (e.g., Postman, Swagger/OpenAPI).\n\no Strong programming skills in **Python**\n\no Familiarity with **CI/CD pipelines**, **Docker**, and **Kubernetes**.\n\no Good to have Kafka Experience and Familiarity with monitoring tools such as Prometheus, Grafana\n\nJob Types: Full-time, Contract\n\nPay: $100,000.00 - $130,000.00 per year\n\nSchedule:\n\n* 8 hour shift\n\nWork Location: Remote"},{"_id":"6729073036ada7837e780e94","title":"Software Engineer","company":"Expert Institute","location":"Milwaukee, WI, US","min_amount":84442,"max_amount":106923,"description":"**Company Description** **About Expert Institute**\n\n\nExpert Institute is a legal technology, data, and services company. We have been in operation for over a decade and are evolving into a leading data and solutions provider in our market. Expert Institute’s goal is to facilitate seamless expertise needs-matching and collaboration around legal matters, built on a foundation of high-quality data. As we continue to grow, we seek a Software Engineer to join our team.\n\n **Job Description** **The Role**\n\n\nAs a Software Engineer on the Data Central team, you will have the opportunity to work closely with all the members of the content engineering team and the content research teams, to advance the automation of content curation and collection, and build a content delivery platform initially using API solutions to enable delivery of expert data to Expert Institute’s clients.\n\n**Why You’ll Love This Role:**\n\n* High-impact projects: Your work will directly influence our platform, helping legal professionals solve complex cases with expert data.\n* Innovation at its core: We foster a culture of continuous learning and creativity, encouraging you to work with the latest technologies like AI, cloud infrastructure, and more.\n* Collaborative environment: Be part of a cross-functional team where your voice matters and your contributions are highly valued.\n* Career growth: Grow your technical and leadership skills as you work on complex challenges in a fast-growing company.\n\n**Key Responsibilities**\n\n* Collaborate with the engineering team to contribute to improving system, database designs, and best practices.\n* Work with cross-functional teams to deliver innovative solutions that align with business objectives.\n* Participate in both existing projects and new developments, always keeping the end user’s needs in mind.\n* Support the development and maintenance of APIs for web applications, focusing on ensuring robust security and authentication.\n* Assist in solving complex technical challenges by understanding requirements, designs, and trade-offs.\n* Learn and work with new technologies and frameworks, helping foster a culture of innovation.\n* Actively contribute to implementing infrastructure-as-code using tools such as Terraform or CloudFormation.\n* Stay engaged with cloud technologies, platforms, and tools, contributing to optimizing performance and efficiency.\n* Develop quality solutions, understanding the importance of unit, integration, and end-to-end testing.\n\n **Qualifications** **Qualifications**\n\n* 2+ years of software engineering experience.\n* Bachelor of Science degree (or equivalent) in computer science, engineering, or relevant field.\n* Understanding of object-oriented programming concepts with SOLID principles and experience working in either Javascript/Node.js/Python programming languages.\n* Hands-on experience with SQL, NoSQL databases, and domain modeling.\n* Hands-on experience developing RESTful APIs and an interest in API design, microservices, and event-driven architectures.\n* Proficiency with Git and Bitbucket/Github workflows.\n* Familiarity with cloud platforms like AWS, Azure, or GCP.\n* Knowledge of infrastructure-as-code tools (Terraform, CloudFormation) and DevOps practices.\n* Familiarity with authentication standards like OAuth, SAML, or OIDC is a plus.\n* Bonus: Experience integrating with AI services like Gemini and ChatGPT.\n* Ability to explain complex business and technical concepts to all audiences.\n\n**Why Join Expert Institute?**\n\n\nThis is a unique opportunity to join a talented team that is punching above its weight in a novel and growing niche. At Expert Institute, you will be part of an innovative environment that values creativity and impact. You will play a pivotal role in our journey to become a leading legal technology provider.\n\n **Additional Information**  \n\nAll your information will be kept confidential according to EEO guidelines."},{"_id":"6729073036ada7837e780e95","title":"Android Software Engineer, Fanatics","company":"GameChanger","location":"New York, NY, US","min_amount":130000,"max_amount":160000,"description":"**About GameChanger:**\n\n\nWe believe in the life-changing impact youth sports have on and off the field because they encourage leadership, teamwork, responsibility, and confidence—important life lessons that have the power to propel our youth toward meaningful futures. We recognize that without coaches, parents, and volunteers, organized youth sports could not exist. By building the first and best place to experience the youth sports moments important to our community, we are helping families elevate the next generation through youth sports.\n\n\nSo if you love sports and their community-building potential, or building cool products is your sport, GameChanger is the team for you. We are a remote-first, dynamic tech company based in New York City, and we are solving some of the biggest challenges in youth sports today.\n\n**The Position:**\n\n\nThe Fanatics team is dedicated to making GameChanger the ultimate hub for community engagement and insights around young athletes. Our mission is to grow the GameChanger community by bringing more fans, family members, and friends into the ecosystem, and connecting them with highly personalized and relevant content that brings them closer to the action.\n\n\nAs an Android Software Engineer, you will use modern tools to develop features in our native Android application and across the stack. You will build engaging user-facing features by contributing your expertise, writing code, and making architectural decisions on a team of Product Managers, Designers, QA Analysts, and Engineers. You will report to one of our Product Engineering Managers.\n\n**What You'll Do:**\n\n* Lead feature development for fan experiences, community engagement, and personalized content throughout the stack, with a focus on our Android app.\n* Work with peers on important decisions about how our applications are architected and built.\n* Team up with designers, testers, and product managers to find the best solutions for our customers.\n* Teach and learn with engineers across the company.\n* Promote responsible engineering practices and mentor team members.\n* Drive consensus on your team and solutions to challenging problems.\n\n**Who You Are:**\n\n* Solid understanding of software engineering fundamentals.\n* Experience leading successful Android projects.\n* Experience shipping beautiful, high-quality apps.\n* Participate in regular design and code reviews with development team members to confirm use of best practices.\n* Understand and evaluate new technologies, develop skills in new technologies.\n* Passion and experienced working with the latest Android tech.\n* Comfort working in a cross-functional product team.\n* Experience mentoring engineers and organizing work within a team.\n\n**Experience:**\n\n* Our apps are written in Kotlin and use a reactive MVVM architecture driven by the Jetpack lifecycle components (including Compose), Realm, and Flows/RxJava.\n* Your team will also do iOS development in Swift, so having background there would be a bonus, but is not required.\n* Our backend APIs are built with TypeScript, Node.js, Redis, Kafka, and PostgreSQL and run in AWS. It's not required that you know these, but being able to work closely with the backend engineers on your team by understanding these technologies is a bonus.\n\n**Perks**:\n\n* Work remotely throughout the US\\* or from our well-furnished, modern office in Manhattan, NY.\n* Unlimited vacation policy.\n* Paid volunteer opportunities.\n* WFH stipend - $500 annually to make your WFH situation comfortable.\n* Snack stipend - $60 monthly to have snacks shipped to your home office.\n* Full health benefits - medical, dental, vision, prescription, FSA/HRA., and coverage for family/dependents.\n* Life insurance - basic life, supplemental life, and dependent life.\n* Disability leave - short-term disability and long-term disability.\n* Retirement savings - 401K plan offered through Vanguard, with a company match.\n* Company paid access to a wellness platform to support mental, financial and physical wellbeing.\n* Generous parental leave.\n* DICK’S Sporting Goods Teammate Discount.\n\n\nWe are an equal opportunity employer and value diversity in our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.\n\n*The target salary range for this position is between $130,000 and $160,000. This is part of a total compensation package that includes incentive, equity, and benefits for eligible roles. Individual pay may vary from the target range and is determined by several factors including experience, internal pay equity, and other relevant business considerations. We constantly review all teammate pay to ensure a great compensation package that is fair and equal across the board.*\n\n* *DICK'S Sporting Goods has company-wide practices to monitor and protect us from compliance and monetary implications as it pertains to employer state tax liabilities. Due to said guidelines put in place, we are unable to hire in AK, DE, HI, IA, LA, MS, MT, OK, and SC.*\n\n**IMPORTANT NOTICE:** All official recruitment communications from GameChanger will come from an email address ending in @gc.com and/or no-reply@ashby.hq.com. If you receive communication from any other domain, please be cautious, as it is likely fraudulent.\n\n\nCompensation Range: $130K - $160K"},{"_id":"6729073036ada7837e780e96","title":"Software Engineer – Peripheral Focused Ultrasound","company":"GE HealthCare","location":"Wauwatosa, WI, US","min_amount":116388,"max_amount":147374,"description":"**Job Description Summary**\n===========================\n\n\nPeripheral Focused Ultrasound (PFUS) is a novel & emerging technology that leverages ultrasound to specifically regulate metabolic function in the body to support the treatment of chronic diseases such as type 2 diabetes and obesity. The Software Engineer position is a key software development role on this Ultrasound team focused on bringing disruptive and innovative Ultrasound technology to market. You will be responsible for the software development of this emerging product line, starting with prototype development and moving in to new product development through the course of the program. The position will provide many interesting technical challenges and as much responsibility as you can handle.**Job Description**\n===================\n\n**Essential Responsibilities**\n\n* Define, develop, and evolve software in a fast paced and agile development environment using the latest software development technologies and infrastructure\n* Work with a cross functional team of engineers, scientists and applications experts to translate business segment application needs that demand new reconstruction capabilities into component-level requirements\n* Translate requirements / vision into prioritized list of user stories and deliver to required timelines and quality standards\n* Design and implement solutions to complex data management and distributed processing software problems in the reconstruction platform domain in accordance with established software development practices and processes.\n* Plan and perform integration activities at component, sub-system and system levels. Document designs and verification activities; perform component & subsystem level verifications, participate in system level verifications and validations as necessary.\n* Work with product line leaders and architects to develop multi generation software technology plans\n* Apply principles of SDLC and methodologies like Lean/Agile/XP, CI, Software and Product Security, Scalability, Documentation Practices, refactoring and Testing Techniques\n* Write code that meets standards and delivers desired functionality using the technology selected for the project\n\n**Required Qualifications**\n\n* Bachelor's Degree in Computer Science or “STEM” Majors (Science, Technology, Engineering and Math) with minimum years of experience 4 years or 10 years software development experience\n\n**Desired Technical Expertise**\n\n* Master's Degree/ PHD in Computer Science\n* Demonstrated experience with development of medical device software Experience in software platform, advanced applications, user-interface design and/or systems engineering especially in the healthcare\n* Experience with Windows and Unix / Linux based programming\n* Demonstrated expertise with MATLAB or equivalent scientific modeling tools & packages\n* Experience with Parallel computing concepts and tools - MPI, OpenMP\n* Demonstrated experience with development of medical device software Experience in software platform, advanced applications, user-interface design and/or systems engineering especially in the healthcare\n* Experience with Windows and Unix / Linux based programming\n* Demonstrated expertise with MATLAB or equivalent scientific modeling tools & packages\n* Experience with Parallel computing concepts and tools - MPI, OpenMP\n\n\n#MyRoleIsVital\n\n\n#Everyrolesvital\n\n\n#LI-BR1\n\n**#LI-Onsite**\n\n**#LI-Hybrid**\n\n\nGE offers a great work environment, professional development, challenging careers, and competitive compensation. GE is an Equal Opportunity Employer. Employment decisions are made without regard to race, color, religion, national or ethnic origin, sex, sexual orientation, gender identity or expression, age, disability, protected veteran status or other characteristics protected by law.\n\n\nGE will only employ those who are legally authorized to work in the United States for this opening. Any offer of employment is conditioned upon the successful completion of a drug screen (as applicable).\n\n**Additional Information**\n==========================\n\n\nGE HealthCare offers a great work environment, professional development, challenging careers, and competitive compensation. GE HealthCare is an Equal Opportunity Employer. Employment decisions are made without regard to race, color, religion, national or ethnic origin, sex, sexual orientation, gender identity or expression, age, disability, protected veteran status or other characteristics protected by law.\n\n\nGE HealthCare will only employ those who are legally authorized to work in the United States for this opening. Any offer of employment is conditioned upon the successful completion of a drug screen (as applicable).\n\n\nWhile GE HealthCare does not currently require U.S. employees to be vaccinated against COVID-19, some GE HealthCare customers have vaccination mandates that may apply to certain GE HealthCare employees.\n\n**Relocation Assistance Provided:** No"},{"_id":"6729073036ada7837e780e97","title":"Senior Software Engineer","company":"Ocrolus","location":"Remote, US","min_amount":127721,"max_amount":161724,"description":"At Ocrolus, we believe companies work best when they focus on their core business and let automation do the rest. We’re powering the digital lending ecosystem and help financial services firms make high-quality decisions with trusted data and unparalleled efficiency.\n\n\n\nOcrolus’ Human-in-the-Loop document automation software analyzes documents with over 99% accuracy. We're replacing legacy OCR vendors that cap out at 75-80% accuracy, and augmenting the robotic work that humans are prone to doing all too often – which can be expensive, error-prone, and slow. By empowering lenders to analyze diverse sources of financial data more efficiently, Ocrolus levels the playing field for every borrower, providing expanded access to credit at a lower cost.\n\n\n\nWe’ve raised over **$100 million** from blue-chip investors and are working with customers like **PayPal, Brex, SoFi, Blend and Plaid**. Join us as we build the future of fintech, and make an impact at an award-winning, high-growth startup that Forbes recently dubbed the “**Next Billion-Dollar Startup**”.\n\n\n\n**Summary:**\n\n\n\nWe are looking for an exceptionally skilled **Senior Software Enginee**r with a solid technical background and leadership skills, able to work in a fast-paced environment, and help architect and build the next generation of our backend applications.\n\n\n**What you'll do:**\n\n\n* Design, implement, and maintain Microservices using **Python.**\n* Design and develop cloud based software products conforming to industry best practices.\n* Build systems, services, and tools to handle new Ocrolus products and business requirements that securely scale over millions of transactions.\n* Build and scale our fast-growing online services and data pipelines.\n* Collaborate with other teams on security, reliability, and automation.\n* Support the testing process, troubleshooting issues and resolving them.\n\n\n**What you'll bring:**\n\n\n* Bachelor's degree in Computer Science or related field.\n* 5+ years engineering experience.\n* Experience in building complex service applications in Python\n* Solid database skills (Postgres, MySQL etc).\n* Ability to contribute best-practices and architectural leadership to our backend applications and help pick the architecture, frameworks and tooling for our next generation platform.\n* Experience leading and owning projects from beginning to end.\n* Experience with agile methodologies and automated testing.\n* Familiarity with containerization, microservices architecture, continuous integration and deployment.\n\n\n**Life at Ocrolus**\n\nCome build the future of fintech with us. At Ocrolus, you will work with extraordinary people and receive benefits and development opportunities to empower you in and out of the office.\n\nWe take pride in our dynamic, diverse team, unified by shared values of **Empathy, Curiosity, Humility and Ownership.** We love what we do and the people we do it with, which is why we welcome every individual, provide them with equal opportunity irrespective of their race, gender, gender identity, age, disability, national origin or any other legally protected rights that one has.\n\n\n\nWe look forward to hearing from you!"},{"_id":"6729073036ada7837e780e98","title":"Mainframe Developer","company":"United It Solutions Inc","location":"Cincinnati, OH, US","min_amount":97835,"max_amount":123881,"description":"**Mainframe developer**\n\n**Location: Cincinnati day 1 onsite**\n\n**Primary Skills: COBOL, CICS, DB2, ACH, PEP+.**\n\n**Experience :10+**\n\n**Fulltime**\n\n**Job Summary:**  \nResponsible for designing, developing, testing, configuration, contingency planning and technical support of mainframe technology. Manages products lifecycle to assure operational availability; gathers data and analyzes capacity and performance. Fulfill engineering responsibilities in the area of mainframe languages, software change management solutions, development and productivity tools. Primary Responsibilities: • Serve as mainframe Subject Matter Expert (SME). • Participates in infrastructure planning, providing insight into the future of their area(s) of technology. • Maintains thorough understanding of current and future infrastructure. • Responsible for establishing, maintaining, documenting, and publishing the mainframe language and development tools directions and technology roadmaps as well as coordinating cross-departmental projects that involve mainframe application migrations. • Demonstrates broad technical knowledge of multiple technologies, or an in-depth knowledge of one technology including its impact on other technologies. • Maintains an industry awareness of new developments in their area of expertise; learns and applies new and emerging concepts very quickly. • Forms productive networks with internal and external customers, the vendor community and peers in the industry. • Ensures proper documentation of complex technical systems to facilitate effective handover to operations. • s implementation efforts – s the analysis of vendor proposals, evaluates build versus buy, formulates the complete project plan, establishes the critical path, coordinates vendors, builds and conducts tests, and tracks project progress. Qualifications: • Technical Degree or related work experience. • Requires knowledge and experience in multiple disciplines within the mainframe domain as well as strong application design and development skills. • Expert knowledge of the Mainframe Operating System and Hardware.\n\n**Key Responsibilities:**\n\n* **Manage and Support PEP+:** Oversee the daily operations and maintenance of the Fiserv ACH processing platform, PEP+.\n* **Technical Expertise:** Utilize your expertise in CICS, Cobol, and DB2 to ensure the platform runs efficiently and effectively.\n* **ACH NACHA File Handling:** Handle ACH NACHA files with precision, ensuring compliance with industry standards and regulations.\n* **Integration Management:** Manage and support the integration of third-party sanctions solutions for international ACH transactions.\n* **Problem Resolution:** Identify, troubleshoot, and resolve issues related to the ACH processing platform and integrations.\n* **System Enhancements:** Collaborate with cross-functional teams to implement system enhancements and upgrades.\n* **Documentation:** Maintain comprehensive documentation of processes, procedures, and system configurations.\n* **Compliance:** Ensure all processes comply with financial industry regulations and standards.\n* **Training and Support:** Provide training and support to internal teams on the use and management of the ACH processing platform and related integrations.\n\n**Qualifications:**\n\n* **Education:** Bachelor’s degree in Computer Science, Information Technology, or a related field.\n* **Experience:** Minimum of 7 years of experience in managing and supporting ACH processing platforms, specifically Fiserv PEP+.\n* **Technical Skills:** Proficiency in CICS, Cobol, and DB2.\n* **Industry Knowledge:** Strong understanding of ACH NACHA file handling, integration with third party sanctions scanning & screening of international ACH transactions (IAT's). Hands on experience managing Fiserv's PEP+ application. Fedline Advantage ACH knowledge\n* **Integration Experience:** Experience with integrating third-party sanctions solutions.\n* **Problem-Solving:** Excellent analytical and problem-solving skills.\n* **Communication:** Strong verbal and written communication skills.\n* **Team Player:** Ability to work collaboratively in a team environment.\n\nJob Type: Full-time\n\nPay: $100.00 - $115.00 per year\n\nBenefits:\n\n* 401(k)\n* 401(k) matching\n* Dental insurance\n* Health insurance\n\nSchedule:\n\n* 8 hour shift\n\nAbility to Commute:\n\n* Cincinnati, OH 45202 (Preferred)\n\nAbility to Relocate:\n\n* Cincinnati, OH 45202: Relocate before starting work (Required)\n\nWork Location: In person"},{"_id":"6729073036ada7837e780e99","title":"Software Engineer II, Video","company":"Flock Safety","location":"Remote, US","min_amount":100000,"max_amount":140000,"description":"**Who is Flock?**\n-----------------\n\n\nFlock Safety is an all-in-one technology solution to eliminate crime and keep communities safe. Our intelligent platform combines the power of communities at scale - including cities, businesses, schools, and law enforcement agencies - to shape a safer future together. Our full-service, maintenance-free technology solution is trusted by communities across the country to help solve and deter crime in the pursuit of safer communities for everyone.\n\n\nOur holistic public safety platform is comprehensive and intelligent, providing the actionable evidence needed to solve, deter and reduce crime across neighborhoods, schools, businesses and entire cities. Without compromising transparency or privacy, we are turning unbiased data into objective answers.\n\n\nFlock strives to offer a career-defining experience where you can also make an impact on your community. While safety is a serious business, we are a supportive team that is optimizing the remote experience to create strong and fulfilling relationships even when we are physically apart. Our group of hard-working employees thrive in a positive and inclusive environment, where a bias towards action is rewarded.\n\n\nWe have raised over $380M in venture capital from investors including Tiger Global, Andreessen Horowitz, Matrix Partners, Meritech Capital Partners, and Initialized Capital. Now surpassing a $5.5B valuation, Flock is scaling intentionally and seeking the best and brightest to help us meet our goal of reducing crime in the United States by 25% in the next three years.\n\n**The Opportunity**\n===================\n\n\nThe Cloud Video team is looking to add a Software Engineer to support our increasing number of integrations with other NVRs (network video recorders), VMS (video management systems), and video-capable devices, including drones. This engineer will contribute to Flock’s own VMS software, where we display live video for our customers.\n\n\n**The Skillset**\n================\n\n* Love writing code and have extensive experience doing so\n* Motivated by taking an unknown problem, sinking your teeth in, and coming up with a plan of attack.\n* Experience with Go, Typescript (Node) web services, and React or other Javascript frameworks\n* Experience designing and implementing APIs.\n* Experience with AWS and cloud tooling such as Kubernetes (EKS), AWS Lambda, Docker\n* Ability to work cross-functionally with other engineering and product teams\n* Experience with VMS systems and Video/Streaming technologies such as WebRTC, HLS, RTSP, FFmpeg, GStreamer, etc is *preferred but not required*.\n\n*Feeling uneasy that you haven’t ticked every box? That’s okay; we’ve felt that way too. Studies have shown women and minorities are less likely to apply unless they meet all qualifications. We encourage you to break the status quo and apply to roles that would make you excited to come to work every day.*\n\n**90 Days at Flock**\n====================\n\n\nWe are a results-oriented culture and believe job descriptions are a thing of the past. We prescribe to 90 day plans and believe that good days, lead to good weeks, which lead to good months. This serves as a preview of the 90 day plan you will receive if you were to be hired as a Software Engineer at Flock Safety.\n\n**The First 30 Days**\n\n* Understand team workflows and processes\n* Contribute smaller features and bugfixes with guidance\n* Have all team repos cloned locally and have a good idea of what they do\n\n**The First 60 Days**\n\n* Ability to perform in role with minimal or no guidance\n* Contribute to technical planning and architecture discussions\n* Understand design philosophies in use\n* Contribute to metric collection and automated test suites\n\n**90 Days & Beyond**\n\n* Understand how each integration type functions at a high level\n* Come up with and speak on ideas for improving our speed, resource usage, API simplicity, and other topics to make our software suite better\n* Start to own smaller projects\n* Communicate with cross-functional teams to ensure projects succeed\n\n**The Interview Process**\n=========================\n\n\nWe want our interview process to be a true reflection of our culture: transparent and collaborative. Throughout the interview process, your recruiter will guide you through the next steps and ensure you feel prepared every step of the way.\n\n* Our First Chat: During this first conversation, you’ll meet with a recruiter to chat through your background, what you could bring to Flock, what you are looking for in your next role, and who we are.\n* The Hiring Manager Interview: You will meet with your potential future boss to really dive into the role, the team, expectations, and what success means at Flock. This is your chance to really nerd out with someone in your field.\n* The Technical Assessment: Our technical assessments seek to test the hard skills required to do the job. Engineers may find themselves in coding interviews or architecture discussions, sales roles may present mock discovery calls, and leadership roles may craft 90 day plans. Your recruiter will inform you of which assessment you will be assigned and ensure you are fully prepared for your big day.\n* The Panel: Learn more about the team, responsibilities, and workflows. You should be prepared to speak about past projects, how you collaborate and communicate with others, and how you live our values. Depending on the team and role you are interviewing for, you may meet with several teammates as well as cross-functional partners.\n* The Executive Review: A chance to meet an executive and view Flock from a different lens. Be prepared to ask well-thought-out questions about the company, culture, and more.\n\n**The Perks**\n=============\n\n**Salary & Equity**: In this role, you’ll receive a starting salary of $100,000-$140,000 as well as stock options\n\n**Flexible PTO**: We seriously mean it, plus 11 company holidays.\n\n**Fully-paid** **health benefits** **plan for employees**: including Medical, Dental, and Vision and an HSA match.\n\n**Family Leave**: All employees receive 12 weeks of 100% paid parental leave. Birthing parents are eligible for an additional 6-8 weeks of physical recovery time.\n\n**Fertility & Family Benefits:** We have partnered with Maven, a complete digital health benefit for starting and raising a family. In 2024, Flock will provide a $ 50,000-lifetime maximum benefit related to eligible adoption, surrogacy, or fertility expenses.\n\n**Mental Health:** All employees receive an annual subscription to Headspace.\n\n**Caregiver Support:** We have partnered with Cariloop to provide our employees with caregiver support\n\n**Carta Tax Advisor:** Employees receive 1:1 sessions with Equity Tax Advisors who can address individual grants, model tax scenarios, and answer general questions.\n\n**ERGs:** We want all employees to thrive and feel like they belong at Flock. We offer three ERGs today - Women of Flock, Flock Proud, and Melanin Motion. If you are interested in talking to a representative from one of these, please let your recruiter know.\n\n**WFH Stipend:** $150 per month to cover the costs of working from home.\n\n**Productivity Stipend:** $250 per year to use on Audible, Calm, Masterclass, Duolingo, Grammarly and so much more.\n\n**Home Office Stipend:** A one-time $750 to help you create your dream office.\n\n**Pet Insurance:** We’ve partnered with Pumpkin to provide insurance for our employee’s fur babies.\n\n*Flock is an equal opportunity employer. We celebrate diverse backgrounds and thoughts and welcome everyone to apply for employment with us. We are committed to fostering an environment that is inclusive, transparent, and collaborative. Mutual respect is central to how Flock operates, and we believe the best solutions come from diverse perspectives, experiences, and skills. We embrace our differences and know that we are stronger working together.*\n\n*If you need assistance or an accommodation due to a disability, please email us at careers@flocksafety.com. This information will be treated as confidential and used only to determine an appropriate accommodation for the interview process.*\n\n\nCompensation Range: $100K - $140K"},{"_id":"6729073036ada7837e780e9a","title":"Software Developer I - Front End","company":"Cleveland Clinic","location":"Cleveland, OH, US","min_amount":27,"max_amount":42,"description":"Software Developer I\n\n  \n\nJoin the Cleveland Clinic team, where you will work alongside passionate caregivers and provide patient-first healthcare. Cleveland Clinic is recognized as one of the top hospitals in the nation. At Cleveland Clinic, you will work alongside passionate and dedicated caregivers, receive endless support and appreciation, and build a rewarding career with one of the most respected healthcare organizations in the world.\n\n  \n\nAs a Software Developer, you will participate in the successful design, development, troubleshooting and implementation of applications to meet business requirements. You will work with other team members, including more senior developers, to ensure the design and development of software systems is carried out in a timely manner.\n\n **A caregiver in this position works 8:00am – 5:00pm.**\n\n**Strongly prefer React and NextJS experience**\n\n**Must live in Ohio**\n\n  \n\nA caregiver who excels in this role will:\n\n* Perform coding, debugging, testing and troubleshooting throughout the application development process.\n* Adhere to the team's defined SDLC best practices, including use of templates and source control.\n* Participate in story writing, estimating and backlog refinement sessions.\n* Follow department guidelines regarding time tracking and work assignment.\n* Debug and troubleshoot code-related issues and defects.\n* Support projects and provide ongoing application support in an agile development environment.\n* Deliver solutions and deliverables as part of a squad in an agile development environment.\n* Complete assigned tasks within the established time estimate.\n* Provide after-hours support as appropriate.\n  \n\nMinimum qualifications for the ideal future caregiver include:\n\n* ITIL Foundations certification upon hire or within six months of employment.\n* Two years of experience developing ASP.NET, VB.NET and/or C# applications.\n* An associate’s degree and one year of experience will substitute the experience requirement.\n  \n\nPreferred qualifications for the ideal future caregiver include:\n\n* Associate’s degree in information technology, computer science or a related field.\n* Basic understanding of database and application services.\n* Front-end developer with experience in technologies such as React, Sanity and Next.js.\n* Understanding of basic front-end technologies.\n  \n\nOur caregivers continue to create the best outcomes for our patients across each of our facilities. Click the link and see how we’re dedicated to providing what matters most to you: https://jobs.clevelandclinic.org/benefits-2/\n\n **Physical Requirements:**\n\n* Ability to perform work in a stationary position for extended periods.\n* Ability to travel throughout the hospital system.\n* Ability to operate a computer and other office equipment.\n* Ability to communicate and exchange accurate information.\n\n**Personal Protective Equipment:**\n\n* Follows standard precautions using personal protective equipment.\n**Pay Range: $27.65 - $42.17 / hour**\n\n\nThe pay range displayed on this job posting reflects the anticipated range for new hires. While the pay range is displayed as an hourly rate, Cleveland Clinic recruiters will clarify whether the compensation is hourly or salary. A successful candidate's actual compensation will be determined after taking factors into consideration such as the candidate's work history, experience, skill set, and education. This is not inclusive of the value of Cleveland Clinic's benefits package, which includes among other benefits, healthcare/dental/vision and retirement."},{"_id":"6729073036ada7837e780e9b","title":"Android Developer","company":"QSS","location":"North Chicago, IL, US","min_amount":55,"max_amount":60,"description":"Job Title: Android Developer\n\nLocation: Chicago IL\n\nDuration: Contract\n\nJob Description:\n\nDesign, develop, and maintain Android applications using Jetpack Compose.-\n\nCollaborate with cross-functional teams to define, design, and ship new features.-\n\nWrite clean, maintainable, and testable code while following best practices.-\n\nEnsure the performance, quality, and responsiveness of the applications.-\n\nOptimize apps for performance, scalability, and user engagement.-\n\nDebug and resolve issues, providing support for ongoing app updates.-\n\nStay up-to-date with new mobile technology trends, including Android development standards and Jetpack Compose updates.-\n\nParticipate in code reviews to maintain a high-quality codebase\n\nJob Type: Contract\n\nPay: $55.00 - $60.00 per hour\n\nBenefits:\n\n* 401(k)\n* Dental insurance\n* Health insurance\n\nAbility to Relocate:\n\n* North Chicago, IL 60064: Relocate before starting work (Required)\n\nWork Location: Hybrid remote in North Chicago, IL 60064"},{"_id":"6729073036ada7837e780e9c","title":"Software Engineer","company":"Summit County Public Health","location":"Akron, OH, US","min_amount":null,"max_amount":null,"description":"Are you interested in serving your community? Are you seeking a career in Public Health? Join **Summit County Public Health!** We are searching for a Software Engineer to work full time (35 hours per week) Monday through Friday. The Software Engineer develops and maintain in-house software and databases, enhancing the efficiency and functionality of our operations. This role includes programming internal data systems, supporting SQL databases, creating custom reports, and ensuring data connections to external APIs for seamless integration. This is an opportunity for an experienced software engineer to impact public health directly through technical innovation and collaboration\n\n**Key Responsibilities:**\n\n* Develop and maintain internal software and databases, ensuring data accessibility and reliability.\n* Utilize Summit County Public Health's Software Development Life Cycle (SDLC) for system design, development, and deployment.\n* Provide ongoing system maintenance, troubleshoot issues, and support the help desk.\n* Collaborate with cross-functional teams to communicate project progress, offer recommendations, and drive improvements.\n* Maintain thorough documentation and deliver regular status reports to stakeholders.\n* Stay current with development tools, participate in training, and apply best practices in programming.\n\n**Qualifications:**\n\n* High school diploma with certifications/experience, or Bachelor's in Computer Science (preferred); 3-5 years in software development.\n* Proficiency in SQL, programming, Google Suite, Microsoft Office; strong coding and troubleshooting abilities.\n* Valid Ohio driver's license and insured vehicle.\n\n\nSummit County Public Health (SCPH) is committed to fostering, cultivating and preserving a culture of diversity and inclusion. Our human capital is the most valuable asset we have. The collective sum of the individual differences, life experiences, knowledge, inventiveness, innovation, self-expression, unique capabilities and talent that our employees invest in their work represents a significant part of not only our culture, but our reputation and organization's achievement as well. We embrace and encourage our employees' differences in age, color, disability, ethnicity, family or marital status, gender identity or expression, language, national origin, physical and mental ability, political affiliation, race, religion, sexual orientation, socio-economic status, veteran status, and other characteristics that make our employees unique."},{"_id":"6729073036ada7837e780e9d","title":"Senior Software Engineer - (Full-Stack)","company":"Biofire","location":"Broomfield, CO, US","min_amount":150000,"max_amount":180000,"description":"### **WHO WE ARE**\n\n\nBiofire Technologies is on a mission to give gun owners better tools for reducing preventable gun injuries and deaths, especially among children. We believe our technology, combined with a best-in-class customer experience, will define the future of firearms safety for the next generation. Our mission-driven approach has earned support from the firearm community, the tech world, and the media.\n  \n\n  \n\nBiofire employees encompass a diverse range of talents, including world-class engineers with expertise in designing and testing firearms, medical devices, robots, cars, satellites, rockets, and supersonic jets. Our team is united by a shared commitment to safety and reliability, values that guide our work across various backgrounds and disciplines.\n\n### **OUR CULTURE**\n\n\nReducing accidental firearm injuries and deaths requires original thinking and authentic collaboration, so we’re deeply invested in building a team and culture that can achieve our mission together. Team members enjoy autonomy and flexibility from day one, so expect to be immediately tasked with solving challenging problems and building new systems that work. We’ll hold you accountable for executing audacious goals, giving and receiving honest feedback, and helping your teammates succeed. You’ll receive respect, kindness, and support from every direction while you figure out how to get it all done.\n\n### **ABOUT THE ROLE**\n\n\nAs a Senior Software Engineer at Biofire, you will be responsible for building software for high-reliability, safety-critical products. To succeed in this role, you should be a skilled software engineering generalist who likes working on various projects, self-driven, obsessed with details, and comfortable operating in a multidisciplinary R&D environment.\n\n\nYou will need to be able to develop high-quality, highly-reliable software while contributing to architecture and problem-solving as a member of the Software team. Delivering on defined requirements will be a vital part of your role, but you will also be expected to bring a passion for solving novel problems, proactively engaging with your colleagues across engineering to drive to the very best solution and rigorously pressure test the status quo.\n\n### **KEY RESPONSIBILITIES**\n\n\nDay-to-day responsibilities of the role will include:\n\n* Responsible for creating and upholding excellence across engineering standards, design, review processes, and testing across all aspects of the team's work;\n* Will be comfortable working with a variety of languages, frameworks and levels of abstraction from embedded to high level application development;\n* Creating coding standards and unit testing;\n* Configuration management;\n* Deploy software tools, processes and metrics;\n\n### **QUALIFICATIONS**\n\n\nWe understand that not all applicants will possess skills that perfectly align with our job qualifications. At Biofire, we appreciate diverse experiences from various industries, and we encourage all individuals who meet the necessary qualifications to submit their applications. While having the \"desired\" qualifications may strengthen a candidate's profile, we also welcome applicants with alternative experiences to apply.\n\n* Strong understanding of programming fundamentals;\n* Proficiency in various languages such as Java, Kotlin or C/C++;\n* Proficiency in TypeScript\n* Experience with Agile Methodologies;\n* Familiarity with CI/CD pipelines and automated testing practices to help streamline the software development process and ensure high code quality.\n\n### **COMPENSATION AND BENEFITS**\n\n\nIn addition to competitive pay, as a full-time employee at Biofire you are eligible for:\n\n* Stock Options in Biofire, 401(k), HSA - and other financial benefits\n* Medical Insurance - including plan options with $0 payroll deduction\n* Dental, Vision and Life Insurance Plans - with $0 payroll deduction\n* 3 Weeks Vacation and Sick time (Flex Time for salary positions), and 11 Paid Holidays\n* Parental Leave - and other family-building, adoption and surrogacy benefits\n\n\nThe compensation range for this role is **$150,000 - $180,000**/annual salary + stock options + benefits.\n\n\nPay offered may vary depending on multiple individualized factors, including market location, job-related knowledge, skills, and experience. The total compensation package for this position may also include other elements dependent on the position offered. Details of participation in these benefit plans will be provided if an employee receives an offer of employment.\n\n### **LOCATION**\n\n\nThis is a full-time, salaried role. Our dog-friendly, state-of-the-art headquarters is located in beautiful Broomfield, Colorado, between Boulder and Denver. The team regularly engages in collaborative in-person sessions at our vibrant office space, but you will be offered the flexibility to work from home as needed.  \n\n  \n\nWe expect you to bring your very best, and in return, we will provide the support necessary for you to excel. You'll collaborate with colleagues you appreciate, respect, and find inspiration from, and have access to all the technical resources needed.\n\n### **DIVERSITY & INCLUSION**\n\n\nWe’re bringing innovation to a technological problem that has persisted for decades, so we depend on diverse, inclusive, and collaborative teams to break new ground and do great work. We welcome people from all qualified backgrounds, and we don’t discriminate based on race, religion, color, political affiliation, national origin, gender (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics.\n\n### **ELIGIBILITY**\n\n\nThis role handles information subject to US Export Control Regulations. Applicants must be (a) a citizen of the United States; (b) a lawful permanent resident of the United States (“Green Card” holder); or (c) a person admitted into the United States as an asylee or refugee to be considered for the position."},{"_id":"6729073036ada7837e780e9e","title":"Full Stack Developer","company":"CACI International","location":"VA, US","min_amount":82100,"max_amount":172400,"description":"Full Stack Developer\nJob Category: Information Technology\nTime Type: Full time\nMinimum Clearance Required to Start: None\nEmployee Type: Regular\nPercentage of Travel Required: Up to 10%\nType of Travel: Local\n\\* \\* \\* **The Opportunity:**\n\n\nCACI is currently looking for a Software Developer with agile methodology experience to join our BEAGLE (Border Enforcement Applications for Government Leading-Edge Information Technology) Agile Solution Factory (ASF) Team supporting Customs and Border Protection (CBP) client located in Northern Virginia! Join this passionate team of industry-leading individuals supporting the best practices in Agile Software Development for the Department of Homeland Security (DHS).\n\n\nAs a member of the BEAGLE ASF Team, you will support the men and women charged with safeguarding the American people and enhancing the Nation’s safety, security, and prosperity. CBP agents and officers are on the front lines, every day, protecting our national security by combining customs, immigration, border security, and agricultural protection into one coordinated and supportive activity.\n\n\nASF programs thrive in a culture of innovation and are constantly seeking individuals who can bring creative ideas to solve complex problems, both technical and procedural at the team and portfolio levels. The ability to be adaptable and to work constructively with a technically diverse and geographically separated team is crucial. You should have worked with or have a strong interest in agile software development practices and delivering deployable software in short sprints.\n\n **Responsibilities:**\n\n\nServe as an Agile Scrum team member providing software development and maintenance for the delivery of releasable software in short sprint cycles. Responsible for activities associated with delivery of software solutions associated with customer-defined systems and software projects by working in close collaboration with software developers/engineers, stakeholders, and end users within Agile processes. Responsible for:\n\n* Designing, developing, and implementing custom software and database application capabilities for a variety of legacy and modernized systems with limited oversight\n* Acting as a member of a product team supporting teammates and collaborating with a do what it takes attitude to ensure product and team success\n* Providing improvements to the product(s) being supported\n* Actively participate in release and sprint planning, artifact creation, sprint testing, regression testing, demonstrations and retrospectives and solution releases\n* Supporting release planning with conceptual design and development / refinement of software engineering guidelines\n* Analyzing complex project-related problems and creating innovative solutions involving, scheduling, technology, methodology, tools and solution components\n* Ensuring product quality and timeliness of work, providing advice and guidance, resolving problems to meet objectives, and providing periodic performance reports\n* Providing mentoring to junior members of the team\n\n**You have:**\n\n* Must be a U.S. Citizen with the ability to pass CBP background investigation, criteria include but are not limited to:\n\t+ 3 year check for felony convictions\n\t+ 1 year check for illegal drug use\n\t+ 1 year check for misconduct such as theft or fraud\n* College degree (B.S.) in Computer Science, Software Engineering, Information Management Systems or a related discipline. Equivalent professional experience will be considered in lieu of degree\n* Professional Experience: at least seven (7) years related technical experience, with software design, development and implementation in a Windows Environment\n\n **Qualifications:**  \n\n  \n\n*Required:*\n\n* Demonstrated professional experience with our tech stack: Java / C# (.NET Core) , Hibernate, PostgreSQL, Spring MVC, Sprint Boot, Angular / React.\n* Creating reusable libraries, develop interactive and responsive interfaces, implement complex solutions, encouraging quality code through conducting reviews/leading tests, and applying beautiful visualizations to solutions\n* Implement new features by transforming mockups into fully functional user interfaces integrated with API enabled microservice built on Spring-boot/Java or C# (.NET Core) based backend\n* Bridge the gap between user interface design and technical implementation\n* Passion for user experience and user-centric development\n* Continuously research new and best coding practices\n* Optimize application for maximum speed and scalability\n* Strong communication skills that include leading design-related conversations, ability to build and nurture good relationships and foster an environment for collaboration\n* Experience with source code control systems and concurrent development workflows (Git preferred)\n* Understanding of all elements of the software development life cycle, including planning, development, requirements management, CM, quality assurance, and release management.\n\n *Desired:*\n\n* Technical Certifications, such as AWS Certified Developer, AWS Certified Solutions Architect, OCP Java, etc.\n* DevOps experience /CI/CD pipeline.\n* Ability to support and enhance applications built on a Spring Boot or .NET Core technical stack\n\n* \n\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**What You Can Expect:**\n\n **A culture of integrity.**\n\n\nAt CACI, we place character and innovation at the center of everything we do. As a valued team member, you’ll be part of a high-performing group dedicated to our customer’s missions and driven by a higher purpose – to ensure the safety of our nation.\n\n **An environment of trust.**\n\n\nCACI takes pride in fostering a diverse and accessible culture where every individual feels supported to chart their own path. You’ll have the autonomy to take the time you need through a unique flexible time off benefit and have access to robust learning resources to make your ambitions a reality.\n\n **A focus on continuous growth.**\n\n\nTogether, we will advance our nation's most critical missions, build on our lengthy track record of business success, and find opportunities to break new ground — in your career and in our legacy.\n\n **Your potential is limitless.** So is ours.\n\n\nLearn more about CACI here.\n\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**Pay Range**: There are a host of factors that can influence final salary including, but not limited to, geographic location, Federal Government contract labor categories and contract wage rates, relevant prior work experience, specific skills and competencies, education, and certifications. Our employees value the flexibility at CACI that allows them to balance quality work and their personal lives. We offer competitive compensation, benefits and learning and development opportunities. Our broad and competitive mix of benefits options is designed to support and protect employees and their families. At CACI, you will receive comprehensive benefits such as; healthcare, wellness, financial, retirement, family support, continuing education, and time off benefits. Learn more here.\n\n\nSince this position can be worked in more than one location, the range shown is the national average for the position.\n\n\nThe proposed salary range for this position is:\n\n\n$82,100-$172,400*CACI is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, age, national origin, disability, status as a protected veteran, or any other protected characteristic.*"},{"_id":"6729073036ada7837e780e9f","title":"Automation Test Engineer","company":"CACI International","location":"Ashburn, VA, US","min_amount":82100,"max_amount":172400,"description":"Automation Test Engineer\nJob Category: Information Technology\nTime Type: Full time\nMinimum Clearance Required to Start: None\nEmployee Type: Regular\nPercentage of Travel Required: Up to 10%\nType of Travel: Local\n\\* \\* \\* **The Opportunity:**\n\n\nServe as a Test Engineer who will be responsible for activities associated with delivery of customer-defined systems and software projects; basic responsibilities include:\n\n* Developing Test procedures – Creating test procedures for current set of backlog items: system, functional, regression, performance, load, installation, security, interoperability, stress, boundary; defining tests for backlog items; estimating tasks needed for creating manual tests; and assessing candidates to automate for regression tests\n\n* Developing and implementing quality assurance methodologies to ensure compliance with quality assurance standards, guidelines, and procedures in a large computer-based organization.\n\n* Developing and executing software test plans, test cases, and test scripts in JAVA for Integration, Migration, Regression, and/or Performance testing, in order to identify system and software problems and their causes, recording defect backlog items, reporting the results of testing and resolving testing defects.\n\n* Run test validations at various levels including DB validation (SQL), logging validation, and UI validation.\n\n* Mapping tasks and tests to backlog items (requirements traceability).\n\n* Supporting independent User Acceptance Testing\n\n* Acting as a member of a product team supporting teammates and collaborating with a do what it takes attitude to ensure product and team success.\n\n* Active participation in Agile Scrum sprint planning, artifact creation, sprint testing, regression testing, demonstrations and retrospectives and solution releases.\n\n* Work closely with developers, professional services team and product managers to define the automated testing components that will be used to validate requirements against developed software.\n\n* Work closely with Product Owners to understand product specifics and to create corresponding automation test strategies.\n\n* Assist with creating project resource estimates, metrics to track completion phase, defect reports, defect prevention, development efficiency and quality\n\n* Contribute to an atmosphere of cross-functional teamwork within the organizations agile project lifecycle.\n\n* Support hardware inventory and shipping of equipment as needed.\n\n* Document new purchase orders and manage current inventory.\n\n* Support testing efforts during scheduled and unscheduled Change Requests after hours and weekends as needed.\n\n* Provide mission support activities after hours and as needed.\n\n **Responsibilities:**\n\n* Excellent written and verbal communication skills\n\n* Experience participating in a high performing, highly engaged and motivated CM team\n\n* Solid experience in incremental software development projects using an Agile Scrum approach\n\n* Understanding of all elements of the software development life cycle\n\n* Highly responsible, team-oriented individual with very strong communication skills and work ethic; self-starter\n\n\nBonus would be having:\n\n* Automated & manual testing experience.\n\n* Experience using Jira and/or related Agile project tools and plug-ins\n\n **Qualifications:**  \n\n  \n\n*Required:*\n\n**You have:**\n\n* Must be a U.S. Citizen with the ability to pass CBP background investigation, criteria include, but not limited to:\n\n\no3-year check for felony convictions\n\n\no1-year check for illegal drug use\n\n\no1-year check for misconduct such as theft or fraud\n\n* College degree (B.S. or greater) in Computer Science, Software Engineering, Information Management Systems or a related discipline. Experience accepted in lieu of degree.\n\n* Ability to write test documentation - Test Plans; Test Procedures; Change Requests; System Requirements Documents; Problem Reports, Discrepancy Reports\n\n* Hands on OOP programming experience with JAVA\n\n* Familiar working with Continuous Integration (CI) environment such as Jenkins/Hudson, TeamCity, Bamboo\n\n* Expert in working with Open Source Automation tools like Selenium, Cucumber, TestNG\n\n* Comfortable working with an open source or commercial version control systems like GIT\n\n* 7+ years of Experience testing solutions developed in JAVA. Additionally, familiarity with any of the following is highly desirable: XML, SQL, PL/SQL, HTML, VMware, information exchanges, client server, Object Oriented Development, Continuous integration, Automated testing, UML, Class diagrams, n-tier solutions\n\n* Experience with continuous integration tools and environments and automated testing.\n\n* Familiarity with Information Security best practices\n\n* Ability to apply test estimation techniques to software development efforts\n\n* Must have experience with Functional Testing, Integration Testing, System Testing, and User Acceptance Testing phases\n\n* Must have knowledge and understand fundamental concepts of Continuous Integration, Automated Testing, User Acceptance Testing\n\n* Must be a team player and work in a collaborative team environment.\n\n* Ability and experience to interact with the product Owner, Business Analysts, Scrum Masters and provide guidance on automation tools and testing methods to meet project specific needs.\n\n *Desired:*\n\n* *Experience in performance testing using a framework such as jMeter*\n\n* \n\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**What You Can Expect:**\n\n **A culture of integrity.**\n\n\nAt CACI, we place character and innovation at the center of everything we do. As a valued team member, you’ll be part of a high-performing group dedicated to our customer’s missions and driven by a higher purpose – to ensure the safety of our nation.\n\n **An environment of trust.**\n\n\nCACI takes pride in fostering a diverse and accessible culture where every individual feels supported to chart their own path. You’ll have the autonomy to take the time you need through a unique flexible time off benefit and have access to robust learning resources to make your ambitions a reality.\n\n **A focus on continuous growth.**\n\n\nTogether, we will advance our nation's most critical missions, build on our lengthy track record of business success, and find opportunities to break new ground — in your career and in our legacy.\n\n **Your potential is limitless.** So is ours.\n\n\nLearn more about CACI here.\n\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**Pay Range**: There are a host of factors that can influence final salary including, but not limited to, geographic location, Federal Government contract labor categories and contract wage rates, relevant prior work experience, specific skills and competencies, education, and certifications. Our employees value the flexibility at CACI that allows them to balance quality work and their personal lives. We offer competitive compensation, benefits and learning and development opportunities. Our broad and competitive mix of benefits options is designed to support and protect employees and their families. At CACI, you will receive comprehensive benefits such as; healthcare, wellness, financial, retirement, family support, continuing education, and time off benefits. Learn more here.\n\n\nSince this position can be worked in more than one location, the range shown is the national average for the position.\n\n\nThe proposed salary range for this position is:\n\n\n$82,100-$172,400*CACI is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, age, national origin, disability, status as a protected veteran, or any other protected characteristic.*"},{"_id":"6729073036ada7837e780ea0","title":"Principal Software Systems Engineer","company":"Dhara Consulting Group","location":"El Segundo, CA, US","min_amount":120001,"max_amount":160000,"description":"Today\nSecret\nUnspecified\nUnspecified\nIT - Software\nEl Segundo, CA **(ON-SITE/OFFICE)****Description**\n  \n\n  \n\nSAIC is seeking a Software Engineer 's for its customers Team! This is a role heavily focused on solving complex challenges in multiple classified cloud environments with a high-performing team of collaborative professionals. This position is responsible for responsive and coherent planning, development, and delivery assessment of systems and networks within the environments to identify where those systems and networks deviate from acceptable configurations, enclave policy, or local policy.\n  \n\n  \n\nThe Software Development team is responsible for providing not only working the customers product life cycle, but as well, any proprietary systems in use to support the customers' mission . We are looking for talent primarily in Vandenberg, CA, Colorado Springs, CO, and El Segundo, CA for hybrid work situation. Each of the roles require differing levels of clearance, ranging from Secret to Top Secret/SCI. Depending on the skillsets in demand, remote availability may be acceptable with travel and applicable access to SCIFs.\n  \n\n  \n\nThis work supports the USSF Operational C2 Mission under Kobayashi Maru. USSF has multiple cloud environments in an existing global, interconnected, disparate, virtualized, hybrid, and Enterprise IT infrastructure hosting mission systems, applications, services, and data that serves the U.S. Space Force (USSF) and other Government Customers. OSC2 LOE1 facilitates the Government's efforts to operate and maintain current environments, while assisting with the migration of applications to multiple cloud environments, allowing for increased efficiencies across the entire spectrum of the USSF operations .\n  \n\n  \n\nKey Duties /Responsibilities :  \n\n  \n\n  \n\nDesign, develop, test, and maintain software applications that support USSF operations and mission objectives .  \n\n* \n\n  \n\n  \n\nCollaborate with cross-functional teams to gather and analyze requirements, ensuring alignment with technical and business goals.  \n\n* \n\n  \n\n  \n\nImplement software solutions using modern programming languages and frameworks, adhering to best practices and coding standards.  \n\n* \n\n  \n\n  \n\nConduct software validation and verification, performing debugging and troubleshooting to resolve issues effectively.  \n\n* \n\n  \n\n  \n\nDevelop and maintain documentation for software design, architecture, and user guides.  \n\n* \n\n  \n\n  \n\nParticipate in code reviews, providing constructive feedback and ensuring high-quality code output.  \n\n* \n\n  \n\n  \n\nAssist in the integration of software components and third-party programs.  \n\n* \n\n  \n\n  \n\nStay updated on emerging technologies and contribute to continuous improvement initiatives.  \n\n* \n\n  \n\n  \n\nResponsible for code development and code deployment for the software version releases which modifies the software baseline of the BMEWS/PAVE PAWS ground-based radar sensors.  \n\n* \n\n  \n\n  \n\nDesigns, develops, documents, tests and debugs application software.  \n\n* \n\n  \n\n  \n\nConducts analysis and collaborates with subject matter experts in the planning, design, development, and utilization of electronic data processing systems for information storage, processing, presentation, manipulation, display, or reporting.  \n\n* \n\n  \n\n  \n\nAbility to support system integration, test, development, and execution of various types of complex systems.  \n\n* \n\n  \n\n  \n\nDevelops technical solutions to complex problems, which require the regular use of ingenuity and creativity.  \n\n* \n\n  \n\n  \n\nParticipate in troubleshooting systems to resolve complex issues, interact, and coordinate with engineers responsible for sustaining operational and test systems.  \n\n* \n\n  \n\n  \n\nDeveloping experience on both AWS and Azure clouds; both commercially or TS+ .  \n\n* \n\n  \n\n  \n\nMust have an active Secret to TS/SCI clearance.  \n\n* \n\n  \n\n  \n\n**Qualifications**\n  \n\n  \n\nRequired Qualifications:  \n\n  \n\n  \n\nBachelor's degree in computer science , Software Engineering, or a related field.  \n\n* \n\n  \n\n  \n\nMinimum of 3- 15 years of experience in software development, with a focus on full-stack or embedded systems.  \n\n* \n\n  \n\n  \n\nProficiency in programming languages such as Java, C++, Python, or similar.  \n\n* \n\n  \n\n  \n\nStrong understanding of software development methodologies, including Agile and DevOps practices.  \n\n* \n\n  \n\n  \n\nExperience with version control systems like Git.  \n\n* \n\n  \n\n  \n\nRequired Certifications :  \n\n  \n\n  \n\nSecurity+ Certification or willingness to obtain within the first year of employment.  \n\n* \n\n  \n\n  \n\nDesired Skills:  \n\n  \n\n  \n\nExperience with developing on cloud platforms such as Google Cloud or OCI .  \n\n* \n\n  \n\n  \n\nFamiliarity with containerization technologies like Docker and Kubernetes.  \n\n* \n\n  \n\n  \n\nExperience working with defense or aerospace applications is beneficial.  \n\n* \n\n  \n\n  \n\nKnowledge of CI/CD pipelines and automated testing frameworks.  \n\n* \n\n  \n\n  \n\nExperience as a Scrum Master.  \n\n* \n\n  \n\n  \n\nExperience as a Product Owner.  \n\n* \n\n  \n\n  \n\nTarget salary range: $120,001 - $160,000. The estimate displayed represents the typical salary range for this position based on experience and other factors.  \n\n  \n\nSAIC accepts applications on an ongoing basis and there is no deadline.  \n\n  \n\nCovid Policy: SAIC does not require COVID-19 vaccinations or boosters. Customer site vaccination requirements must be followed when work is performed at a customer site.**GROUP ID:** 10111346**R****Recruiter**\n\n**APPLY NOW**"},{"_id":"6729073036ada7837e780ea1","title":"Sr Angular UI Developer","company":"Hitachi Digital Services","location":"Dallas, TX, US","min_amount":125000,"max_amount":140000,"description":"**Our Company**\n\n\n\nWe're Hitachi Digital Services, a global digital solutions and transformation business with a bold vision of our world's potential. We're people-centric and here to power good. Every day, we future-proof urban spaces, conserve natural resources, protect rainforests, and save lives. This is a world where innovation, technology, and deep expertise come together to take our company and customers from what's now to what's next. We make it happen through the power of acceleration.\n\n\n\nImagine the sheer breadth of talent it takes to bring a better tomorrow closer to today. We don't expect you to 'fit' every requirement – your life experience, character, perspective, and passion for achieving great things in the world are equally as important to us.\n\n\n**The team**\n\n\n\nAs a part of Product Engineering Services practice, we are looking for talented **Angular UI Developer** to join us to contribute to practice initiatives and keep current in the latest technology developments in the Cloud and Product Engineering space.\n\n\n**The role**\n\n\n**Responsibilities:**\n\n\n\n* Design, Develop & Test Angular based Web App  \n\n2. Skilled in developing re-usable UI modules and unit tests using latest version of Angular (14 or greater) with TypeScript deployed on AWS S3 buckets  \n\n3. Skilled in developing common re-usable frameworks such as Single Sign On, Observability (logging, telemetry), etc.  \n\n4. Ensure UI is developed according to the requirements of Section 508/American Disability Act and perform the necessary testing to validate compliance to these requirements.  \n\n5. Lead the technical solutioning and delivery within the scrum team and mentor junior developers.  \n\n6. Positive attitude in facing technical challenges and handling pressure situations.  \n\n7. Problem solving skills (ready to take up complex work and perform necessary research to find solutions)  \n\n8. Exhibit good communication skills.\n\n\n\n**What you'll bring**\n\n\n**Qualifications:**\n\n\n* At least 10+ years total experience in Designing, Developing & Testing Angular based Web Apps\n* Skilled in developing re-usable UI modules and unit tests using latest version of Angular (14 or greater) with Angular Material, TypeScript deployed on AWS S3 buckets\n* Expertise in Angular concepts (services, guards, resolvers, interceptors, pipes, dependency injection, routing), TypeScript 4+, RxJs operators, good knowledge of HTML/SCSS best practices.\n* Skilled in developing common re-usable frameworks such as Single Sign On, Observability (logging, telemetry), etc.\n* Preferred Skills (must learn before/on the job) - Single-Spa (Micro front-end applications), GraphQL, Ag-Grid.\n* Preferred Skills (must learn before/on the job) - Experience working in AWS environment, knowledge of AWS services and how to deploy MFEs into AWS serverless environment.\n\n\n\nAs required by the equal pay and transparency acts, the expected base salary for this position is: $125k-$140k base+ bonus. The expected pay is determined based on a variety of factors including, but not limited to, depth of experience in the practice area. Employees are eligible to participate in Hitachi Digital Services bonus/variable/commission pay programs, where applicable, and are subject to the program's conditions and restrictions.\n\n\n**About us**\n\n\n\nWe're a global, team of innovators. Together, we harness engineering excellence and passion to co-create meaningful solutions to complex challenges. We turn organizations into data-driven leaders that can make a positive impact on their industries and society. If you believe that innovation can bring a better tomorrow closer to today, this is the place for you.\n\n\n\n#LI-MS2\n\n\n**Championing diversity, equity, and inclusion**\n\nDiversity, equity, and inclusion (DEI) are integral to our culture and identity. Diverse thinking, a commitment to allyship, and a culture of empowerment help us achieve powerful results. We want you to be you, with all the ideas, lived experience, and fresh perspective that brings. We support your uniqueness and encourage people from all backgrounds to apply and realize their full potential as part of our team.\n\n\n**How we look after you**\n\n\n\nWe help take care of your today and tomorrow with industry-leading benefits, support, and services that look after your holistic health and wellbeing. We're also champions of life balance and offer flexible arrangements that work for you (role and location dependent). We're always looking for new ways of working that bring out our best, which leads to unexpected ideas. So here, you'll experience a sense of belonging, and discover autonomy, freedom, and ownership as you work alongside talented people you enjoy sharing knowledge with.\n\n\n*We're proud to say we're an equal opportunity employer and welcome all applicants for employment without attention to race, colour, religion, sex, sexual orientation, gender identity, national origin, veteran, age, disability status* *or any other protected characteristic.* Should you need reasonable accommodations during the recruitment process, please let us know so that we can do our best to set you up for success."},{"_id":"6729073036ada7837e780ea2","title":"Software Developer","company":"ritepros","location":"Portland, ME, US","min_amount":99840,"max_amount":126420,"description":"Software Developer with Bachelor’s Degree in Computer Science, Computer Information Systems, Information Technology, or a combination of education and experience equating to the U.S. equivalent of a Bachelor’s degree in one of the aforementioned subjects.\n\n\n**Job Duties and Responsibilities:**\n\n\n* Work closely with cross-functional teams, comprising Data Engineers, Technical Architects, and Business Analysts to understand business requirements.\n* Create/Update Data Model, Prepare Data Mapping and Technical Design documents as per business requirements, and obtain approval from technical architects and business analysts before proceeding with development.\n* Implementation of Informatica PowerCenter, IDQ, and IICS mappings, tasks, rules, profiling, and unit testing from end to end, and provide ongoing support.\n* Perform Administrative activities such as installing and configuring software, conducting system upgrades including patches, managing users and groups, and monitoring domain objects and logs using tools like Informatica, Stonebranch, and Qlik Replicate.\n* Analyze and work on migration of Informatica PowerCenter objects to IICS. On Migration of objects make sure the functionality runs on on-premises and cloud-based systems remains same.\n* Perform data profiling and collaborate with Data Stewards to identify data anomalies. Design and implement data quality rules and cleansing processes to correct and standardize data. Integrate data quality processes into ETL workflows and set up data quality monitoring alerts.\n* Extract data from Flat files, XML/JSON files, Oracle using Informatica PowerCenter, Power Exchange, IICS and loaded into multiple target systems like PostgreSQL, Amazon S3, MS SQL Server.\n* Integrate cloud-based and on-premises applications using IICS connectors and APIs. Develop Informatica Cloud solutions for cloud-based application integration, including data synchronization, data Replication, and mapping configuration.\n* Create new connections and develop Full load and Change Data Capture (CDC) tasks utilizing Qlik Replicate to extract data from multiple source systems and load it into target systems such as Amazon S3, Oracle, and Postgres SQL.\n* Perform code migration across environments like DEV, TEST, QA, and PROD, ensuring seamless deployment and consistency throughout the software development lifecycle.\n* Create, schedule, and manage jobs using Stonebranch, ensuring timely execution and monitoring of critical tasks across the infrastructure.\n* Perform upgrades for Stonebranch Controllers and Agents, as well as Qlik Replicate, ensuring minimal downtime and seamless transition.\n* Implement Single Sign-On (SSO) for Stonebranch and Informatica PowerCenter, as well as establish a Disaster Recovery (DR) setup.\n* Troubleshoot intricate issues, identify root causes and implement effective solutions to minimize downtime.\n\n\n**Work experience required for the position:**\n\n\n* At least 3+ years of ETL/Data Development experience in Informatica technology (Powercenter, IDQ, IDMC, IICS).\n* Data migration experience with any cloud databases using IICS (Azure, AWS, GCP).\n* Good working exposure in implementing end-to-end Data warehousing solutions using Informatica and Informatica cloud migration projects.\n* Should have good understanding of IICS Data Integration service, Monitor, Application Integration, Administrator services.\n* Should have working knowledge on IICS Mapping Tasks, Data Synchronization, Data Replication Tasks.\n* Work closely with cross-functional teams, including data engineers, architects, and business analysts to understand business requirements.\n* Translate business needs into technical design documents.\n* Hands-on experience on Server Maintenance, Deployment, Connection creation, Access Management in Informatica Administrator.\n* Install, configure Informatica software and Perform system upgrades, including patches.\n* Troubleshooting, incident root-cause analysis with development teams and Work with vendor on issue resolution.\n* Good knowledge of SQL - Oracle/SQL Server/Postgres SQL/AWS Redshift and Expertise in Linux shell scripting and/or python.\n* Good understanding of Relational and dimensional Data modeling concepts and experience in Data Modeling tools (e.g. Erwin or SQL Data Modeler).\n* Strong IDQ experience (specifically with IDQ 10.4.x and IDQ 10.5.x).\n* Experience in performing data profiling, data mapping, data validation, data manipulation, data analysis.\n* IDQ deployments & UAT/QA validations experience following SDLC process.\n* Qlik replicate: Experience in creating new connections and replication tasks, debug and resolve performance issues, monitoring.\n* Should have working experience in job scheduling using Autosys, Control-M, Stonebranch platforms or other 3rd parties.\n* Experience working in Agile framework and hands on experience using Agile development process, e.g., JIRA.\n\n\n**Environment/ Technologies involved:**\n\n\n\nInformatica 10.5.3, Informatica Intelligent Cloud Services (IICS), Informatica Power Exchange 10.5.3, Oracle 12c/19c, Postgres SQL, MS SQL Server, Erwin, Unix, Stonebranch 7.x, JIRA, Confluence, ServiceNow, Qlik Replicate, AWS, Redshift.\n\n\n\nWork location is Portland, ME with required travel to Client locations throughout USA.\n\n\n\nRite Pros is an equal opportunity employer (EOE).\n\n\n\nPlease Mail Resumes to:\n\n\n\nRite Pros, Inc.  \n\n564 Congress St, Suite # 305  \n\nPortland, ME – 04101.  \n\nE-Mail: resumes@ritepros.com"},{"_id":"6729073036ada7837e780ea3","title":"Senior Software Developer","company":"ritepros","location":"Portland, ME, US","min_amount":87416,"max_amount":110689,"description":"Senior Software Developer with Bachelor’s degree in Computer Science, Computer Information Systems, Information Technology, or a combination of education and experience equating to the U.S. equivalent of a Bachelor’s degree in one of the aforementioned subjects.\n\n\n**Job Duties and Responsibilities:**\n\n\n* Prepare Oracle Integration End-to-End Business Cases high level design documents and providing estimations based on work assignment.\n* Involve in fixing invalid Configurations, Unit and Integration Testing of Oracle and the Target Data.\n* Involve in Oracle Updates.\n* Integrate Oracle Fusion applications with other business systems and third-party applications.\n* Provide technical support to end-users by investigating and resolving issues related to Oracle Fusion applications, customizations, and integrations.\n* User creation and assigning security roles to provide proper access to a Cloud applications.\n* Hands on experience in OIC.\n* Individual product configurations including Oracle.\n* Administrator of AWS Multitenant environments.\n* Tenant Clone and Data Refresh activities for Multi Tenants in various Cloud Suite Portals.\n* AWS services like EC2, Volume, S3, Snapshots.\n* Create the EC2 instances, taking application DB backups, Snapshot backups, creating Volumes in AWS, export and import of software from S3 buckets.\n* Installation/Updates and configurations of ERP.\n* User creations and assigning security roles to provide proper access.\n* Complete application-level configurations to make sure that the installation is correct by doing Single transaction Integration testing.\n* Trouble shooting and resolving the installation and configuration issues of ERP and its Integrated components.\n* Understanding business data relationships.\n* To work with different data sources like html and xml.\n* Involves in the Implementation of Production issues.\n* Work on Support Release Implementation and Documentation.\n* Implement Deployment Scripts for all the Releases.\n* Design and development of prototypes, demos, and final solutions for the above activities.\n* Analyze and prepare estimates and schedules; Prioritize requirements for the Quarterly releases; Use SharePoint to track the progress.\n* Co-ordinate with offshore and onshore teams, resolved common challenges and discussed daily ticket status updates.\n\n\n**Skill / Knowledge required for the position:**\n\n\n* Extensive hands-on experience in Oracle Fusion and its Integrated products\n* Proactive Oracle Cloud ERP technical design, development &amp; solution working on OIC/ICS Integrations for multiple clients.\n* Having industrial experience in oracle integration cloud (OIC) for developing integrations of Financials & SCM objects of Fusion ERP.\n* Experience in Batch Processing tools like FBDI, BI Reports and ESS jobs for Fusion Applications.\n* Integrating the cloud and on-premises application through OIC (Integration Cloud Service) and SAAS, PAAS integration through SOAP, REST & DB Adaptors.\n* In OIC integration, reading the source data from FTP Server/DB and doing the required transformation and conversion which is required for target application like Fusion FBDI template format, this type of conversion is handled in OIC integration itself without any staging DB.\n* OIC Agent configuration for on-premises to cloud-based integration.\n* Good hands-on experience in oracle fusion SOAP & REST Webservice call for automation through 3rd party testing tools like SOAP-UI, Advance REST Client & Postman.\n* Ability to handle web services in Financial and SCM Modules in fusion application in part of data integration.\n* Experience in developing BI publisher reports and scheduling for outbound integration and RTF customizations.\n* Knowledge of full Oracle stack including Oracle Public Cloud Services.\n* Experience in analysis, requirements gathering and solution development.\n* Highly motivated problem solver willing to deliver quality work.\n* Provide status and issue reports to the Project Manager and/or Consulting Lead on a regular basis.\n* Exceptionally collaborative, flexible, and adaptable when working with customers and various teams within Client.\n* Working experience in Databases like Oracle and SQL Server 2019.\n* Having knowledge in UNIX commands and shell scripts.\n* Hands on experience on Bflow tool, BOD development Tool.\n* Extensively worked with different data sources like html and xml.\n* Experience supporting and working with cross-functional teams in a dynamic environment.\n* Experience in Enterprise solution engineering.\n* Ability to lead and communicate with a wide variety of team members and client roles.\n* Experience creating road maps and architectural reference diagrams.\n* Sound ability to provide level of effort estimates and coordinate prioritization efforts of Solution Architects and Integration Architects.\n* Competence in sophisticated Java programming.\n* Experience with web, database, object-oriented software technologies and SDLC methodologies.\n* Able to work in a fast-paced, multifaceted environment with multi-functional teams.\n* Must possess strong communication and interpersonal skills.\n\n\nWork location is Portland, ME with required travel to client locations throughout USA.\n\n\n\nRite Pros is an equal opportunity employer (EOE).\n\n\n\nPlease Mail Resumes to:\n\n\n\nRite Pros, Inc.  \n\n565 Congress St, Suite # 305  \n\nPortland, ME – 04101.  \n\nE-Mail: resumes@ritepros.com"},{"_id":"6729073036ada7837e780ea4","title":"Full Stack Developer","company":"ritepros","location":"Portland, ME, US","min_amount":106160,"max_amount":134422,"description":"Full Stack Developer with a Bachelor’s degree in Computer Science, Computer Information Systems, Information Technology, or a combination of education and experience equating to the U.S. equivalent of a Bachelor’s degree in one of the aforementioned subjects.\n\n\n**Job Duties and Responsibilities:**\n\n\n* Actively participate in requirement gathering sessions with project managers, thoroughly understanding project goals, user needs, and technical specifications.\n* Leverage your knowledge of design patterns and algorithms to architect secure and scalable software solutions.\n* Employ best practices in software development methodologies (e.g., Agile, Waterfall) to ensure timely and efficient project delivery.\n* Utilize version control systems (e.g., Git) to effectively track code changes, facilitate collaboration, and enable rollback capabilities.\n* Work closely with QA teams during the testing phase, writing unit tests, identifying and resolving defects, and ensuring code quality.\n* Develop robust and maintainable backend APIs using Java or Node.js, leveraging frameworks like Spring Boot, Express.js, or NestJS for structured development.\n* Implement efficient database interactions using SQL (e.g., MySQL, PostgreSQL) and write optimized queries for data retrieval and manipulation.\n* Design and build user-centric and responsive front-end interfaces using Angular, adhering to best practices for component-based architecture, state management, and UI/UX principles.\n* Possess a deep understanding of AI concepts, including machine learning, deep learning, and natural language processing (NLP).\n* Utilize Python as your primary language for AI development and be proficient in relevant libraries and frameworks like TensorFlow, PyTorch, Scikit-learn, or spaCy.\n* Integrate pre-trained AI models or train custom models based on project requirements, ensuring data pre-processing, model selection, hyperparameter tuning, and evaluation.\n\n\n**Technical Skills Required:**\n\n\n* Demonstrate a strong understanding of cloud platforms (AWS, Azure, GCP) and their services for scalable deployments.\n* Be familiar with DevOps methodologies to automate build, test, and deployment pipelines (e.g., CI/CD pipelines).\n* Possess knowledge of containerization technologies like Docker and Kubernetes to manage and deploy applications in a containerized environment.\n* Proven experience in software development using:\n\t+ Programming languages: Java, Node.js, Python (with strong AI libraries/frameworks knowledge)\n\t+ Front-end framework: Angular\n\t+ Database: SQL (MySQL, PostgreSQL)\n* Experience with the full SDLC (Software Development Life Cycle).\n* In-depth understanding of AI concepts and hands-on experience with AI development tools.\n* Excellent problem-solving and analytical skills.\n* Strong communication and collaboration skills.\n\n\nWork location is Portland, ME with required travel to client locations throughout USA.\n\n\n\nRite Pros is an equal opportunity employer (EOE).\n\n\n\nPlease Mail Resumes to:\n\n\n\nRite Pros, Inc.  \n\n565 Congress St, Suite # 305  \n\nPortland, ME 04101\n\n\n\nE-Mail: resumes@ritepros.com"},{"_id":"6729073036ada7837e780ea5","title":"Staff Developer Advocate","company":"PineCone","location":"CA, US","min_amount":168000,"max_amount":205000,"description":"**About Pinecone:**\n\n\nPinecone is on a mission to build the search and database technology to power AI applications for the next decade and beyond. Our fully managed vector database makes it easy to add vector search to AI applications. Since creating the “vector database” category, demand has grown incredibly fast and it shows in our user base. We are a distributed team with clusters in New York, San Francisco, Tel-Aviv, and Manchester.\n\n**About the Team and Role:**\n\n\nAs a Staff Developer Advocate at Pinecone, you will apply your AI development and instructional skills to help Pinecone users succeed as they discover, explore, and build with vector databases. Our educational videos, articles, and workshops contribute significantly to our success and our users’ success, so you will make an immediate and measurable impact. You will report to the Director of Developer Relations and collaborate with the Marketing, Engineering, Product, and Customer Success teams.\n\n\nTo succeed in this role, you must have technical skills to use and demonstrate best practices for our API-first product. You must be passionate about sharing this knowledge with others through tutorials, video snippets, docs contributions, hackathon mentorship, and social posts. Our team is growing fast and the customers are growing even faster, so you must be comfortable working with a high degree of autonomy in a fast-paced environment.\n\n**In this role, you will:**\n\n* Uncover the common issues self-serve users face in Pinecone, and create content such as tutorials, example notebooks, docs guides, or videos to help them through those issues.\n* Engage with users on the Pinecone forums, on social channels, and in local hackathons to answer common questions and help them get started with Pinecone.\n* Proactively create instructional materials (content, videos, and code samples) for our docs, social profiles, and community forum.\n* Collaborate with Engineering and Product to influence the product roadmap as the “voice of the community.”\n\n**Requirements:**\n\n* 8+ years of experience in a technical role such as software engineering, solution engineering, or machine learning.\n* Fluency with the modern AI stack: LLMs, vector databases, evaluation tools, etc.\n* Superb written and verbal communication skills.\n* Ability to travel 10–20% of the year throughout the US for events.\n\n**Bonus Points:**\n\n* 2+ years of developer advocacy experience.\n\n**Perks & Benefits:**\n\n* Comprehensive health coverage including Medical, Dental, Vision\n* Free mental health therapy sessions; free One Medical, Tela-doc, and Health Advocate subscriptions\n* Cost-savings on gynecology, fertility, and family-building care\n* Equity award\n* 401(k)\n* Flexible time off\n* Paid parental leave\n* Annual Department Retreat\n* WFH Equipment Stipend\n\n\nDiversity, Equity, Inclusion and Belonging (DEIB) are the cornerstone of everything we do at Pinecone. Studies have shown that women and people of color are less likely to apply for jobs unless they believe they meet every one of the qualifications in a job description. Our top priority is finding the best candidate for the job and if you are interested in the position, we would encourage you to apply, even if you don’t believe you meet every one of the qualifications listed in this posting. All qualified applicants will receive considerations for employment without regard to race, color, religion, sex, age, disability, marital status, familial status, sexual orientation, pregnancy, gender identity, gender expression, national origin, ancestry, citizenship status, veteran status, and any other legally protected status under federal, state, or local anti-discrimination laws.\n\n\nCompensation Range: $168K - $205K"},{"_id":"6729073036ada7837e780ea6","title":"Video Game Designer","company":"Desdemona Capital","location":"Miami Beach, FL, US","min_amount":22,"max_amount":25,"description":"**Job Title: Motion Graphic Designer (Animated GIF Specialist)**  \n**Location:** [Insert Location]  \n**Job Type:** Part-time / Contract  \n**Salary:** $22-$25/hr  \n**Job Overview:**  \nWe are seeking a creative and detail-oriented **Motion Graphic Designer** with a specialization in **animated GIFs** to join our team. The ideal candidate will have a strong background in motion design, a passion for storytelling through animation, and the technical skills required to create high-quality, engaging GIFs for digital platforms. You will collaborate with the marketing, content, and design teams to bring visual concepts to life, ensuring they align with the brand’s aesthetic and message.  \n**Key Responsibilities:**\n\n* **Design and produce high-quality animated GIFs** that capture the brand's identity and engage the audience.\n* Collaborate with the content, social media, and marketing teams to understand project requirements and deliver creative solutions.\n* Create animations from scratch or utilize existing assets (illustrations, logos, photos, etc.) to build engaging motion graphics.\n* Optimize animated GIFs for web, ensuring they are **small in file size** while maintaining high visual quality.\n* Work on various projects including **social media content**, email campaigns, websites, ads, and digital marketing assets.\n* **Stay updated on design trends and technologies**, continuously improving the animation process and techniques.\n* Ensure all designs meet **platform-specific requirements** (e.g., for Instagram, Facebook, or websites) and perform well on all devices.\n* **Revise and iterate** on designs based on feedback from stakeholders to achieve the desired outcomes.\n* Maintain consistency in style and branding across all motion graphics.\n\n**Qualifications:**\n\n* Bachelor’s degree in **Graphic Design, Motion Design, Animation,** or a related field (or equivalent work experience).\n* **2+ years of experience** in motion graphics, animation, or related roles.\n* Proficiency in **Adobe Creative Suite**, especially **After Effects, Photoshop,** and **Illustrator**.\n* Strong knowledge of **GIF creation and optimization techniques** (e.g., frame rates, looping, compression).\n* Experience with **storyboarding, timing, and pacing** to create fluid and captivating animations.\n* Familiarity with **web-optimized GIF** production, balancing quality with file size for fast-loading content.\n* Excellent visual design skills, including **typography, color theory,** and **layout**.\n* Ability to work under deadlines, handle multiple projects, and communicate effectively with team members.\n* Portfolio showcasing **motion design** work, particularly animated GIFs or similar short-form content.\n\n**Preferred Qualifications:**\n\n* Experience creating **social media content** or **digital marketing assets**.\n* Knowledge of **HTML/CSS** for web animations is a plus.\n* Familiarity with other motion graphic tools like **Cinema 4D** or **Blender** is a bonus.\n\n**Benefits:**\n\n* Competitive salary and performance-based incentives.\n* Flexible work hours and remote work options.\n* Opportunities for professional growth and creative freedom.\n* Collaborative and innovative work environment.\n* Access to industry-standard tools and resources.\n\nJob Types: Part-time, Contract, Temporary\n\nPay: $22.00 - $25.00 per hour\n\nSchedule:\n\n* 4 hour shift\n* 8 hour shift\n* Weekends as needed\n\nWork Location: In person"},{"_id":"6729073036ada7837e780ea7","title":"Software Engineer II (Ruby on Rails)","company":"Fearless","location":"Remote, US","min_amount":109503,"max_amount":181143,"description":"### **Reasonable Accommodations**\n\n\n\nFearless complies with federal and state disability laws and makes reasonable accommodations for applicants and candidates with disabilities. If reasonable accommodation is needed to participate in the job application or interview process, please email hr@fearless.techto submit a formal request to Human Resources.\n\n\n### **Compensation**\n\n\n**Our Compensation System is designed to reward remarkable work, grow your impact and support the whole \"you\" over the course of your career.**\n\n\n\nWe believe in paying people fairly, so we've established a compensation model aimed to ensure everyone at Fearless — regardless of race, ethnicity, gender, sexual orientation, disability, religion, age, nationality, or negotiation skills — is given equal pay for equal work. The salary ranges for this position based on location are listed below. The base pay range is subject to change and may be modified as a part of our annual salary range review.\n\n  \n\n\n### **Salary**\n\n\n* AL, FL, GA, TN Residents: $90,015 (min) - $117,019 (mid) - $144,024 (max)\n* NC Residents: $92,799 (min) - $120,639 (mid) - $148,478 (max)\n* DE, MD, PA, TX, VA Residents: $97,439 (min) - $126,671 (mid) - $155,902 (max)\n* DC Residents: $109,503 (min) - $142.354 (mid) - $175,204 (max)\n* CA & NY Residents: $113,215 (min) - $147,179 (mid) - $181,143 (max)\n\n### **Location**\n\n\n* In-person, hybrid, and remote options are available. Our offices are located in Baltimore.\n* **This position is 100% REMOTE.**\n\n  \n\n\n### **Employment Type**\n\n\n* Full-time\n\n  \n\n\n\nFearless is looking for a **Software Engineer II** to add to our diverse team of **250+** employees (and counting!).\n\n\n### **What you'll be doing:**\n\n\n\nWe're looking to change the world by building software with a soul, and we want your help.\n\n\n\nThe Software Engineer II develops, maintains, and enhances complex software systems that solve customer and user problems. This role brings breadth across software development skills and depth in specific technologies like languages and frameworks that allows them to build effective software solutions. The Software Engineer II shares in the responsibility with other software engineers and team members to deliver maintainable solutions.\n\n\n\nWe need your coding skills! What other skills will help you succeed at Fearless? Glad you asked! We're excited about candidates who can accomplish the following:\n\n\n### **Responsibilities and Contributions**\n\n\n#### **Organizational and Leadership Role**\n\n\n* Coaches and mentors others to develop their professional skills.\n* Takes initiative for their own growth through personal leadership.\n\n#### **Functional Role**\n\n\n* Decomposes tasks into discrete objectives to serve the strategic direction of the team.\n* Builds software solutions with minimal direction in the form of maintainable code in accordance with the project/organization technical standards.\n* Delivers complete software solutions that function well within the full system including documentation and automated unit/integration tests.\n* Debugs existing software and corrects defects.\n* Performs manual exploratory testing individually and with the team, as appropriate for the project test strategy.\n* Advises the team on specific implementation options that meet business requirements.\n* Contributes actively in team Agile processes through collaboration, discussion, and/or preparation.\n* Provides feedback to improve the team's technical procedures.\n* Collaborates with other Engineers and Designers to implement features that meet design specifications and deliver business value.\n* Contributes during all phases of the development lifecycle from task creation to production deployment of new code.\n* Coaches others on the team through code reviews.\n* Seeks and engages peer-reviews of tasks and deliverables; coaches others when reviewing their tasks and deliverables.\n\n### **Essential Skills, Experience, or Competencies**\n\n\n**Must-Have Skills**\n\n\n* **BS in Computer Science, Information Systems, Information Technology, Mathematics, Electrical Engineering, Computer Engineering, or similar technology-related degree.**\n* **A minimum of 5 years of demonstrated working experience with Ruby on Rails.**\n* **A minimum of 3 years of demonstrated working experience with Javascript, HTML, CSS.**\n* **Demonstrated experience with building out production applications.**\n* The ability to obtain required security clearance for this project, if requested.\n* Proficient in web-development including front-end (browser) and back-end (server) including UI components, client-server integrations, APIs, and data persistence\n* Proficient with important libraries and technologies in the ecosystem of programming language expertise.\n* Proficient with the unit testing frameworks appropriate to the language of expertise.\n* Proficient with HTML, Javascript and ability to quickly translate designs into well structured markup and maintainable CSS.\n* Proficient with at least one front-end technology like React, Angular, Vue, Ember, Backbone, Svelte.\n* Experience with building applications in containerized development environments.\n* Expert in basic git actions like cloning, creating branches, navigating between branches, staging code for commit, committing code, resetting, and merging.\n* Demonstrated interest in and ability to learn new systems and technology quickly.\n* Ability to discuss technical tasks and team process topics with team members and outside stakeholders.\n* Proficiency with advanced Git actions like rebasing, squashing, and cherry-picking.\n* Ability to operate and manage work, strategically reason, and build relationships and influence others.\n\n\n**Highly Desired Skills**\n\n\n* **Local, State, or Federal government working experience is a HUGE plus.**\n* Understanding of Agile principles.\n* Experience implementing applications for execution in a containerized production environment; for example Docker in a container orchestration platform like Amazon ECS or Kubernetes.\n* Experience developing applications hosted with a cloud provider such as Amazon Web Services, Microsoft Azure, Google Cloud Platform, or similar IaaS/PaaS providers.\n* Experience with test scripting frameworks like Selenium and Cypress.js.\n* Holds a current CompTIA Security+ certification.\n\n### **So, what's next?**\n\n\n\nOver the years, we've honed our interview process to help ensure that every team member we hire is the right fit for us and that we're the right fit for them. If we think you're a good fit, we'll get in touch and start scheduling your interviews! Depending on the role's/project's requirements, the interview process may include some differences. At the minimum\n\n\n* **Introductory Interview:** This is where you and your recruiter will build rapport, explore your career and educational background, discuss salary expectations, role requirements, and set expectations for the interview process, specific to the position of interest.\n* **Technical Interview (Skills Fit)**: This is where we get into the nitty gritty of the project. During the Technical Interview, you'll be interviewed by the technical team to dig more into your background and technical capabilities.\n* **Business Interview:** At this point, you've made it to the final frontier! The Business Interview is when you'll meet with Fearless leadership to dot the i's, cross the t's, and determine whether or not we'll be moving forward with the hiring process.\n\n\n### **About Fearless Digital**\n\n\n\nFearless Digital builds software with a soul. As a division inside Fearless, we're part of its digital services integrator model to unlock the power of organizations, people and tech. Our division designs, engineers, and delivers digital solutions to solve problems and drive impact. Using iterative development cycles, we minimize risk for our customers and efficiently deliver intuitive and responsive technology. In this way, we help set the stage for tech to work better for people. That's not our only goal, though. We also strive to create a purple culture that makes our team members excited to come to work every day. We take a holistic approach to our people's well-being, and our culture and benefits are designed to support our people in working the way they like best. We encourage our people to pursue their passions, both in and out of the office. With flexible schedules, continuing education support, and a family-friendly work environment, we've created a culture that allows our team to thrive professionally and personally.\n\n\n\nFearless believes in equal opportunity employment. We won't discriminate against any employee or applicant on the basis of race, gender, nationality, age, religion, disability, military status, or sexual orientation. As a company and as individuals, we're committed to providing an inclusive and welcoming environment for our team, our family members, our clients, our subcontractors, and our vendors.\n\n\n### **Fearless Digital Benefits**\n\n\n**Benefits Eligibility:**\n\n\n* **Full-time team members** ***are eligible*** for benefits upon beginning employment at Fearless\n* Part-time team members **are only eligible** for 8.75 days of safe & sick leave\n* Interns and 1099 team members are ***not eligible*** for Fearless benefits\n\n\nOur people make us who we are. We believe that every member of the Fearless team has something to share, and we value the unique viewpoint you'll bring to our community. But we value your community, too, so we offer fulfilling work that stays in balance with the rest of life. Because everyone has different needs, desires, and goals, our benefits offer the choices and flexibility that our team members need to live well and succeed. Here are a few highlights of our benefits package, for **full-time team members, exclusively**:\n\n\n* Life-friendly schedules\n* Family-friendly workplace\n* We cover 100% of your premium for our medical HSA plan + the deductible portion of HSA contributions, 80% of your premium for our HMO or PPO plans, and offer competitive dependent coverage. We cover 100% of dental and vision premiums for you and your dependents and offer medical and dependent care FSA options. We also offer life insurance, short- and long-term disability coverage, and legal planning and support insurance.\n* Tech, education / training, and wellness allowances\n* Safe Harbor 401(k) plan with employer contributions (current match = 4%) and immediate vesting\n* Referral bonus: Bring your friends! If someone you refer is hired, you'll get a bonus of $6–12k!\n* Total Pet Plan\n* Employee Assistance Program\n* Up 12 weeks of FMLA paid at 100%\n* PTO is provided to team members as a lump sum allowance, not an accrual. PTO is prorated based on your start date (**see table below**) on a quarterly basis (with tenure-based increases), 8.75 days of sick leave, 11 federal holidays, their birthday (8 hours), up to 15 days for jury duty, and up to 3 days (24 hours) of bereavement leave per eligible instance.\n\n**Start Date** **PTO Allocation** **Allocation Timing**\n  \n\nJan 1 - March 31 100% January\n  \n\nApril 1 - June 30 75% April\n  \n\nJuly 1 - Sept 30 50% July\n  \n\nOct 1 - Dec 31 25% October"},{"_id":"6729073036ada7837e780ea8","title":"DevOps Engineer","company":"Fischer International Identity","location":"Naples, FL, US","min_amount":80000,"max_amount":110000,"description":"**JOB DESCRIPTION**\n\n**Position Title:** **Reports To: AVP of Technical Operations**\n\n**Summary**\n\nWe are looking for a DevOps Engineer with experience to join our engineering team. In this role, you will be directly responsible for implementing, deploying, and maintaining CI/CD pipelines and the required cloud infrastructure for the continuous integration and delivery of the software suite. You will also use your deep and broad technical experience to develop efficient and scalable solutions to keep the DevOps technologies and infrastructure up to date. The ideal candidate is a self-starter with a strong desire to increase efficiencies and make an impact while contributing to a cross-functional team.\n\n**Duties**\n\n· Build, design, deploy, and test continuous integration and continuous delivery process using tools like Jenkins, Git, Azure DevOps etc.\n\n· Monitor CI/CD builds while analyzing trends and making performance improvements to build times.\n\n· Performs routine application maintenance to ensure the DevOps environment runs smoothly.\n\n· Provide technical leadership, assessments, strategies, and roadmaps for DevOps projects and initiatives.\n\n· Leads from a position of knowledge and deep understanding of the tools and tech stack used for DevOps.\n\n· Collaborate with the development team to bring new features and services into production using best practices.\n\n· Work closely with infrastructure to align the cloud infrastructure with the production environment.\n\n· Build new CI/CD pipelines as required while incorporating automated testing and vulnerability scanning.\n\n**Qualifications**\n\nTo perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below represent the knowledge, skill, and/or ability required.\n\n· Must have at least 2-3 years of DevOps experience.\n\n· Proficiency in a range of DevOps tools, including Docker, Kubernetes, Jenkins, Git, and more.\n\n· A comprehensive understanding of Continuous Development processes and best practices, encompassing coding standards, code reviews, source control management, build processes, testing, and operations.\n\n· In-depth knowledge of various AWS services, such as EC2, EKS, Secret Store, S3, CloudWatch, Load Balancer, RDS, VPN etc.\n\n· Experience in containerization and virtualization technologies.\n\n· Proven expertise in deploying, supporting, and monitoring both new and existing services, platforms, and application stacks.\n\n· Strong scripting experience with Python, Bash or equivalent\n\n· Ability to identify, recommend, and implement automated solutions for manual processes.\n\n· Test automation and/or security test automation experience is a plus.\n\n**Certificates/Licenses/Registrations:** N/A\n\n**Physical Requirements:** Position may require sitting at a desk or standing for long periods of time. Must be able to lift 15 pounds at times.\n\n**Special Requirements:**\n\n*Language/Social Skills* - Ability to read, analyze, and interpret customer requirements. The ability to consult customers on best practices on how to apply Identity concepts to business requirements.\n\n*Analytical Skills* – Ability to process and analyze vague, abstract verbal and written instructions as well as execute tasks in a fast-paced environment. The ability to think logically and programmatically. Strong troubleshooting skills and a passion for finding out what went wrong.\n\n*Computer Skills –* Must be proficient with Microsoft office programs, including Excel, Word, and PowerPoint. Understand the concepts of programming and scripting. Automation experience with Active Directory, LDAP, Google Apps, MSSQL, Oracle Database, PostgreSQL, batch processing via flat file. Automated event detection techniques and an understanding of the technical mechanics of application integration and APIs. Experience deploying or supporting enterprise Identity Management Solutions. Experience in a security discipline, NIST, and other control frameworks, and ETL technology.\n\n*Other Personal Skills and Attributes –* Ability to actively learn and listen. Must possess critical thinking, complex problem-solving skills, and strong analytical capabilities. Must be able to handle confidential information with a high level of professionalism and discretion. Must also be able to function well in a high-paced and at times, stressful environment. Maintain a sense of integrity and commitment to customer satisfaction. Must be self-motivated and consistently review internal processes and enhancing product and solution knowledge, as well IAM industry knowledge.\n\n**Work Environment**\n\n**Environmental Conditions:** Professional office environment.\n\n**Travel, Work Hours, Supervision**\n\n**Travel Expectations:** N/A\n\n**Work Hours:** Monday – Friday, 8:00AM - 5:00PM with 1 hour for lunch, or other typical office hours approved by the manager, as well as additional hours necessary to perform your duties.\n\n**On-Call Coverage:** As needed\n\nSupervision: N/A\n\n**Compensation and Benefits**\n\n**Compensation:** Full-time, salaried exempt\n\n**Benefits:** Eligible for full-time employee benefit package, including insurance (medical, dental, vision, life, disability) and 401K\n\nJob Type: Full-time\n\nPay: $80,000.00 - $110,000.00 per year\n\nBenefits:\n\n* 401(k)\n* 401(k) matching\n* Dental insurance\n* Flexible spending account\n* Health insurance\n* Health savings account\n* Life insurance\n* Paid time off\n* Tuition reimbursement\n* Vision insurance\n\nSchedule:\n\n* 8 hour shift\n* Holidays\n* Monday to Friday\n* On call\n* Weekends as needed\n\nExperience:\n\n* Azure: 1 year (Preferred)\n* AWS: 2 years (Preferred)\n* Kubernetes: 2 years (Preferred)\n\nAbility to Commute:\n\n* Naples, FL 34105 (Preferred)\n\nAbility to Relocate:\n\n* Naples, FL 34105: Relocate before starting work (Required)\n\nWork Location: Hybrid remote in Naples, FL 34105"},{"_id":"6729073036ada7837e780ea9","title":"Ruby on Rails Developer","company":"Persistent Systems","location":"Opelika, AL, US","min_amount":75000,"max_amount":95000,"description":"**Essential Qualifications:**\n\n* A minimum of 2 years of hands-on experience in software development with a solid understanding of full-stack development practices and principles.\n* Ruby on Rails.\n* Advanced proficiency in programming languages such as Java, C#, and C/C++.\n* Demonstrated experience in designing, developing, and consuming RESTful APIs.\n* Familiarity and active participation in Agile methodologies, including experience in sprint planning, iterative development, and deployment practices.\n\n**Preferred Skills and Experience:**\n\n* Knowledge and use of web development technologies like HTML and CSS.\n* Experience with JavaScript programming.\n* Familiarity with modern frontend frameworks (e.g., React, Angular, Vue.js).\n* Understanding and utilization of backend development tools and technologies.\n* Experience with database management systems and web storage solutions.\n* Exposure to AI-driven programming and development tools.\n* Proficiency in version control systems, particularly Git and GitHub.\n* Understanding of web protocols such as HTTP and working with REST-based services.\n\nJob Types: Full-time, Contract\n\nPay: $75,000.00 - $95,000.00 per year\n\nBenefits:\n\n* 401(k)\n* 401(k) matching\n* Dental insurance\n* Health insurance\n* Paid time off\n* Vision insurance\n\nSchedule:\n\n* 8 hour shift\n* Monday to Friday\n\nApplication Question(s):\n\n* This job is only open to Green Card holders and Citizens. Please mention your work authorization?\n\nExperience:\n\n* Ruby on Rails: 2 years (Required)\n* RESTful API: 2 years (Required)\n* Back-end development: 1 year (Required)\n\nAbility to Commute:\n\n* Opelika, AL 36804 (Required)\n\nAbility to Relocate:\n\n* Opelika, AL 36804: Relocate before starting work (Required)\n\nWork Location: In person"},{"_id":"6729073036ada7837e780eaa","title":"Manager IGA Engineering","company":"HCA Healthcare","location":"Nashville, TN, US","min_amount":null,"max_amount":null,"description":"##### **Introduction**\n\n\nAre you looking for a work environment where diversity and inclusion thrive? Submit your application for our Manager Identity Governance and Administration Engineering opening with HCA Healthcare today and find out what it truly means to be a part of the HCA Healthcare team.\n\n##### **Benefits**\n\n\nHCA Healthcare, offers a total rewards package that supports the health, life, career and retirement of our colleagues. The available plans and programs include:\n\n* Comprehensive medical coverage that covers many common services at no cost or for a low copay. Plans include prescription drug and behavioral health coverage as well as free telemedicine services and free AirMed medical transportation.\n* Additional options for dental and vision benefits, life and disability coverage, flexible spending accounts, supplemental health protection plans (accident, critical illness, hospital indemnity), auto and home insurance, identity theft protection, legal counseling, long-term care coverage, moving assistance, pet insurance and more.\n* Free counseling services and resources for emotional, physical and financial wellbeing\n* 401(k) Plan with a 100% match on 3% to 9% of pay (based on years of service)\n* Employee Stock Purchase Plan with 10% off HCA Healthcare stock\n* Family support through fertility and family building benefits with Progyny and adoption assistance.\n* Referral services for child, elder and pet care, home and auto repair, event planning and more\n* Consumer discounts through Abenity and Consumer Discounts\n* Retirement readiness, rollover assistance services and preferred banking partnerships\n* Education assistance (tuition, student loan, certification support, dependent scholarships)\n* Colleague recognition program\n* Time Away From Work Program (paid time off, paid family leave, long- and short-term disability coverage and leaves of absence)\n* Employee Health Assistance Fund that offers free employee-only coverage to full-time and part-time colleagues based on income.\n\n\nLearn more about Employee Benefits\n\n***Note: Eligibility for benefits may vary by location.***  \n\n\n\nWe are seeking a Manager IGA Engineering for our team to ensure that we continue to provide all patients with high quality, efficient care. Did you get into our industry for these reasons? We are an amazing team that works hard to support each other and are seeking a phenomenal addition like you who feels patient care is as meaningful as we do. We want you to apply!\n\n##### **Job Summary and Qualifications**\n\n\nThe Manager - Identity Governance and Administration (IGA) Engineering will orchestrate our organization's IGA program and spearhead the design, implementation, and safeguarding of our identity governance and administration systems. As the Manager of IGA Engineering, you will be accountable for guiding a team of IGA professionals, steering the development and amplification of IGA solutions, and guaranteeing compliance with regulatory requirements and industry best practices. You will unite with cross-functional teams, including IT administrators, security analysts, and business stakeholders, to formulate and uphold identity governance policies, procedures, and controls.\n\n* **Pilot** and **deploy** a comprehensive strategy and roadmap for application onboarding into the IGA system, **synchronizing** with organizational goals and compliance requirements.\n* **Unite** with application owners and stakeholders to **elicit** requirements, assess access needs, and **define** appropriate IGA controls and policies.\n* **Design** and **implement** streamlined processes and workflows for application onboarding, **ensuring** efficiency, accuracy, and compliance.\n* **Oversee** the configuration and customization of IGA systems and tools to **integrate** applications, **enabling** accurate provisioning and deprovisioning of user access.\n* **Collaborate** with cross-functional teams to **ensure** seamless integration of applications with the IGA framework, **addressing** any technical challenges or issues.\n* **Stay abreast** of emerging IGA trends, technologies, and best practices, **making** recommendations for process improvements and system enhancements.\n* **Foster** a culture of security awareness and continuous improvement, **promoting** IGA best practices and knowledge sharing within the organization.\n* **Manage** vendor relationships and contracts related to IGA tools and services, **ensuring** effective service delivery and value for money.\n* **Communicate** progress, risks, and achievements related to application onboarding to senior management and other stakeholders in a **clear** and **concise** manner.\n* **Cultivate** a culture of security awareness and continuous improvement, **championing** IGA best practices and knowledge sharing within the organization.\n* **Manage** vendor relationships related to IGA tools and services **ensuring** effective service delivery.\n* **Perform** code reviews with team members to **stretch** and **create** high performing engineers, while **ensuring** the highest quality of deliverables.\n\n###### **What qualifications you will need:**\n\n\n* Bachelor's degree Information Technology or other applicable degree\n* 7+ years of experience in Identity & Access or Information Technology job role\n* 3+ years of experience in Management job role\n\n **Other Qualifications**\n\n* Excellent leadership and management skills, with the ability to motivate and develop a high-performing team.\n* Microsoft (C#, ASP.net, MS-SQL, Active Directory, Azure, Entra ID) Java / Oracle (Java, Angular, Oracle)\n* Excellent knowledge in Database design, Data Warehousing ETLs, t-SQL performance improvement with large datasets exceeding 1 Million rows, Index tuning, and stored procedures\n* Strong Knowledge in HTML, CSS, Javascript, URL coding, JSON, XML, SOAP, and Rest API\n* In-depth knowledge and understanding of identity governance and administration concepts, methodologies, and best practices.\n* Familiarity with IGA tools and IAM technologies, such as **Saviynt** and **Imprivata**.\n* Understanding of industry regulations and frameworks related to identity and access management, such as HIPAA and HITECH.\n* Strong understanding of network and system security principles and technologies, including firewalls, intrusion detection/prevention systems, and encryption.\n* Strong analytical and problem-solving skills, with the ability to analyze complex access control scenarios and develop appropriate solutions.\n* Excellent communication and interpersonal skills, with the ability to effectively collaborate with cross-functional teams and communicate technical concepts to non-technical stakeholders.\n* Proven ability to manage projects, prioritize tasks, and meet deadlines in a fast-paced environment.\n* Professional certifications in identity and access management (e.g., CISSP, CISM, IAM-specific certifications) are highly desirable.\n\n  \n\nHCA Healthcare has been recognized as one of the World's Most Ethical Companies® by the Ethisphere Institute more than ten times. In recent years, HCA Healthcare spent an estimated $3.7 billion in cost for the delivery of charitable care, uninsured discounts, and other uncompensated expenses.\n\n  \n\n\"Across HCA Healthcare’s more than 2,000 sites of care, our nurses and colleagues have a positive impact on patients, communities and healthcare.  \n\nTogether, we uplift and elevate our purpose to give people a healthier tomorrow.\"- Jane Englebright, PhD, RN CENP, FAAN  \n\nSenior Vice President and Chief Nursing Executive\n\n\nIf you find this opportunity compelling, we encourage you to apply for our Manager IGA Engineering opening. We promptly review all applications. Highly qualified candidates will be directly contacted by a member of our team. **We are interviewing apply today!**\n\n*We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.*"},{"_id":"6729073036ada7837e780eab","title":"Principal Software Engineer","company":"HCA Healthcare","location":"Nashville, TN, US","min_amount":null,"max_amount":null,"description":"##### **Introduction**\n\n\nAre you looking for a work environment where diversity and inclusion thrive? Submit your application for our Principal Software Engineer opening with HCA Healthcare today and find out what it truly means to be a part of the HCA Healthcare team.\n\n##### **Benefits**\n\n\nHCA Healthcare, offers a total rewards package that supports the health, life, career and retirement of our colleagues. The available plans and programs include:\n\n* Comprehensive medical coverage that covers many common services at no cost or for a low copay. Plans include prescription drug and behavioral health coverage as well as free telemedicine services and free AirMed medical transportation.\n* Additional options for dental and vision benefits, life and disability coverage, flexible spending accounts, supplemental health protection plans (accident, critical illness, hospital indemnity), auto and home insurance, identity theft protection, legal counseling, long-term care coverage, moving assistance, pet insurance and more.\n* Free counseling services and resources for emotional, physical and financial wellbeing\n* 401(k) Plan with a 100% match on 3% to 9% of pay (based on years of service)\n* Employee Stock Purchase Plan with 10% off HCA Healthcare stock\n* Family support through fertility and family building benefits with Progyny and adoption assistance.\n* Referral services for child, elder and pet care, home and auto repair, event planning and more\n* Consumer discounts through Abenity and Consumer Discounts\n* Retirement readiness, rollover assistance services and preferred banking partnerships\n* Education assistance (tuition, student loan, certification support, dependent scholarships)\n* Colleague recognition program\n* Time Away From Work Program (paid time off, paid family leave, long- and short-term disability coverage and leaves of absence)\n* Employee Health Assistance Fund that offers free employee-only coverage to full-time and part-time colleagues based on income.\n\n\nLearn more about Employee Benefits\n\n***Note: Eligibility for benefits may vary by location.***  \n\n\n\nWe are seeking a Principal Software Engineer for our team to ensure that we continue to provide all patients with high quality, efficient care. Did you get into our industry for these reasons? We are an amazing team that works hard to support each other and are seeking a phenomenal addition like you who feels patient care is as meaningful as we do. We want you to apply!\n\n##### **Job Summary and Qualifications**\n\n\nWhat makes HCA Healthcare Information Technology Group (ITG) unique as a technology company is that our solutions ultimately impact the care of patients. Although our skills are needed many industries, we in ITG apply them specifically to the noble cause of healthcare. We are \"Healthcare Inspired.\" It is this guiding vision that pervades and positively influences every level of our organization. It shapes our mission, defines our values, and brings our leaders and employees together in a shared enthusiasm for their work, setting ITG apart as a uniquely purpose-driven company in the IT industry. As a part of that, we exist to raise the bar, unlock possibilities, and care like family.\n\n* A principal software engineer role is responsible for providing engineering leadership across all facets of system and application design and implementation. This role will actively develop software solutions both independently and in a team.\n* The candidate will provide leadership and technical mentorship to foster a collaborative and effective working relationship between business, analysts, developers, and other teams within the organization. The role requires the candidate to possess excellent communication, proposal, and presentation skills in order to inform senior management and development staff of status and direction.\n* This position is within an innovation team that operates on multiple initiatives across the enterprise. The candidate must be comfortable in moving to different technical ecosystems from project to project that will require discovery and adaptation to systems, teams, and business stakeholders..\n* We are on a mission to change the face of the healthcare industry through value driven products. These products will create innovation to all users of healthcare across HCA’s nationwide ecosystem. To do this we are building teams that are curious and quick to adapt to new technologies.\n\n**Major Responsibilities:**\n\n* Promote a collaborative team environment and work closely with colleagues to achieve business objectives.\n* Collaborate with stakeholders (e.g. business stakeholders, product owners, project managers, and end users) to understand functional and non-functional requirements.\n* Lead Investigations and solution proposals to development and design problems.\n* Guide team members in scope of work estimation and forecasting.\n* Performing proof-of-concept or proof-of-technology tasks to get buy-in from cohorts and stakeholders.\n* Collaborates with team members to successfully execute development initiatives using Agile practices and principles\n* Gather requirements, designs, constructs and delivers solutions either individually or with a team\n* Serve as a leader to the team’s continuous integration and continuous delivery automation pipeline\n* Participates in large-scale development projects involving multiple areas outside of core team\n* Designs fit-for-purpose products to ensure products align to the customer's strategic plans and technology road maps\n* Formulate unit and integration tests and conduct functional and performance testing where appropriate.\n* Adhere to and influence established development practices and processes.\n* Practices and adheres to the “Code of Conduct” philosophy and “Mission and Value Statement.”\n* Training and mentoring of peers and other staff\n* Performs other duties as assigned\n\n**Education & Experience:**\n\n* Bachelor's degree Computer Science or related field required\n* 8+ years of experience a Software development or engineering roles required\n\n**Knowledge, Skills, Abilities, Behaviors:**\n\n* Growth mindset and a willingness to learn new skills, technologies, and frameworks required\n* Full-stack experience working with various languages, platforms, and other tools, systems including, but not limited to some combination of: SQL or noSQL databases (e.g. SQL Server, DB2, Teradata, CosmosDB, MongoDB), ETL and data-pipeline type tools (e.g. SSIS, GCP DataFlow, Azure DataFactory), message queue type systems (e.g. Azure EventHub, GCP PubSub, Kafka, RabbitMQ), microservice environments (e.g. Docker/Kubernetes, C#, Java, Python, NodeJS), and APIs (e.g. REST, OpenAPI) required\n* Experience interfacing with or working within CRM, ERP, eCommerce, or EMR/EHR solutions and common integration patterns preferred\n* Experience with DevOps tooling (e.g. GitHub, Azure DevOps) required\n* Experience with diagramming tools (e.g. Visio) required\n* Strong Experience in cloud native, deploying within cloud environments, serverless development and/or container-based solutions required\n* Strong understanding of best practices in the design of REST-based APIs required\n* Strong Understanding of agile methodology and software development lifecycles required\n* Demonstrated ability to communicate complex technical information in a condensed manner to various stakeholders verbally and in writing required\n* Ability to lead community events with a focus on software development or delivery required\n* Excellent problem solving and analytical skills required\n* Troubleshooting skills including experience working with utilities for log analysis and load testing required\n* Ability to work independently and lead a team to specific outcomes required\n* Strong ability to understand context for code, the codebase, and its relation to business objectives required\n* Understanding of IT contracting and purchasing practices preferred\n* Ability to lead technical interviews of potential candidates of a vary levels preferred\n* Ability to sit for long periods of time required\n\n**Travel Required**\n\n\n\n\n* Occasional Travel: The job may require travel from time- to-time, but not on a regular basis.\n\n\nHCA Healthcare has been recognized as one of the World's Most Ethical Companies® by the Ethisphere Institute more than ten times. In recent years, HCA Healthcare spent an estimated $3.7 billion in cost for the delivery of charitable care, uninsured discounts, and other uncompensated expenses.\n\n  \n\n\"Across HCA Healthcare’s more than 2,000 sites of care, our nurses and colleagues have a positive impact on patients, communities and healthcare.  \n\nTogether, we uplift and elevate our purpose to give people a healthier tomorrow.\"- Jane Englebright, PhD, RN CENP, FAAN  \n\nSenior Vice President and Chief Nursing Executive\n\n\nIf you find this opportunity compelling, we encourage you to apply for our Principal Software Engineer opening. We promptly review all applications. Highly qualified candidates will be directly contacted by a member of our team. **We are interviewing apply today!**\n\n*We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.*"},{"_id":"6729073036ada7837e780eac","title":"Full Stack Software Engineer IV","company":"HCA Healthcare","location":"Nashville, TN, US","min_amount":null,"max_amount":null,"description":"##### **Introduction**\n\n\nDo you want to join an organization that invests in you as a(an) Full Stack Software Engineer IV? At HCA Healthcare, you come first. HCA Healthcare has committed up to $300 million in programs to support our incredible team members over the course of three years.\n\n##### **Benefits**\n\n\nHCA Healthcare, offers a total rewards package that supports the health, life, career and retirement of our colleagues. The available plans and programs include:\n\n* Comprehensive medical coverage that covers many common services at no cost or for a low copay. Plans include prescription drug and behavioral health coverage as well as free telemedicine services and free AirMed medical transportation.\n* Additional options for dental and vision benefits, life and disability coverage, flexible spending accounts, supplemental health protection plans (accident, critical illness, hospital indemnity), auto and home insurance, identity theft protection, legal counseling, long-term care coverage, moving assistance, pet insurance and more.\n* Free counseling services and resources for emotional, physical and financial wellbeing\n* 401(k) Plan with a 100% match on 3% to 9% of pay (based on years of service)\n* Employee Stock Purchase Plan with 10% off HCA Healthcare stock\n* Family support through fertility and family building benefits with Progyny and adoption assistance.\n* Referral services for child, elder and pet care, home and auto repair, event planning and more\n* Consumer discounts through Abenity and Consumer Discounts\n* Retirement readiness, rollover assistance services and preferred banking partnerships\n* Education assistance (tuition, student loan, certification support, dependent scholarships)\n* Colleague recognition program\n* Time Away From Work Program (paid time off, paid family leave, long- and short-term disability coverage and leaves of absence)\n* Employee Health Assistance Fund that offers free employee-only coverage to full-time and part-time colleagues based on income.\n\n\nLearn more about Employee Benefits\n\n***Note: Eligibility for benefits may vary by location.***\n\n  \n\nYou contribute to our success. Every role has an impact on our patients’ lives and you have the opportunity to make a difference. We are looking for a dedicated Full Stack Software Engineer IV like you to be a part of our team.\n\n##### **Job Summary and Qualifications**\n\n\nPosition Summary\n\n\nThe Product & Technology Organization at HealthTrust defines and implements solutions that empower our customers, suppliers, and business partners to realize savings and drive improved clinical outcomes. If we do our jobs well, we lower costs for healthcare providers, enabling them to make care more affordable for all. In this position, you will:\n\n* Work in a dynamic, collaborative, transparent, non-hierarchal, and ego-free culture where your contribution is valued over a title.\n* Discover business problems, hypothesize solutions, and use data to quickly test, learn, and implement solutions that deliver value.\n* Minimize in-progress work by focusing on the most important thing\n\n\nMajor Responsibilities:\n\n* Write user interface and server-side code\n* Write unit tests, integration tests and functional tests\n* Automate deployment and management of platforms using cloud technologies\n* Performs other duties as assigned.\n* Practices and adheres to the “Code of Conduct” and “Mission and Value Statement.”\n\n\nEducation & Experience:\n\n* Development skills with React, Vue, .NET Core, or other applicable languages\n* Experience with ETL processes or Analytics/Reporting applications\n* Experience with Microsoft Azure or Amazon Web Services (AWS)\n* Development experience with Microsoft SQL or Postgres, including advanced features\n* Experience in developing modern, scalable applications\n* Strong initiative, self-motivated, and able to drive results with minimal guidance\n* Comfortable with uncertainty, ambiguity, and change\n* Ability to proficiently handle tasks independently\n* Ability to take ownership and lead a team of various levels of experience\n* A professional, relaxed, and enthusiastic attitude\n* Pragmatic focus on delivering business value, with a relentless focus on creating and measuring outcomes\n* Demonstrated ability to value team over individual success by focusing on collaboration and progress instead of dogma\n* Continuously seeks opportunities to learn and improve self and team\n* Solid problem-solving and analytical skills\n* Effective interpersonal, written, and oral communication skills\n* Supply chain or healthcare industry experience a plus\n* Relevant Years Experience: 4+\n\n\nLicenses & Certifications:\n\n* Bachelor’s Degree in Computer Science, Software Engineering, Computer Engineering, Electrical Engineering, Electronics Engineering, or related field.\n\n\nHCA Healthcare has been recognized as one of the World's Most Ethical Companies® by the Ethisphere Institute more than ten times. In recent years, HCA Healthcare spent an estimated $3.7 billion in cost for the delivery of charitable care, uninsured discounts, and other uncompensated expenses.\n\n  \n\n\"Good people beget good people.\"- Dr. Thomas Frist, Sr.  \n\nHCA Healthcare Co-Founder\n\n\nWe are a family 270,000 dedicated professionals! Our Talent Acquisition team is reviewing applications for our Full Stack Software Engineer IV opening. Qualified candidates will be contacted for interviews. **Submit your resume today to join our community of caring!**\n\n*We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.*"},{"_id":"6729073036ada7837e780ead","title":"Sr. Java Full Stack Developer - C2H (only USC)","company":"ITCommence Inc","location":"Remote, US","min_amount":70,"max_amount":75,"description":"Role: Java Fullstack Developer\n\nDuration: 6 month contract-to-hire\n\nLocation: 100% remote EST hours\n\nNo C2C\n\nExperience level: 5-12 years of experience (varies based on Education, a Bachelor's Degree at minimum is required)\n\nIV Process: 1 and done virtual IV for 1 hour\n\nClearance: **Must be willing to obtain a Public Trust Clearance (Can get the public trust after starting)**\n\n**Required Technical Skills:**\n\n* Back-end Java experience\n* Front-end React experience\n* Spring Boot experience\n* Utilizing Scrum\n* AWS\n* Java or Type Script\n* Nice to Have:\n* Dockers and Kubernetes\n* 508 compliance experience\n\nJob Types: Full-time, Contract\n\nPay: $70.00 - $75.00 per hour\n\nSchedule:\n\n* 8 hour shift\n\nApplication Question(s):\n\n* Do you have active Public trust Clearance?\n\nEducation:\n\n* Bachelor's (Required)\n\nExperience:\n\n* AWS: 4 years (Preferred)\n* java development: 10 years (Required)\n* Spring Boot: 10 years (Required)\n\nSecurity clearance:\n\n* Secret (Required)\n\nWork Location: Remote"},{"_id":"6729073036ada7837e780eae","title":"Senior Software Engineer (K8s)","company":"Mirantis","location":"Oregon City, OR, US","min_amount":125360,"max_amount":158733,"description":"**Company Description** **Mirantis** is an **open cloud** company that helps organizations achieve digital self determination by giving them complete control over their strategic infrastructure. The company combines intelligent automation and cloud-native expertise for managing and operating virtual machines, containers, **Kubernetes**, and cloud environments.\n\n\nWe empower developers and innovators to create extraordinary products and services by automating the discovery, integration, and operation of the best cloud and open source technologies for their unique needs.\n\n\nhttps://www.mirantis.com/\n\n **Job Description**  \n\nMirantis is looking for a talented **Senior Software Engineer with experience in Kubernetes, public clouds and Golang**to help us evolve and expand the product. This person will join our team working on the newest multi-cluster Kubernetes provisioning and management product offering.\n\n**Responsibilities**\n\n* Design, architect, implement and test services and applications running on Kubernetes\n* Debug, troubleshoot and implement solutions for complex engineering problems\n* Participate in requirement, design, planning, and retrospective meetings\n* Work with the geographically distributed team in a dynamic Agile environment\n* Help with customer issues resolutions\n* Evaluate new approaches and technologies, suggest improvements for the product\n* Lead and mentor other engineers in the team\n* Participate in planning, estimation and prioritization of a product features\n\n **Qualifications*** Bachelor degree in CS or related field\n* 5+ years of software engineering experience with a desire to build dependable build and release pipelines\n* Proficiency with **Golang**\n* Strong understanding and experience with **Docker and Kubernetes**\n* Strong **Linux** fundamentals and experience working with Linux distributions\n* Strong system design skills, software architecture, data structures, modern design patterns, microservices\n* Direct experience with public clouds such as AWS / Azure / GCP\n* Experience with open source development is a big plus\n* Experience with instrumenting and utilizing monitoring tools for determining health status of a system (Prometheus, Grafana, etc.) is a big plus\n* Good communication skills, can-do attitude, and focus on results\n* Upper-intermediate spoken and written English\n\n **Additional Information** **What does Mirantis offer you?**\n\n* Opportunity to lead the most popular Kubernetes IDE to its next stage of growth.\n* Join a passionate, mission-driven team with deep technical expertise and an engineering-first culture, dedicated to creating beautiful products, inside and out.\n* Play a pivotal role in shaping the future of cloud-native development, bringing clarity and beauty to the developer experience.\n* Competitive salary and benefits, with opportunities for equity in a fast-growing product line.\n\n\nWe are a Leader for Container Management in G2 (#2 after AWS)!"},{"_id":"6729073036ada7837e780eaf","title":"Cranial Grind & Buff Technician","company":"Orthomerica Products, Inc.","location":"Orlando, FL, US","min_amount":16,"max_amount":17,"description":"**JOB SUMMARY:**\n\nThe CRANIAL GRIND & BUFF TECHNICIAN maintains the flow of product shells in accordance with FDA, Regulatory and Quality procedures.\n\n* ***Shift: M-F 7:30am-4:00pm***\n* ***Pay: $16.00-$17.00 per hour***\n\n**ESSENTIAL FUNCTIONS:**\n\n* Perform all duties in accordance with FDA, Regulatory and Quality procedures.\n* Inspect product shells received from the oven area for defects.\n* Buff the product shells to a smooth finish.\n* Grind plastic to trim line on product shells to meet product specifications.\n* Product shells that are not acceptable are logged down on product scrap log.\n* Ensure that the product shells are sent to the production areas in a timely manner to maintain the flow of product through the warehouse.\n* Check with the supervisor to see which product shells have priority.\n* Check Grinder/Buffer machines to make sure it is working properly. Report any problems with the machines to the supervisor and maintenance.\n* Log in/out work orders in accordance with the order tracker system.\n* Keep a clean and safe work environment according to company/safety rules.\n* Ability to read, write and understand English language.\n\n**ADDITIONAL RESPONSIBILITIES:**\n\n* May be asked to work other production areas when needed.\n* Will be cross-trained to work in other areas.\n* May be required to work overtime when necessary. The ability to work overtime is considered an essential job requirement.\n* Perform other duties as assigned.\n\n**PHYSICAL REQUIREMENTS:**\n\nAbility to exert up to 100 pounds of force occasionally, and/or up to 50 pounds of force frequently, and/or up to 20 pounds of force constantly to move objects.\n\n**VISUAL REQUIREMENTS:**\n\nRequired to have a close visual acuity to perform an activity such as: operating machines such as lathes, drill presses, power saws and mills where the seeing job is at or within arm’s reach; performing mechanical or skilled trades tasks of a non-repetitive nature such as ones by carpenters, technicians, service, people, plumbers, painters, mechanics, etc.\n\n**DESIRED QUALIFICATIONS:**\n\n* High School Diploma.\n\n**MANDATORY QUALIFICATIONS:**\n\n* None listed.\n\nJob Type: Full-time\n\nPay: $16.00 - $17.00 per hour\n\nBenefits:\n\n* 401(k)\n* 401(k) matching\n* Dental insurance\n* Employee assistance program\n* Flexible spending account\n* Health insurance\n* Life insurance\n* Paid time off\n* Tuition reimbursement\n* Vision insurance\n\nSchedule:\n\n* 8 hour shift\n* Monday to Friday\n\nApplication Question(s):\n\n* Are you legally authorized to work in the United States?\n\nEducation:\n\n* High school or equivalent (Required)\n\nWork Location: In person"},{"_id":"6729073036ada7837e780eb0","title":"Senior Programmer Integrator III","company":"Claremont McKenna College","location":"Claremont, CA, US","min_amount":95000,"max_amount":98000,"description":"Equal Opportunity and Nondiscrimination Statement\nIn addition to its commitment to a harassment-free educational and working environment, the College is an equal employment opportunity employer. The College is committed to a policy of equal employment opportunities for all applicants and employees and complies with all applicable state and federal laws on the matter. The College does not unlawfully discriminate on the basis of race, color, religion, sex (including gender, pregnancy, childbirth, or related medical conditions), gender identity, gender expression, national origin, ancestry, age, physical disability, mental disability, medical condition or medical leave, marital status, sexual orientation, or any other category protected by law. The College also prohibits the harassment of any employee on any of these bases.\nLocation:\nClaremont, CA\nJob Posting Title:\nSenior Programmer Integrator III\nJob Details and Requirement:\nBASIC FUNCTION:\nThe Senior Programmer Integrator III will be responsible for integrating, developing, implementing, and maintaining software applications and systems that support the college's strategic goals. The incumbent will work closely with other members of the IT team and stakeholders across the institution to identify and address technology-related needs and will be expected to stay current with emerging trends and best practices in web technologies, APIs, .Net technologies, and AI tools. This position reports to the Senior Director, Solutions.\nDESCRIPTION OF DUTIES AND RESPONSIBILITIES:\nESSENTIAL FUNCTIONS:* Develop and maintain software applications and systems using a variety of web and service technologies such as PHP, .Net, and Python.\n* Integrate third-party APIs and other data sources into existing systems as needed.\n* Coordinate with other members of the IT team and stakeholders across the institution to identify and address technology-related needs.\n* Contribute to the planning and implementation of new technology initiatives.\n* Stay current with emerging trends and best practices in web technologies, APIs, .Net technologies, and AI tools.\n* Provide technical support, documentation, and training as needed.\n* Maintain business partner relationships with a portfolio of assigned organizational units to understand their needs within this responsibility domain and meet their requirements.\n* Perform other duties as assigned.\n\n\nREQUIRED QUALIFICATIONS:\nEDUCATION: Bachelor’s degree in Arts or Sciences with preference for significant background in Information Technology, Computer Science, or related fields, OR equivalent experience.\nEXPERIENCE: At least five years of experience in software development and integration.\nLICENSES: Possess and maintain a valid driver's license and driving record acceptable to the College's automobile insurance carrier.\nREQUIRED KNOWLEDGE, SKILLS, and ABILITIES:* Strong proficiency in web technologies such as PHP, .Net, and Python.\n* Experience integrating third-party APIs and other data sources into existing systems.\n* Solid understanding of software development life cycle (SDLC) methodologies.\n* Strong problem-solving and analytical skills.\n* Excellent communication and collaboration skills.\n* Ability to work independently and as part of a team.\n* Willingness and ability to learn new technologies and tools as needed.\n\n\nREQUIRED HOURS: The regular hours for this full-time position are 8:00 a.m. to 5:00 p.m., Monday - Friday. Regular hours may vary due to the needs of the College or division. Some evening and/or weekend work may be required to support campus programs and activities. Occasional requirements to work outside of standard business hours may be required to ensure timely responsiveness to our college community.\nCLASSIFICATION AND STATUS:\nThis is a full-time, 12-month, year-round, exempt-level, benefits-eligible position. This position qualifies for a $100.00 per month cell phone allowance.\nANTICIPATED SALARY RANGE:\n$95,000 - $98,000 PER YEAR\nPHYSICAL REQUIREMENTS: Normal physical job functions performed within a standard office environment include reaching, grasping, talking, hearing, seeing, and repetitive motions. May occasionally lift/push/pull items up to 20 lbs.  \n\nSUPERVISORY RESPONSIBILITY: None\nGROOMING AND APPEARANCE: The Claremont Colleges seek to maintain a neat and professional image at all times.\nBACKGROUND CHECK: The successful candidate will be required to undergo a full consumer background check. Certain positions will require the successful completion of a post-offer physical agility test. Employment is contingent on the satisfactory results of the aforementioned, in addition to compliance with the requirements cited in this job description.\nADA/OSHA: This job description defines the essential or fundamental job duties of this position. It is assumed that employees hired for this position can perform the essential functions of this job without imposing the risk of substantial harm to the health or safety of themselves or others. It may also include marginal functions, generally defined within Title 1 of the Americans with Disabilities Act (ADA) and the Occupational Safety and Health Administration (OSHA). Reasonable accommodations will be provided for qualified applicants with disabilities who self-disclose.*DISCLAIMER:* *This job description has been designed to indicate the general nature and level of work performed by employees within this* *classification.* *It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this position. Duties and responsibilities can change and develop over time, accordingly the College reviews job description on a periodic basis and may make changes of business necessity.**AT-WILL EMPLOYMENT:* *Employment with the College is “at-will” meaning that the terms of employment may be changed with or without notice, with or without cause, including, but not limited to termination, demotion, promotion, transfer, compensation, benefits, duties, and location of work. There is no agreement express or implied between the College and you for continuing or long-term employment. While the College has every hope that employment relationships will be mutually beneficial and rewarding, employees and the College retain the right to terminate the employment relationship at will, at any time, with or without cause. The President is the only person who can modify or alter the at-will employment relationship.*\nClaremont McKenna College hires and promotes individuals on the basis of their qualifications, consistent with applicable state and federal laws, without regard to race, color, religion, sex, sexual orientation, gender identity, gender expression, pregnancy, breastfeeding or related medical condition, national origin, ancestry, citizenship, age, marital status, physical disability, mental disability, medical condition, genetic characteristic or information, military and veteran status, or any other characteristic protected by state or federal law. Inquiries may be directed to the Assistant Vice President for Human Resources, 528 N. Mills Avenue, Claremont, California 91711-4015, (909) 621-8490. All applicants must complete and submit an online application to be considered for an open position.  \n\n  \n\nEmployment is contingent upon new employee providing documents verifying U.S. citizenship or, for aliens, documents verifying legal permission to work in the United States, applicant's acceptability for positions requiring use of a college vehicle is contingent upon a driving record acceptable to the College's automobile liability insurance. Promotion from within is encouraged whenever qualified employees of Claremont McKenna College are available. Interested employees of the College are urged to contact the Office of Human Resources if qualified for any open position. Please do not contact departments directly.\nDISABILITY ACCOMODATIONS:\nIn compliance with applicable laws ensuring equal opportunities to qualified individuals with a disability, CMC will make reasonable accommodations for the known physical or mental limitations of an otherwise qualified individual (applicant or employee) with a disability if the disability affects the performance of essential job functions, unless the accommodation results in an undue hardship for the College. Employment decisions are based on the merit and not an individual’s disability.  \n\nAn applicant or employee who requires an accommodation should contact the immediate supervisor and the Human Resources Office. If multiple accommodations are identified that do not pose an undue hardship for the College, the selection of an accommodation will be at CMC’s discretion. To request disability accommodation for any part of the application or hiring process, please contact Human Resources at (909) 621-8490 or hr@cmc.edu for assistance.\nClaremont McKenna College hires and promotes individuals on the basis of their qualifications, consistent with applicable state and federal laws, without regard to race, color, religion, sex, sexual orientation, gender identity, gender expression, pregnancy, breastfeeding or related medical condition, national origin, ancestry, citizenship, age, marital status, physical disability, mental disability, medical condition, genetic characteristic or information, military and veteran status, or any other characteristic protected by state or federal law. Inquiries may be directed to the Director for Human Resources, 528 N. Mills Avenue, Claremont, California 91711-4015, (909) 621-8490. All applicants must complete and submit an online application to be considered for an open position.  \n\n  \n\nEmployment is contingent upon new employee providing documents verifying U.S. citizenship or, for aliens, documents verifying legal permission to work in the United States, applicant's acceptability for positions requiring use of a college vehicle is contingent upon a driving record acceptable to the College's automobile liability insurance. Promotion from within is encouraged whenever qualified employees of Claremont McKenna College are available. Interested employees of the College are urged to contact the Office of Human Resources if qualified for any open position. Please do not contact departments directly.\nDisability Accommodations\nIn compliance with applicable laws ensuring equal opportunities to qualified individuals with a disability, CMC will make reasonable accommodations for the known physical or mental limitations of an otherwise qualified individual (applicant or employee) with a disability if the disability affects the performance of essential job functions, unless the accommodation results in an undue hardship for the College. Employment decisions are based on the merit and not an individual’s disability.\nAn applicant or employee who requires an accommodation should contact the immediate supervisor and the Human Resources Office. If multiple accommodations are identified that do not pose an undue hardship for the College, the selection of an accommodation will be at CMC’s discretion. To request disability accommodation for any part of the application or hiring process, please contact Human Resources at (909) 621-8490 or hr@cmc.edu for assistance."},{"_id":"6729073036ada7837e780eb1","title":"Release Manager","company":"Wipro","location":"Plano, TX, US","min_amount":94580,"max_amount":119759,"description":"Overview:\n**About Wipro:**  \n\nWipro Limited (NYSE: WIT, BSE: 507685, NSE: WIPRO) is a leading technology services and consulting company focused on building innovative solutions that address clients’ most complex digital transformation needs. We leverage our holistic portfolio of capabilities in consulting, design, engineering, operations, and emerging technologies to help clients realize their boldest ambitions and build future-ready, sustainable businesses. A company recognized globally for its comprehensive portfolio of services, strong commitment to sustainability and good corporate citizenship, we have over 250,000 dedicated employees serving clients across 66 countries. We deliver on the promise of helping our customers, colleagues, and communities thrive in an ever-changing world.* **A PROUD HISTORY OF OVER 75 YEARS**\n* **FY22 REVENUE 10.4 BN USD**\n* **WE’RE PRESENT IN 66 COUNTRIES**\n* **OVER 1,400 ACTIVE GLOBAL CLIENTS**\n\n **Role: Release Manager****Location: Plano, TX** **Job Description** **Technical Skills:*** JIRA and BMC remedy - release planning in advance, Project Co-ordination, Dry run and UAT testing, work with CRQ , Status Update to stake holders.\n* Strong experience as a release manager\n* Scrum Master or Release Train Engineer working experience is desirable\n* Tableau reporting skills would be a plus\n* Understand release/deployment components.\n* Understand risks and can ally controls necessary to mitigate.\n* Facilitate team planning ceremonies against release milestones.\n* Ability to answer team Agile/waterfall framework questions. Ability to understand big picture and connect all details.\n\n **We are an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, caste, creed, religion, gender, marital status, age, ethnic and national origin, gender identity, gender expression, sexual orientation, political orientation, disability status, protected veteran status, or any other characteristic protected by law. Any complaints or concerns regarding unethical/unfair hiring practices should be directed to our Ombuds Group**."},{"_id":"6729073036ada7837e780eb2","title":"Python Developer (GenAI)","company":"Capgemini","location":"TX, US","min_amount":83932,"max_amount":106277,"description":"#### **Job Description:**\n\nWe seek a skilled Python developer with experience in GenAI to join our dynamic team. The ideal candidate will have a good background in machine learning, data analysis, and software development, and will be adept at working in an agile environment.\n\n\n#### **Key Responsibilities:**\n\n* Hands-on coding using Python and TensorFlow\n* Develop and guide the coding approach based on evolving requirements.\n* Manage and collaborate on developer repositories such as GitHub and Azure Repos.\n* Apply Azure Boards\n* Work closely with other Data Scientists to determine data strategies.\n* Partner with Azure administrators to set up environments for applications.\n* Understand front-end coding and collaborate with MS Teams front-end integration experts.\n\n#### **Required Skills:**\n\n* Proficiency in using GenAI libraries, LangChain, etc.\n* Deep understanding of machine learning algorithms.\n* Expertise with Azure services.\n* Familiarity with ServiceNow APIs and ITIL processes for incident and problem management.\n* Good understanding of the Agile framework\n* Ability to adapt and continuously learn new technologies and methodologies.\n* Commitment to ethical reasoning and responsible AI development.\n* Good ability to collaborate with cross-disciplinary teams.\n* Creative problem-solving skills and user-centric thinking.\n* Excellent written and verbal communication skills.\n\n#### **Life at Capgemini**\n\nCapgemini supports all aspects of your well-being throughout the changing stages of your life and career. For eligible employees, we offer:\n\n\n* Flexible work\n* Healthcare including dental, vision, mental health, and well-being programs\n* Financial well-being programs such as 401(k) and Employee Share Ownership Plan\n* Paid time off and paid holidays\n* Paid parental leave\n* Family building benefits like adoption assistance, surrogacy, and cryopreservation\n* Social well-being benefits like subsidized back-up child/elder care and tutoring\n* Mentoring, coaching and learning programs\n* Employee Resource Groups\n* Disaster Relief\n\n#### **About Capgemini**\n\nCapgemini is a global business and technology transformation partner, helping organizations to accelerate their dual transition to a digital and sustainable world, while creating tangible impact for enterprises and society. It is a responsible and diverse group of 340,000 team members in more than 50 countries. With its strong over 55-year heritage, Capgemini is trusted by its clients to unlock the value of technology to address the entire breadth of their business needs. It delivers end-to-end services and solutions leveraging strengths from strategy and design to engineering, all fueled by its market leading capabilities in AI, cloud and data, combined with its deep industry expertise and partner ecosystem. The Group reported 2023 global revenues of €22.5 billion.\n\n\nGet The Future You Want | www.capgemini.com\n\n\n#### **Disclaimer**\n\nCapgemini is an Equal Opportunity Employer encouraging diversity in the workplace. All qualified applicants will receive consideration for employment without regard to race, national origin, gender identity/expression, age, religion, disability, sexual orientation, genetics, veteran status, marital status or any other characteristic protected by law.\n\n\nThis is a general description of the Duties, Responsibilities and Qualifications required for this position. Physical, mental, sensory or environmental demands may be referenced in an attempt to communicate the manner in which this position traditionally is performed. Whenever necessary to provide individuals with disabilities an equal employment opportunity, Capgemini will consider reasonable accommodations that might involve varying job requirements and/or changing the way this job is performed, provided that such accommodations do not pose an undue hardship.\n\n\nCapgemini is committed to providing reasonable accommodations during our recruitment process. If you need assistance or accommodation, please reach out to your recruiting contact.\n\n\nClick the following link for more information on your rights as an Applicant http://www.capgemini.com/resources/equal-employment-opportunity-is-the-law\n\n\nPlease be aware that Capgemini may capture your image (video or screenshot) during the interview process and that image may be used for verification, including during the hiring and onboarding process.\n\n\nApplicants for employment in the US must have valid work authorization that does not now and/or will not in the future require sponsorship of a visa for employment authorization in the US by Capgemini."},{"_id":"6729073036ada7837e780eb3","title":"ReactJS Developer","company":"Capgemini","location":"Bridgewater, NJ, US","min_amount":89256,"max_amount":113019,"description":"Choosing Capgemini means choosing a company where you will be empowered to shape your career in the way you’d like, where you’ll be supported and inspired by a collaborative community of colleagues around the world, and where you’ll be able to reimagine what’s possible. Join us and help the world’s leading organizations unlock the value of technology and build a more sustainable, more inclusive world.\n\n\n**Location: Whippany, NJ**\n--------------------------\n\n**Job Description**\n-------------------\n\n**Role Purpose**\n\n* Developer in core Java team to deliver components to the overall Fusion platform\n* Development of bespoke solutions as well as integration of 3rd party software using predominantly core Java as well as libraries (Springboot).\n* Key Accountabilities\n* The role requires the candidate to take individual responsibility for the overall success of automated testing in the Fusion project\n* The successful candidate will work closely with on-shore development teams\n* Strong Proven experience in commercial Development of Web Facing applications using Java as the core language to perform highly concurrent functions.\n* Strong Proven experience of design and estimation in a commercial environment.\n* Strong Proven experience in commercial Development of User Interfaces.\n* Proven experience in incorporating automated testing into the Development project (e.g. Unit Testing/Test Complete).\n* Ability to document and design using Visio, UML and other modelling tools.\n* Enthusiastic and proactive team player who is keen to contribute to ideas and listen in a collaborative manner.\n\n**Technical Skills – Essential**\n\n* Experience of developing in the Agile methodology familiarity with SCRUM methodology\n* Applicable Java Web Framework (e.g. Spring, Spring-boot, Spring security)\n* Apache Tomcat\n* Creation and Integration to Web Services\n* Experience in Automated Build and Deployment Processes (e.g. Jenkins CI / Apache Maven / Gradle)\n* Experience or high level knowledge with tools like Junit, Sonar, Jenkins, SVN, Chef, Puppet, Nolio, Selenium, QTP, Assana, Jira or Rally (3 or more)\n* Exposure to responsive design and open source libraries, like bootstrap.\n* REST, Swagger\n* Understanding of Java Script, JQuery, AJAX, AngularJS 2.0, ReactJS\n* Experience in HTML,HTML5, CSS, NodeJS.\n* Java Script Unit cases.\n* Exposure to front-end tools like, NPM etc.\n* Strong experience in Object Oriented concepts\n* Have experience in applying SOLID principles\n* Should be good at identifying apt data structure to be used for given requirement.\n* Should be good at writing best code considering the time & space complexity.\n* Should have experience in both Unix and web development.\n* Should have understanding of XML and Web Services (SOAP, Rest)\n* Experience on any of the modern Java IDE JetBrains IDEA/NetBeans/IntelliJ etc or VS \\*\n\n**Technical Skill – Beneficial**\n\n* Ability to participate in design decision from Functional requirement perspective\n* Working knowledge of Jenkins\n* Understanding now SSO and authentication in general\n* Experience with Atlassian tools like Jira and Confluence\n* Understanding of Role Bases Access Control (RBAC)\n**Life at Capgemini:**\n----------------------\n\nCapgemini supports all aspects of your well-being throughout the changing stages of your life and career. For eligible employees, we offer:\n\n\n* Flexible work\n* Healthcare including dental, vision, mental health, and well-being programs\n* Financial well-being programs such as 401(k) and Employee Share Ownership Plan\n* Paid time off and paid holidays\n* Paid parental leave\n* Family building benefits like adoption assistance, surrogacy, and cryopreservation\n* Social well-being benefits like subsidized back-up child/elder care and tutoring\n* Mentoring, coaching and learning programs\n* Employee Resource Groups\n* Disaster Relief\n**Disclaimer:**\n---------------\n\nCapgemini is an Equal Opportunity Employer encouraging diversity in the workplace. All qualified applicants will receive consideration for employment without regard to race, national origin, gender identity/expression, age, religion, disability, sexual orientation, genetics, veteran status, marital status or any other characteristic protected by law.\n  \n\nThis is a general description of the Duties, Responsibilities and Qualifications required for this position. Physical, mental, sensory or environmental demands may be referenced in an attempt to communicate the manner in which this position traditionally is performed. Whenever necessary to provide individuals with disabilities an equal employment opportunity, Capgemini will consider reasonable accommodations that might involve varying job requirements and/or changing the way this job is performed, provided that such accommodations do not pose an undue hardship.\n  \n\nCapgemini is committed to providing reasonable accommodations during our recruitment process. If you need assistance or accommodation, please reach out to your recruiting contact.\n  \n\nClick the following link for more information on your rights as an Applicant http://www.capgemini.com/resources/equal-employment-opportunity-is-the-law  \n\n  \n\n\n\n**Skills (competencies)**\n-------------------------\n\nReact\nVerbal Communication\nCapgemini is a global business and technology transformation partner, helping organizations to accelerate their dual transition to a digital and sustainable world, while creating tangible impact for enterprises and society. It is a responsible and diverse group of 340,000 team members in more than 50 countries. With its strong over 55-year heritage, Capgemini is trusted by its clients to unlock the value of technology to address the entire breadth of their business needs. It delivers end-to-end services and solutions leveraging strengths from strategy and design to engineering, all fuelled by its market leading capabilities in AI, cloud and data, combined with its deep industry expertise and partner ecosystem. The Group reported 2023 global revenues of €22.5 billion."},{"_id":"6729073036ada7837e780eb4","title":"DevOps","company":"Capgemini","location":"Atlanta, GA, US","min_amount":95641,"max_amount":121103,"description":"Choosing Capgemini means choosing a company where you will be empowered to shape your career in the way you’d like, where you’ll be supported and inspired by a collaborative community of colleagues around the world, and where you’ll be able to reimagine what’s possible. Join us and help the world’s leading organizations unlock the value of technology and build a more sustainable, more inclusive world.\n\n\n**Job Location: Atlanta, GA**\n-----------------------------\n\n**Required Skills**\n-------------------\n\n* 8-10 years of experience.\n* Experience in planning a project managing budget assessing risk and taking decision accordingly developing detailed project plans ensuring resource availability and allocation and delivering every project on time within budget and scope.\n* Solid technical background with understanding or hands-on experience in DevOps technologies.\n* Experience in Linux environments shell scripting and python scripting.\n* Experience in Ansible Automato.\n* Experience in CI/CD tools such as Helm Git Jira Jenkins Tekton UrbanCode Deploy Harness etc.\n* Familiarity with container orchestration services like Docker Kubernetes OpenShift.\n* Experience in helping WebSphere/ TOMCAT/Apache based MW technologies.\n* Knowledge on foundation infrastructure services (Compute Storage Network and Database).\n* Assessing applications to identify risks vulnerabilities and security issues.\n* Identifying assessing and remediating reported VA issues by aligning with different teams.\n* Participation on architecture and software development activities.\n* Excellent oral and written communication skills.\n**Life at Capgemini**\n---------------------\n\nCapgemini supports all aspects of your well-being throughout the changing stages of your life and career. For eligible employees, we offer:\n\n\n* Flexible work\n* Healthcare including dental, vision, mental health, and well-being programs\n* Financial well-being programs such as 401(k) and Employee Share Ownership Plan\n* Paid time off and paid holidays\n* Paid parental leave\n* Family building benefits like adoption assistance, surrogacy, and cryopreservation\n* Social well-being benefits like subsidized back-up child/elder care and tutoring\n* Mentoring, coaching and learning programs\n* Employee Resource Groups\n* Disaster Relief\n**Disclaimer**\n--------------\n\nCapgemini is an Equal Opportunity Employer encouraging diversity in the workplace. All qualified applicants will receive consideration for employment without regard to race, national origin, gender identity/expression, age, religion, disability, sexual orientation, genetics, veteran status, marital status or any other characteristic protected by law.\n  \n\nThis is a general description of the Duties, Responsibilities and Qualifications required for this position. Physical, mental, sensory or environmental demands may be referenced in an attempt to communicate the manner in which this position traditionally is performed. Whenever necessary to provide individuals with disabilities an equal employment opportunity, Capgemini will consider reasonable accommodations that might involve varying job requirements and/or changing the way this job is performed, provided that such accommodations do not pose an undue hardship.\n  \n\nCapgemini is committed to providing reasonable accommodations during our recruitment process. If you need assistance or accommodation, please reach out to your recruiting contact.\n\n\nClick the following link for more information on your rights as an Applicant http://www.capgemini.com/resources/equal-employment-opportunity-is-the-law  \n\n  \n\n\n\nCapgemini is a global business and technology transformation partner, helping organizations to accelerate their dual transition to a digital and sustainable world, while creating tangible impact for enterprises and society. It is a responsible and diverse group of 340,000 team members in more than 50 countries. With its strong over 55-year heritage, Capgemini is trusted by its clients to unlock the value of technology to address the entire breadth of their business needs. It delivers end-to-end services and solutions leveraging strengths from strategy and design to engineering, all fuelled by its market leading capabilities in AI, cloud and data, combined with its deep industry expertise and partner ecosystem. The Group reported 2023 global revenues of €22.5 billion."},{"_id":"6729073036ada7837e780eb5","title":"Junior/Mid Software Developer/Engineer (TS/SCI Clearance)","company":"EpochGeo","location":"Washington, DC, US","min_amount":125000,"max_amount":175000,"description":"**Software Developer**\n\nEpochGeo is looking for a junior to mid-level Software Developer to support one of the most innovative, exciting, and growing offices that is rooted in geospatial analytics in the national security space.\n\nAre you a developer who wants to build skills in processing “Big” data, learn new tools, and work within a team of skilled developers? EpochGeo is looking for developers to help unlock the potential of raw geospatial data through novel algorithms and techniques.\n\nLocation-based big data can be overwhelming, inaccessible, and noisy. EpochGeo is a data services firm specializing in supporting the full spectrum data cycle: beginning with scalable data storage, building algorithms or workflows, and ending with impactful analytics. Our developers, analysts, and data scientists have a proven track record applying open-source innovative technology, data science, and actionable analytics to inform customers’ data driven decisions.\n\n**Your background likely includes:**\n\n* 1 - 5 years of software development (Python)\n* Education or military experience in Computer Science, Geography, or similar.\n* Experience with large volume data or automated analytics.\n* Experience with open-source software, to include PySpark and Trino.\n\n**What you will be doing:**\n\n* Collaborate with senior software developers to expand and improve tools for processing data using AWS\n* Build APIs to feed algorithms, and front-end UIs\n* Help manage large daily and streaming data flows\n* Create automated workflows or algorithms and machine learning models from big data to discover insights\n* Innovating within the data storage, scalable processing and automated analytics areas\n\n**Bonus:**\n\n* Experience using AWS/C2S\n* Experience with Hive, Spark, Trino or similar\n* Exposure to data science fundamentals\n\n**Additional:**\n\nMust hold a DoD TS clearance and be willing to submit for a CI Poly\n\n**Benefits Include:**\n\n* 100% health care premiums covered, FSA, HSA\n* 401k: 6% match, immediate vesting\n* 14 holidays: All 11 Federal holidays, day after Thanksgiving, 24 DEC, 31 DEC\n* PTO: 4 weeks annually\n* 3 week sabbatical every 3 years with the company\n\nJob Type: Full-time\n\nPay: $125,000.00 - $175,000.00 per year\n\nBenefits:\n\n* 401(k)\n* 401(k) matching\n* Dental insurance\n* Flexible schedule\n* Flexible spending account\n* Health insurance\n* Health savings account\n* Life insurance\n* Paid time off\n* Parental leave\n* Referral program\n* Tuition reimbursement\n* Vision insurance\n\nCompensation Package:\n\n* Bonus opportunities\n* Profit sharing\n* Yearly pay\n\nSchedule:\n\n* 8 hour shift\n* Monday to Friday\n\nExperience:\n\n* Python: 1 year (Required)\n\nSecurity clearance:\n\n* Top Secret (Required)\n\nAbility to Commute:\n\n* Washington, DC 20340 (Required)\n\nAbility to Relocate:\n\n* Washington, DC 20340: Relocate before starting work (Required)\n\nWork Location: In person"},{"_id":"6729073036ada7837e780eb6","title":"Full Stack Developer/ API /C#/ Back End","company":"Fiduciary Technology Partners","location":"Remote, US","min_amount":null,"max_amount":null,"description":"Job Overview:\n\nJoin our dynamic team at FidTech, a leading technology company in the FinTech for not for profit space specializing in innovative solutions for Foundations. We are currently seeking a talented Full Stack & API Developer to contribute to our cutting-edge projects and drive our technological advancements. This position offers a stimulating work environment with opportunities for professional growth and development.\n\nResponsibilities:\n\n- Develop .NET API Endpoints to service a finance based web application\n\n- Work with SQL and models to design robust and performant SQL queries.\n\n- Assist with debugging existing and emergent issues as part of the regular development process\n\nNeed:\n\n- Experience with .NET Core 3.0 or Higher\n\n- Experience integrating with third party APIs\n\n- Experience with writing SQL queries and secure, reusable stored-procedures\n\n- Experience with React, React-Redux, HTML & CSS\n\n- Experience with debugging code\n\n- Experience in a team-based software development environment\n\n- Experience using Git source control\n\n- Understanding of and skill in web development best practices (responsiveness, performance, etc.)\n\n- Security-minded design and development\n\nNice-to-have:\n\n- Understanding of/experience with build automation and CI/CD pipelines\n\n- Experience with Test Driven Development (TDD)\n\n- Experience with Atlassian tools like Jira, Confluence, and Bitbucket\n\n- Experience using Visual Studio, VS Code and SQL Server\n\n- Experience working in an Agile-Scrum environment\n\n- Exposure to Microsoft Azure\n\nJoin us at FidTech where you can showcase your skills, drive innovation, and be part of a team that values growth and excellence in technology. Apply now to be part of our exciting journey! Located in Stamford, CT. Candidates must be willing to work starting at 8.30 am EST.\n\nJob Type: Full-time\n\nPay: $100,000.00 per year\n\nBenefits:\n\n* 401(k) matching\n* Dental insurance\n* Health insurance\n* Paid time off\n\nCompensation Package:\n\n* Performance bonus\n\nSchedule:\n\n* Monday to Friday\n\nWork Location: Remote"},{"_id":"6729073036ada7837e780eb7","title":"Full Stack Developer","company":"Tectutor incorporation","location":"Hartford, OH, US","min_amount":70000,"max_amount":90000,"description":"**Job Title: Full Stack Developer**\n\n**Location:** United States  \n**Employment Type:** [Full-Time]\n\n**Job Summary:**  \nWe are seeking a skilled Full Stack Developer to join our dynamic team. The ideal candidate will be proficient in both front-end and back-end development, with a passion for building robust web applications and a strong understanding of the full development lifecycle.\n\n**Key Responsibilities:**\n\n* Design, develop, and maintain web applications using modern technologies.\n* Collaborate with UX/UI designers to create user-friendly interfaces.\n* Write clean, maintainable, and efficient code for both client-side and server-side applications.\n* Manage database design and development, including data modeling and optimization.\n* Implement API integrations and manage server-side logic.\n* Conduct code reviews and provide constructive feedback to team members.\n* Troubleshoot and debug applications to ensure optimal performance and user experience.\n* Stay updated with emerging technologies and industry trends, recommending tools and practices to enhance productivity.\n\n**Qualifications:**\n\n* Bachelor’s degree in Computer Science, Software Engineering, or a related field (or equivalent experience).\n* Proven experience as a Full Stack Developer or similar role.\n* Proficiency in front-end technologies (HTML, CSS, JavaScript, React, Angular, etc.).\n* Experience with back-end programming languages (Node.js, Python, Ruby, Java, etc.).\n* Strong understanding of databases (SQL, NoSQL, etc.) and data management.\n* Familiarity with version control systems (e.g., Git).\n* Knowledge of cloud services and deployment strategies (AWS, Azure, etc.) is a plus.\n* Excellent problem-solving skills and attention to detail.\n* Strong communication skills and ability to work collaboratively in a team environment.\n\n**What We Offer:**\n\n* Competitive salary and benefits package.\n* Opportunities for professional development and growth.\n* A collaborative and inclusive work environment.\n* Flexible working hours and remote work options.\n\nJob Type: Full-time\n\nPay: $70,000.00 - $90,000.00 per year\n\nBenefits:\n\n* 401(k)\n* Family leave\n* Flexible schedule\n* Food provided\n* Health insurance\n* Internet reimbursement\n* Life insurance\n* On-the-job training\n* Paid holidays\n* Paid sick time\n* Paid time off\n* Paid training\n* Parental leave\n* Relocation assistance\n* Visa sponsorship\n* Work from home\n\nCompensation Package:\n\n* Bonus opportunities\n* Hourly pay\n* Performance bonus\n* Yearly pay\n\nSchedule:\n\n* 8 hour shift\n* Choose your own hours\n* Day shift\n* Monday to Friday\n* Weekends as needed\n\nExperience:\n\n* REST: 1 year (Preferred)\n* Java: 1 year (Preferred)\n\nAbility to Commute:\n\n* Hartford, OH (Preferred)\n\nAbility to Relocate:\n\n* Hartford, OH: Relocate before starting work (Preferred)\n\nWork Location: In person"},{"_id":"6729073036ada7837e780eb8","title":"PLM Teamcenter Automation Engineer","company":"Talent Group","location":"Remote, US","min_amount":50,"max_amount":52,"description":"At least **5 years of hands-on experience in Product Lifecycle Management (PLM)** via the cloud-based **platform Teamcenter** and at least **3 years of hands-on experience test automation development.**\n\n**Responsibilities:**\n\n* Be the subject matter expert for business validations in the Product Lifecycle Management workstream, integrated with Master Data Management.\n* Partner with Capability Architects to build and own test strategy, test plan, test scenarios and test cases leading to QA validations and sign-off on assigned projects.\n* Experience in creating automated tests\n* Knowledge of test automation tools (e.g., Selenium, Appium)\n* Ability to write tests in programming languages (e.g., Python, Java)\n* Understanding of web technologies (HTML, CSS, JavaScript)\n* Work with third-party partners to perform end-to-end supply-chain integration testing.\n* Evaluate and execute applicable test cases.\n* Document all test results and ensure execution results up to date.\n* Keep stakeholders well-informed of testing progress and statuses.\n* Be able to articulate issues, problems, impacts, and support needs across different internal teams as well as external teams.\n* Innovate and suggest out-of-the-box solutions to improve productivity and processes.\n\nJob Type: Contract\n\nPay: $50.00 - $52.00 per hour\n\nBenefits:\n\n* Dental insurance\n* Health insurance\n* Vision insurance\n\nExperience:\n\n* Product Lifecycle Management (PLM) Teamcenter: 5 years (Required)\n* Test automation: 3 years (Required)\n* Selenium / Appium: 3 years (Required)\n* Python /Java: 3 years (Required)\n* HTML, CSS: 3 years (Required)\n\nWork Location: Remote"},{"_id":"6729073036ada7837e780eb9","title":"Senior Level PHP Developer","company":"American Partner Solutions","location":"Tampa, FL, US","min_amount":86590,"max_amount":109642,"description":"If you are a Sr. PHP Developer with experience, please read on! Located in Tampa, Fl. we are the software division of the Fest Corporation Family of Companies which include American Marketing and Mailing and American Visual Brands.\n\n\n**Top Reasons to Work with Us**\n\n\n\nYou get to work with other top talent Developers who value the same principles as you do. We encourage learning new techniques, sharing your knowledge with others and invest in the training to get you to the next level. We’re an equal opportunity employer providing a fun but respectful environment to work in. We strive to make your role both challenging and rewarding.\n\n\n**What You Will Be Doing**\n\n\n\nThe role is for a Senior Developer to help lead the Web Team into the next generation of web content delivery. We’re looking for someone with experience with multiple frameworks and languages who can quickly learn and understand our code base, help identify architecture and performance improvements, and can drive a transition plan to get there while continuing to improve our user experience.\n\n\n**What You Need for this Position**\n\n\n\nExperience: 5+ yrs PHP software development  \n\nWith the following languages/frameworks: PHP/ Symfony, Javascript  \n\n\n\n\n**What’s In It for You**\n\n\n\nFor your hard work we are offering a competitive salary benefits and vacation!  \n\nDress is Jeans casual with periodic employee team building activities.  \n\nSo, if you are a Sr. PHP Developer with experience, please apply today!\n\n\n\nApplicants must be local applicants authorized to work in the U.S."},{"_id":"6729073036ada7837e780eba","title":"Software Engineer II","company":"Healogics","location":"Jacksonville, FL, US","min_amount":95342,"max_amount":120724,"description":"The rewards at Healogics are immense, starting with the important work we do to change patients’ lives. We also understand that meaningful work is hard work, and we are committed to supporting and compensating our employees for the tremendous service they provide.\n\n  \n\nThink you are a great fit? Learn more about this role here:\n\n\nHealogics is the largest provider of advanced wound care services in the United States, treating more than 300,000 chronic wound patients annually across over 600 sites. With an aging society, obesity and diabetes on the rise, and an uptick in surgical procedures, the number of patients with non-healing wounds that would benefit from expert care is dramatically increasing. As a result, the company is working to provide our differentiated, quality outcomes to as many patients that would benefit through our out-patient clinic partnerships.  \n\n  \n\nThe Software Engineer II will play a key role in creating state-of -the-art technical software solutions to help advance Healogics in the marketplace. This individual will contribute to the complete software development cycle using Agile methodologies. S/he will work closely with a team of developers, QA, product analysts and product managers to ensure delivery of software development projects,\n  \n\n  \n\nThe individual in this role should have extensive knowledge of designing and implementing Enterprise level software solutions in leading best design practices. This person is expected to implement extensible and scalable cloud-based solutions as well as expertise in mobile application development.  \n\n  \n\nAll Healogics employees must perform their job responsibilities according to all Healogics policies, Hospital policies, as well as to accrediting organizations, federal and state regulation, and to the Centers for Medicare and Medicaid Services (CMS) guidelines, as applicable.**Essential Functions/Responsibilities:**\n\n* Design and write code that meets Healogics requirements for quality, performance, and usefulness within project timelines\n* Contribute as part of a cross-functional team, alongside Healogics Product and QA teams, to deliver high quality solutions and participate in key architectural design decisions\n* Work with team members to ensure projects have accurate estimates, meet provided timelines, and fulfil requirements\n* Partner with Product team to provide guidance on project requirements\n* Lead large scale projects with multiple team members\n* Troubleshoot problems and provide options for possible solutions\n* Assist with the packaging and deployment of application components, services, and processes\n* Participate in code reviews\n* Perform other duties as required\n\n**Required Education, Experience and Credentials:**\n\n* Degree in computer science, engineering or a related field is required\n* Minimum of five (5) years of software development experience\n* At least 5 (five) years of Java, HTML5/CSS, Javascript and/or Kony technology and/or native iOS and/or Android mobile or web application development\n* At least five (5) years’ experiences with both SQL and NOSQL databases.\n* Expertise with Data engineering & Data analytics tools & frameworks\n* Expertise with Big data technologies & frameworks\n* Expertise with Agile Development Lifecycle processes\n* Experience with cloud-based enterprise software application development\n* Demonstrated experience managing vendor relationships\n\n**Required Knowledge, Skills and Abilities:**\n\n* Effective written and verbal communication skills\n* Excellent interpersonal and presentation skills\n* Proven ability to complete projects and achieve results in an ambiguous work environment\n* Strong leadership skills within the project team and in the business community\n* Proven ability to establish and articulate a vision, set goals, develop and execute strategies, and track and measure results\n* Ability to explain complex technical designs in simple terms to non-technical savvy end users or management\n* Superior customer service, collaboration, and trust building-skills\n* Demonstrated ability to build and motivate a team to achieve well communicated expectations\n* Strong negotiating and consensus building abilities\n* Skills to work effectively across internal functional areas in ambiguous situations\n\n\nThis range is an estimate, based on potential employee qualifications: education, experience, geography as well as operational needs and other considerations permitted by law.\n\n\nIf you are a current employee, to submit a job application, you need to apply as an internal candidate in Workday via the “Jobs Hub”."},{"_id":"6729073036ada7837e780ebb","title":"Software engineer","company":"NaN","location":"Dallas, TX, US","min_amount":110682,"max_amount":140148,"description":"**Job Overview**\n\n\nBecome a key member of our forward-thinking team as a Software Engineer, where you will be responsible for designing, developing, and implementing software solutions that drive innovation. Utilize your technical expertise to deliver high-quality software that meets the needs of our diverse clientele.\n\n**Key Responsibilities for Software Engineers**\n-----------------------------------------------\n\n* Engage in R&D projects across various domains\n* Develop engineering prototypes and production-ready designs\n* Create embedded software using the C programming language\n* Produce documented, reliable software ensuring safe operation of microprocessor or GUI-based products\n* Design and develop electronic products and systems utilizing microprocessors and DSPs\n* Collaborate in hardware/software integration for multiple system components\n\n#### **Qualifications and Skills Required**\n\n* Bachelor's degree in Electrical Engineering, Computer Engineering, or Computer Science\n* Mid to senior-level experience in embedded software development\n* Proficient in C programming\n* Familiarity with software design, testing, and verification methodologies\n* Experience with microprocessor product lifecycle: concept, design, testing, verification, and documentation\n* Strong problem-solving abilities in software design- Experience with Ethernet and microprocessor/DSP-based products\n* Familiarity with real-time operating systems (RTOS)\n* Knowledge of Assembly (e.g., ARM9)\n* Experience in GUI development (Angular, JavaScript, HTML, CSS)\n* Proficient with version control tools like GIT\n* Hands-on experience with diagnostic tools (oscilloscopes, logic analyzers, spectrum analyzers, etc.)\n* Understanding of DO-178C and/or FAA specification requirements\n\n#### **Compensation and Benefits**\n\n* Competitive salary commensurate with experience and qualifications.\n* Comprehensive benefits package including health, dental, and vision insurance\n* Generous paid time off and professional development opportunities.\n* 401(k) plan with company match.\n\n##### **Work Environment and Tools**\n\n* Collaborate in a dynamic and innovative work environment with a focus on cutting-edge technology.\n* Utilize state-of-the-art tools and resources to enhance productivity and innovation.\n* Engage in continuous learning and upskilling with access to training and professional resources.\n\n###### **Application Process**\n\n\nElevate your career in software engineering by joining a company that values creativity, teamwork, and cutting-edge solutions. Apply today to become a vital part of our engineering team, committed to pushing the boundaries of technology. We are an equal opportunity employer dedicated to fostering a diverse and inclusive workplace."},{"_id":"6729073036ada7837e780ebc","title":"Senior Fullstack (Nest/ Angular)","company":"OnHires","location":"San Francisco, CA, US","min_amount":117756,"max_amount":149106,"description":"**About Company**\n\n  \n\nThe company is at the forefront of innovation in real estate media business management, offering cutting-edge booking, scheduling, and business management software. With our customer base doubling annually, our software's simplicity, flexibility, and robustness stand out in the market. We’re on a mission to streamline the operational complexities of real estate media businesses, making their work more productive and enjoyable.\n\n\nWe're searching for a skilled NestJS(Angular) developer to join our growing team and play a key role in building the next generation of our platform. This is an exciting opportunity to work on a greenfield project utilizing the latest technologies and methodologies.  \n\n  \n\n**Key Responsibilities:**\n\n\n* Execute a migration of the existing functionality to the new platform, ensuring a smooth transition and minimal disruption to user experience. This involves careful planning and thorough testing to align with our technology stack's latest advancements.\n* Develop and implement new features utilizing a modern tech stack that includes NestJS, Angular and Google Cloud with a focus on clean code practices.\n* Collaborate closely with our international development team (primarily Ukrainian).\n\n\n- Troubleshoot bugs and provide sustainable solutions, maintaining high code quality and performance.- Continuously learn and explore new technologies to stay ahead of the curve.\n\n**Requirements:**\n\n* 6+ years of experience as a developer with strong proficiency in Nest JS.\n* Strong English language skills, with the ability to communicate effectively in a multicultural team environment.\n* Proficient in both front-end and back-end development, showcasing versatility and a comprehensive understanding of web applications (experience with Angular/Firebase/Firestore is a plus).\n* Prior experience in a startup environment is advantageous, demonstrating adaptability and enthusiasm for rapid growth and change."},{"_id":"6729073036ada7837e780ebd","title":"Computational Physics Software Engineer","company":"PassiveLogic","location":"Holladay, UT, US","min_amount":98301,"max_amount":124471,"description":"**Computational Physics Software Engineer**\n\n\nAre you interested in the intersection of Differentiable Programming, Software Engineering, and Computer Science? Are you interested in developing innovative solutions to enable the next generation of Autonomous Systems?\n\n\n**What you will be doing:**\n\n\nAs the Computational Physics Software Engineer, you will play a meaningful role in our Digital Twins team developing differentiable physics-based equipment inferencer environment within an AI-driven control engine.\n\n**Responsibilities:**\n\n* Develop infrastructure for a differentiable multi-physics simulation engine\n* Develop an interface with the object model through Object Relational Mapping\n* Provide an infrastructure to support PassiveLogic’s control path predictor and front-end simulation environments\n* Develop robust autonomous software that must run with no human supervision for decades.\n* Use thoughtful architecture design, documentation, unit testing, integration testing, profiling, and collaboration with the Formal Methods team to ensure this robustness\n* Collaborate with the Digital Twins team for physics optimization\n* Collaborate with the Compiler team for accelerator approaches\n\n **About PassiveLogic**\n\n\nPassiveLogic is disrupting the world of automation with the first generalized platform for autonomy. Our first application for autonomy is buildings — the largest and most complex controlled infrastructure in the economy. Our culture is built on bringing together the most talented engineers, thinkers, and creatives — backed by the world’s leading investors — working collaboratively together to build the future we envision.\n\n\nPassiveLogic’s infinitely configurable platform enables users to design their custom autonomous systems. We've reinvented the fundamental principles of automation to replace legacy control logic with real-time control decisions at the edge, reducing the world’s carbon footprint, while paving the way for the future of smart cities. We are looking for team members who have a passion for technology and want to work on real-world solutions to some of the toughest problems.\n\n**You must have:**\n\n* + Strong self-motivation towards PassiveLogic’s mission to “empower people through generative autonomy to solve the world's largest climate challenges.”\n\t+ Strong proficiency in systems programming languages such as Swift, Rust, C++, or Java, as well as appreciable software engineering skills in working with large codebases with non-trivial architecture, beyond just coding small (1000’s of lines) programs and scripts\n\t+ Experience with software design, design patterns, and software architecture\n\t+ Excellent problem-solving skills, with a strong analytical mindset and attention to detail\n\t+ Extraordinary teammate with excellent interpersonal skills\n\n**You should have:**\n\n* + Experience with concurrency, threads, processes, Lib-dispatch/GCD\n\t+ Experience with GPU programming, high-performance computing, and scientific computing\n\t+ Experience in vector, SIMD, and tensor computational methods\n\t+ Strong math, numerical methods, and analysis skills\n\n**It’s helpful to have:**\n\n* + BS, MS, or PhD in Software Engineering, Computer Science, Applied Mathematics, Physics or other Engineering degrees\n\t+ Experience with Swift programming language\n\t+ Experience with auto-differentiation\n\t+ Experience with systems modeling and algorithm development\n\t+ Fundamentals of building energy and/or electromechanical systems\n\t+ Experience with autonomous systems\n\t+ Experience working in a startup\n\n**Compensation, Perks, & Benefits for the Computational Physics Software Engineer:**\n\n* Competitive compensation\n* Equity share\n* Medical, Dental, Vision, 401K, FSA, HSA, Disability, and Term Life Insurance\n* Flex PTO\n* Well-stocked break room snacks and catered lunch Monday through Friday\n* Free ski passes (We are at the base of Big Cottonwood Canyon)\n* Free National Park passes\n* We push our performance personally as well as professionally, and we do respect flexible hours around well-earned powder days\n\n\n**To apply for this position:**\n\n\n* A cover letter telling us why you're the perfect candidate for PassiveLogic\n* A resume\n\n\nWe are looking for practitioners who are passionate about understanding people, committed to lifelong learning, and driven by the love of what they do. We know there are candidates who might not fit everything we’ve described above, or who might have experience and skills we haven’t considered. If that’s you, please apply.\n\n\n**Diversity and Inclusion**\n\n\nDiversity, inclusion, and belonging are woven into our values and everything we do. We welcome all — come as you are and bring your whole self. We are proud to be an Equal Opportunity Employer. We celebrate diversity every day by maintaining a safe and inclusive environment for our employees at every stage of their careers.\n\n***Legal Notice***\n\n*Unsolicited resumes sent to PassiveLogic, including unsolicited resumes sent to PassiveLogic business mailing address, email address, or directly to PassiveLogic employees, will be considered PassiveLogic property. PassiveLogic will not pay a fee for any placement resulting from the receipt of an unsolicited resume.*"},{"_id":"6729073036ada7837e780ebe","title":"Backend Engineer - GAR","company":"American Express","location":"Sunrise, FL, US","min_amount":85000,"max_amount":150000,"description":"**You Lead the Way. We’ve Got Your Back.**\n\n\n\nWith the right backing, people and businesses have the power to progress in incredible ways. When you join Team Amex, you become part of a global and diverse community of colleagues with an unwavering commitment to back our customers, communities and each other. Here, you’ll learn and grow as we help you create a career journey that’s unique and meaningful to you with benefits, programs, and flexibility that support you personally and professionally.\n\n\n\nAt American Express, you’ll be recognized for your contributions, leadership, and impact—every colleague has the opportunity to share in the company’s success. Together, we’ll win as a team, striving to uphold our company values and powerful backing promise to provide the world’s best customer experience every day. And we’ll do it with the utmost integrity, and in an environment where everyone is seen, heard and feels like they belong.\n\n\n\nJoin Team Amex and let's lead the way together.\n\n\n\nAs part of our diverse tech team, you can architect, code and ship software that makes us an essential part of our customers’ digital lives. Here, you can work alongside talented engineers in an open, supportive, inclusive environment where your voice is valued, and you make your own decisions on what tech to use to solve challenging problems. American Express offers a range of opportunities to work with the latest technologies and encourages you to back the broader engineering community through open source. And because we understand the importance of keeping your skills fresh and relevant, we give you dedicated time to invest in your professional development. Find your place in technology of #TeamAmex.\n\n\n\nWe are building the GAR Communications platform using an event driven micro services architecture. Looking to build a brand-new team to contribute to development that augments a globally distributed team of engineers. This role is for a java engineer located in Sunrise, Florida. This is a dream opportunity for any engineer wanting to be working on cutting edge technology and has enough challenging work to learn, contribute and impress. Our team works in an environment that promotes openness, experimentation, and debates. Winning arguments are always based on logic and never on seniority or title. Come join us to learn, contribute and teach.\n\n\n**Responsibilities include, but not limited to:**\n\n\n* Work closely with a team of engineers to design, build, test and deploy.\n* Actively participate in the various engineering forums to learn from others as well as educate others.\n* Stays informed on the latest trends in the industry and at American Express and adopt them as needed . Familiar with Agile development methodologies.\n* Experience with design and coding across one or more object-oriented platforms and languages.\n\n\n* Java – building reactive micro services is preferable.\n* Experience in Java 8/11/17/21 programming and SpringBoot is needed.\n* Desirable to have cloud experience, especially Docker, Kubernetes and Microservice architecture.\n* Experience with the Reactive framework such as Spring Webflux or Vert.x.\n* Experience in ReactJS, Javascript and UI/UX preferred\n* Desirable to have experience with performance and monitoring tools e.g. Splunk, App Dynamics, Dynatrace.\n* Knowledge of automated build / continuous delivery, experience of Maven and Jenkins.\n* Hands-on experience with application design, software development and relational and noSQL databases.\n* Communicates effectively with Technical, Operational, and Business colleagues.\n* Must be proactive, enthusiastic, flexible, and results driven.\n\n\nSalary Range: $85,000.00 to $150,000.00 annually + bonus + benefits\n\n\n\nThe above represents the expected salary range for this job requisition. Ultimately, in determining your pay, we’ll consider your location, experience, and other job-related factors.\n\n\n\nWe back our colleagues and their loved ones with benefits and programs that support their holistic well-being. That means we prioritize their physical, financial, and mental health through each stage of life. Benefits include:\n\n\n* Competitive base salaries\n* Bonus incentives\n* 6% Company Match on retirement savings plan\n* Free financial coaching and financial well-being support\n* Comprehensive medical, dental, vision, life insurance, and disability benefits\n* Flexible working model with hybrid, onsite or virtual arrangements depending on role and business need\n* 20+ weeks paid parental leave for all parents, regardless of gender, offered for pregnancy, adoption or surrogacy\n* Free access to global on-site wellness centers staffed with nurses and doctors (depending on location)\n* Free and confidential counseling support through our Healthy Minds program\n* Career development and training opportunities\n\n\nFor a full list of Team Amex benefits, visit our Colleague Benefits Site.\n\n\n\nAmerican Express is an equal opportunity employer and makes employment decisions without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran status, disability status, age, or any other status protected by law.\n\n\n\nWe back our colleagues with the support they need to thrive, professionally and personally. That's why we have Amex Flex, our enterprise working model that provides greater flexibility to colleagues while ensuring we preserve the important aspects of our unique in-person culture. Depending on role and business needs, colleagues will either work onsite, in a hybrid model (combination of in-office and virtual days) or fully virtually.\n\n\n\nUS Job Seekers/Employees - Click here to view the “Know Your Rights” poster and the Pay Transparency Policy Statement.\n\n\n\nIf the links do not work, please copy and paste the following URLs in a new browser window: https://www.dol.gov/agencies/ofccp/posters to access the three posters.\n\n\n\nDepending on factors such as business unit requirements, the nature of the position, cost and applicable laws, American Express may provide visa sponsorship for certain positions."}]