[{"_id":"6709d79b6ec29b27dacd940e","job_title":"C++ Developer","company":"Realign","job_location":"Portland, OR, US","job_description":"##### **Job Type: Contract**\n\n\n##### **Job Category: IT**\n\n\n#### **Job Description**\n\n\nJob Title: C++ Developer\n\n\nJob Summary:\n\n\nWe are seeking a talented C++ Developer to join our team in creating and maintaining software applications that are essential to our business operations. The ideal candidate will have a strong background in C++ programming and a passion for developing high-quality, efficient code.\n\n\nResponsibilities and Duties:\n\n* Design, develop, and maintain C++ applications for various platforms\n* Implement software solutions that meet the needs of our clients\n* Collaborate with other team members to ensure smooth integration of code\n* Debug and troubleshoot issues as they arise\n* Stay up-to-date on emerging technologies and best practices in C++ development\n\n\nQualifications and Skills:\n\n* Bachelor's degree in Computer Science or related field\n* Proven experience in C++ development\n* Strong problem-solving skills\n* Ability to work independently and as part of a team\n* Excellent communication and collaboration skills\n\n\n#CPlusPlusDeveloper #SoftwareDevelopment #Programming #TechJobs #ComputerScience #USJobs #SoftwareEngineering #Coding #Technology #ProgrammingJobs #ComputerProgramming #DeveloperJobs #ITJobs #JobPosting #CareerOpportunities\n\n\n##### **Required Skills**\n\n\nCloud Developer"},{"_id":"6709d79b6ec29b27dacd940f","job_title":"Lead Software Engineer","company":"Wells Fargo","job_location":"Charlotte, NC, US","job_description":"**About this role:**  \n\n  \n\nWells Fargo is seeking a Lead Software Engineer to join the Risk Technology Team within Enterprise Functions Technology (EFT). This role will be involved with an Enterprise-wide cloud migration and will partner with peer organizations to define design patterns that support model development, training, and production use in alignment with regulatory requirements, internal policies and guidelines and industry best practices. They will partner with the Model Governance team to ensure appropriate model lifecycle compliance and model approval prior to use. This role will be working with cross functional teams to develop innovative, mission-critical, massively scalable solutions with best-in-class technology and platforms that offer differentiated user experience to all our customers.  \n\n  \n\n**In this role, you will:*** Lead complex technology initiatives including those that are companywide with broad impact\n* Act as a key participant in developing standards and companywide best practices for engineering complex and large scale technology solutions for technology engineering disciplines\n* Design, code, test, debug, and document for projects and programs\n* Review and analyze complex, large-scale technology solutions for tactical and strategic business objectives, enterprise technological environment, and technical challenges that require in-depth evaluation of multiple factors, including intangibles or unprecedented technical factors\n* Make decisions in developing standard and companywide best practices for engineering and technology solutions requiring understanding of industry best practices and new technologies, influencing and leading technology team to meet deliverables and drive new initiatives\n* Collaborate and consult with key technical experts, senior technology team, and external industry groups to resolve complex technical issues and achieve goals\n* Lead projects, teams, or serve as a peer mentor\n\n**Required Qualifications:*** 5+ years of Software Engineering experience, or equivalent demonstrated through one or a combination of the following: work experience, training, military experience, education\n* 5+ years of Python experience\n* 1+ years of experience in building Microservices Applications\n\n**Desired Qualifications:*** Strong Experience on Spark, Django, Unix\n* GCP Professional Certificate\n* Hands on knowledge of LLMs\n* Hands on experience on distributed compute on GPUs and CPUs\n\n**Job Expectations:*** This position is not eligible for Visa sponsorship.\n* This position offers a hybrid work schedule.\n* Relocation assistance is not available for this position\n\n**Pay Range**  \n\n  \n\nReflected is the base pay range offered for this position. Pay may vary depending on factors including but not limited to achievements, skills, experience, or work location. The range listed is just one component of the compensation package offered to candidates.  \n\n$111,100.00 - $237,100.00  \n\n**Benefits**  \n\n  \n\nWells Fargo provides eligible employees with a comprehensive set of benefits, many of which are listed below. Visit Benefits - Wells Fargo Jobs for an overview of the following benefit plans and programs offered to employees.* Health benefits\n* 401(k) Plan\n* Paid time off\n* Disability benefits\n* Life insurance, critical illness insurance, and accident insurance\n* Parental leave\n* Critical caregiving leave\n* Discounts and savings\n* Commuter benefits\n* Tuition reimbursement\n* Scholarships for dependent children\n* Adoption reimbursement\n\n**Posting End Date:**  \n\n13 Oct 2024  \n\n* **Job posting may come down early due to volume of applicants.**\n\n  \n\n**We Value Diversity**  \n\n  \n\nAt Wells Fargo, we believe in diversity, equity and inclusion in the workplace; accordingly, we welcome applications for employment from all qualified candidates, regardless of race, color, gender, national origin, religion, age, sexual orientation, gender identity, gender expression, genetic information, individuals with disabilities, pregnancy, marital status, status as a protected veteran or any other status protected by applicable law.  \n\n  \n\nEmployees support our focus on building strong customer relationships balanced with a strong risk mitigating and compliance-driven culture which firmly establishes those disciplines as critical to the success of our customers and company. They are accountable for execution of all applicable risk programs (Credit, Market, Financial Crimes, Operational, Regulatory Compliance), which includes effectively following and adhering to applicable Wells Fargo policies and procedures, appropriately fulfilling risk and compliance obligations, timely and effective escalation and remediation of issues, and making sound risk decisions. There is emphasis on proactive monitoring, governance, risk identification and escalation, as well as making sound risk decisions commensurate with the business unit's risk appetite and all risk and compliance program requirements.  \n\n  \n\nCandidates applying to job openings posted in US: All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, status as a protected veteran, or any other legally protected characteristic.  \n\n  \n\n**Applicants with Disabilities**  \n\n  \n\nTo request a medical accommodation during the application or interview process, visit Disability Inclusion at Wells Fargo .  \n\n  \n\n**Drug and Alcohol Policy**  \n\n  \n\nWells Fargo maintains a drug free workplace. Please see our Drug and Alcohol Policy to learn more.  \n\n  \n\n**Wells Fargo Recruitment and Hiring Requirements:**  \n\n  \n\na. Third-Party recordings are prohibited unless authorized by Wells Fargo.  \n\n  \n\nb. Wells Fargo requires you to directly represent your own experiences during the recruiting and hiring process."},{"_id":"6709d79b6ec29b27dacd9410","job_title":"Senior Technical Producer","company":"instrument","job_location":"US","job_description":"Instrument is a remote-first digital product and brand experience agency with over 200 talented people across four teams, each focused on a core offering and dedicated to producing best-in-class work. Our shift to a fully remote model has amplified our ability to foster creativity, build strong relationships, and engage with clients in dynamic ways. This flexibility has not only strengthened our company culture but also enabled us to embrace diverse perspectives. We remain deeply committed to career advancement, personal support, and ensuring a healthy work-life balance for everyone we hire.\n\n\nYou can lead a complex technical project and find paths forward that enable teams to create great experiences. You know and utilize best practices in producing (including account, project, and product management), yet you don’t follow a formula or merely execute. You’re able to drive every phase of the project lifecycle, partnering with clients, strategists, writers, designers, and developers—embracing and supporting all individuals. You speak all their languages while tirelessly advocating for the most successful project outcome: meeting business goals alongside user needs. From concept to execution you’re always influencing and implementing what is needed to move the project forward.\n\n**What You'll Do**\n------------------\n\n* Lead large, challenging, multi-disciplinary projects from start to finish, leveraging Agile methodologies and CI/CD processes to drive efficient workflows, continuous integration, and seamless delivery\n* Create and actively manage all development aspects of a project plans, focusing on all technical aspects to ensure milestones and objectives are met on time and within scope.\n* Provide value and support throughout the entire project cycle by driving production strategies that influence the development process, team dynamics, and client relationships with a focus on impactful technical outcomes.\n* Have an expert understanding of and curiosity about development processes and best in class digital execution\n* Balance innovation and practicality in your production approaches and evaluation of technical feasibility of the work being made.\n* Maintain development velocity throughout the project lifecycle, proactively surfacing risks to delivery to minimize down-time, ensuring people are involved at the appropriate times for project success.\n* Collaborate with Tech Leads to write, clarify, refine, assign, and estimate tickets.\n* Lead \"design breakdown\" sessions with project developers to ensure a clear understanding of tasks.\n* Lead sprint rituals and estimation meetings to drive efficiency in project execution.\n* Embody our proactive work approaches. You know when to take the initiative, work independently or collaboratively, think big or small to be 10 steps ahead\n* Communicate ideas well in all written and verbal interactions in order to build strong relationships and inform the right actions are taken\n* Find a way through every scenario with positivity and a sense a calm as both a good team member and client partner\n**What You'll Bring**\n---------------------\n\n* 5-8 years experience as Producer on complex projects, leading the production of technical teams, managing projects and/or products.\n* Experience directly managing enterprise-level clients as well as large, multidisciplinary internal project teams with respect\n* Ability to “translate” between development team/clients/work, keeping everyone’s interests and needs integrated as part of a project’s successful completion\n* Expertise with software development processes and terminology.\n* Experience in software development processes, Agile methodologies, CI/CD pipelines, and related terminology, facilitating smoother collaboration and delivery.\n**Pay Range**\n-------------\n\n* The expected pay range for this position is $85,000-$110,000 for our base US Region 3\\*. We have three regional pay ranges that are adjusted for cost of living (US1 +15%, US2 +7.5%, US3 Base), \\*learn more about our pay philosophy and cost of living adjustments."},{"_id":"6709d79b6ec29b27dacd9411","job_title":"Principal Software Engineering Manager","company":"Microsoft","job_location":"Redmond, WA, US","job_description":"Security represents the most critical priorities for our customers in a world awash in digital threats, regulatory scrutiny, and estate complexity. Microsoft Security aspires to make the world a safer place for all. We want to reshape security and empower every user, customer, and developer with a security cloud that protects them with end to end, simplified solutions. The Microsoft Security organization accelerates Microsoft’s mission and bold ambitions to ensure that our company and industry is securing digital technology platforms, devices, and clouds in our customers’ heterogeneous environments, as well as ensuring the security of our own internal estate. Our culture is centered on embracing a growth mindset, a theme of inspiring excellence, and encouraging teams and leaders to bring their best each day. In doing so, we create life-changing innovations that impact billions of lives around the world.  \n\nThe mission for the Identity for Services (ID4S) team, part of Microsoft Entra is to make it hard to get authentication and authorization wrong. We believe the tasks to get authentication and authorization right, actively preventing security incidents, and always being updated for a service should be straightforward and at the same time provide operational insights part of the platform. As a team we take meaningful steps daily to achieve our mission supporting developers, (security) operations and administrators. Our solution is used across thousands of internal Microsoft Services, and several of our components making up the solution are available as open source in GitHub. Our goal is to bring all our learnings from running services across Microsoft to everyone through GitHub, Entra, Azure, and beyond. There are still many challenges for us to solve to deliver on our mission and to help us we are looking for a **Principal Software Engineering Manager** who knows how to build and nurture a high performing team. The role requires experience building seamlessly integrated components which are running in high scale services where elements such as security, resilience, memory, and performance are motivation to get up every day. You work effectively across a large set of organizations and teams across the company operating with a customer first mindset. As a team we work on ensuring our solution utilizes as few resources as possible and we enjoy scrutinizing allocations, we also ensure our API’s are no touch (configuration only) and extensible, and we collect telemetry allowing us and service owner with key insights to effectively operate the service.  \n\n  \n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.**Responsibilities**\n--------------------\n\n* Plan and influence technical designs on projects that will have potential long-term impact to Microsoft\n* Help create security best practices and implement secure software solutions.\n* Build and nurture a high performing team.\n* Develop and maintain authentication and authorization components for various platforms, including .NET, Rust, Java, Golang, Python, Node.JS.\n* Collaborate with cross-functional teams such as leadership teams, product managers, service owners and platform teams.\n* Make data-driven decisions (quantitative and qualitative).\n* Support service owners ensuring seamless integration.\n* Participate in code reviews, design discussions, and contribute to the overall improvement of the solution.\n\n**Qualifications**\n------------------\n\n**Required Qualifications**:* Bachelor's Degree in Computer Science, or related technical discipline AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\n\t+ OR equivalent experience.\n* 4+ years people management experience of a software team\n* 4+ years experience building SDK’s.\n\n**Other Requirements:**  \n\nAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings:* Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.\n\n**Additional or Preferred Qualifications:*** Bachelor's Degree in Computer Science or related technical field AND 10+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\n\t+ OR Master's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\n\t+ OR equivalent experience.\n  \n\n* Proficient understanding of authentication and authorization protocols, including OAuth, OpenID Connect, and SAML.\n* Active Contributor to Open Source Projects\n* Familiarity with continuous integration and continuous deployment (CI/CD) pipelines.\n* Experience with cloud platforms, particularly Azure.\n\nSoftware Engineering M5 - The typical base pay range for this role across the U.S. is USD $137,600 - $267,000 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $180,400 - $294,000 per year.  \n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay  \n\nMicrosoft will accept applications for the role until October 25th, 2024.  \n\n#MSFTSecurity #SHPE24MSFT  \n\n\nMicrosoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations."},{"_id":"6709d79b6ec29b27dacd9412","job_title":"Senior Software Engineer","company":"Microsoft","job_location":"Redmond, WA, US","job_description":"In **Mixed Reality**, people - not devices - are at the center of everything we do. We're incorporating groundbreaking technologies, from the revolutionary Holographic Processing Unit to computer vision, machine learning, human-computer interaction, and more. We're a growing team of talented engineers, program managers and artists bringing greater training and situational awareness to the most extreme customers. Our team has people from a wide variety of backgrounds, identities, previous work histories, life experiences, and we are eager to maintain and grow that diversity. Our varied backgrounds and unique experiences enable us to be better at building the best solutions for our customers and make for dynamic and joyful collaborations with colleagues!  \n\nThe **Mixed Reality Core OS Software team** has an immediate opening for a highly motivated ***Senior Software Engineer*** with a deep understanding of Android/Linux OS Kernel, HAL, and System Service layers. This individual will require solid software development skills to build performant and reliable drivers and services for our devices. We are the team that develops the foundational software that breathes life into our Mixed Reality hardware, enabling our AI, Runtimes, and Experience teams to collectively create delightful and engaging user experiences.  \n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.  \n\nIn alignment with our Microsoft values, we are committed to cultivating an inclusive work environment for all employees to positively impact our culture every day.**Responsibilities**\n--------------------\n\n* Gather and analyze system requirements, document specifications, and develop software solutions to meet device requirements\n* Develop efficient and robust system software for highly dependable systems\n* Conduct post-implementation validation of software and address any defects identified during testing.\n* Collaborating with multi-disciplinary teams to identify and resolve system problems\n* Integrating, testing, and debugging third-party solutions and collaboration with Independent Hardware Vendors (IHVs)\n* Embody our Culture and Values\n\n**Qualifications**\n------------------\n\n**Required Qualifications*** Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\n+ OR equivalent experience\n\n* 4 + years' experience in C/C++ design and coding skills.\n* 2+ Years Experience in implementing low level software for Linux or Android. (System Services, Android Runtime, Hardware Abstraction Layer, etc.)\n\n **Other Requirements**  \n\nAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings:* **Microsoft Cloud Background Check**: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.\n* Citizenship & Citizenship Verification: This role will require access to information that is controlled for export under export control regulations, potentially under the U.S. International Traffic in Arms Regulations or Export Administration Regulations, the EU Dual Use Regulation, and/or other export control regulations. As a condition of employment, the successful candidate will be required to provide proof of citizenship, U.S. permanent residency, or other protected status (e.g., under 8 U.S.C. § 1324b(a)(3)) for assessment of eligibility to access the export-controlled information. To meet this legal requirement, and as a condition of employment, the successful candidate’s citizenship will be verified with a valid passport. Lawful permanent residents, refugees, and asylees may verify status using other documents, where applicable.\n\n **Additional or Preferred Qualifications*** Bachelor's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\n+ OR Master's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\n+ OR equivalent experience.\n\n* Experience working with cross discipline engineering teams to balance and coordinate product decisions.\n* Familiarity with tools to optimize power and performance\n* Familiarity with pre-boot environments such as UEFI (Unified Extensible Firmware Interface)\n* Familiarity with implementing firmware for embedded devices and low-level protocols (i.e. I2C, UART, SPI, USB, PCIE etc.)\n* Bring a passion for growth and innovation, adapt to new challenges with creativity and continuous improvement.\n\n  \n\nSoftware Engineering IC4 - The typical base pay range for this role across the U.S. is USD $117,200 - $229,200 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $153,600 - $250,200 per year.  \n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay  \n\nMicrosoft will accept applications for the role until October 25, 2024.  \n\n\nMicrosoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations."},{"_id":"6709d79b6ec29b27dacd9413","job_title":"Senior Software Quality Engineer- Windows + Devices, Applied Sciences Group","company":"Microsoft","job_location":"Redmond, WA, US","job_description":"**Senior Software Quality Engineer- Windows + Devices, Applied Sciences Group**  \n\nIn **Windows + Devices** we're seeking a passionate **Senior Software Quality Engineer** to join **Microsoft Applied Sciences Group**. You will play a crucial role in ensuring the highest quality of deliverables for our next-generation (Artificial Intelligence) AI devices, built on a custom (Android Open Source Project) AOSP-based OS and AI-first hardware.  \n\nThis position offers a unique opportunity to explore and implement novel testing techniques at the intersection of hardware, software, and AI cloud services in both incubation and production. You will be responsible for writing tests and ensuring the highest quality of individual components, including low-level drivers and services, AI application, as well as the entire vertical system integration.  \n\nAdditionally, you will be responsible for automating testing processes for Continuous Integration (CI) and assist in writing specifications and documentations for internal and external partner teams.  \n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.**Responsibilities**\n--------------------\n\n* **QA Leadership:**\n\t+ Ensure the highest quality of code and deliverables across system and application engineering teams\n\t+ Review architecture, designs, and code to maintain the highest technical standards\n\t+ Ensure the integration of diagnostic mechanisms within end-user applications, like telemetry\n* **Testing and Automation:**\n\t+ Design, develop, and execute tests for hardware subsystems, services, and AI applications\n\t+ Test and validate the entire vertical system integration to ensure seamless operation across all components, from low-level hardware to user-facing UI\n\t+ Automate testing processes and integrate them into continuous integration (CI) pipelines\n\t+ Ensure proper integration of automated QA tools, such as static analyzers and automated security assessment tools\n* **Documentation:**\n\t+ Document APIs and technical components for sharing between internal and external partner teams\n* **Factory Testing:**\n\t+ Ensure alignment and port existing tests for use on the factory floor\n\t+ Develop and refine testing methodologies through interactions with factory engineers\n* **Collaboration and Mentorship:**\n\t+ Work closely with a multidisciplinary team of AI researchers, developers, and engineers to ensure the quality of deliverables across teams.\n\t+ Mentor and guide team members, helping them overcome challenges and promoting best practices related to testing and security .\n\n**Qualifications**\n------------------\n\n **Required/Minimum Qualifications*** Bachelor's Degree in Engineering, Computer Science, or related field AND 6+ years software industry experience with coding in languages including but not limited to: C++, Java\n\n\no OR Master's Degree in Engineering, Computer Science, or related field AND 4+ years software industry experience with coding in languages including but not limited to: C++, Java\no OR equivalent experience or capabilities.* Demonstrated experience with all of the following: Testing frameworks (such as, gtest, catch2), Continuous integration tools (such as, Azure DevOps Pipelines, GitHub Actions), Automation framework, Data collection methods and interaction simulation techniques.\n* Demonstrated experience with embedded hardware testing and low-level service functionality validation.\n\n**Other Requirements**  \n\nCandidates must be able to meet Microsoft, customer and/or government security screening requirements that are required for this role. These requirements include, but are not limited to the following specialized security screenings:* **Microsoft Cloud Background Check:** This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.\n\n**Additional/ Preferred Qualifications*** Bachelor's Degree in Engineering, Computer Science, or related field AND 8+ years software industry experience with coding in languages including but not limited to: C++, Java\n\n\no OR Master's Degree in Engineering, Computer Science, or related field AND 6+ years software industry experience with coding in languages including but not limited to: C++, Java\no OR equivalent experience or capabilities.* Demonstrated experience in software development and testing, especially on the AOSP (Andriod Open Source project)\n* Programming skills in at least one language such as C++, Java (or others)\n* Understanding of data collection methods and interaction simulation techniques, with a drive to improve them\n* Demonstrated ability to effectively communicate what work you have done, why it was important, and how it was different from other projects.\n* Demonstrated creativity in coming up with ideas and solutions to problems, as well as turning around and building them\n* Experience working on cross-functional and/or cross-team projects.\n* specific experience with creating or/and testing embedded systems or AI applications .\n* Demonstrated record of contributions to open source projects, especially in the testing area\n\n\nSoftware Quality Engineering IC4 - The typical base pay range for this role across the U.S. is USD $117,200 - $229,200 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $153,600 - $250,200 per year.\n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay\n\nMicrosoft will accept applications for the role until October 26, 2024  \n\n\nMicrosoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations."},{"_id":"6709d79b6ec29b27dacd9414","job_title":"Sr Software Engineer","company":"HERTZ","job_location":"Seattle, WA, US","job_description":"**A Day in the Life:**\n\nCome join us in our effort to digitally transform Hertz! Recent innovations such as smartphones, electric vehicles, and ride-hailing apps have created new and exciting opportunities in transportation that Hertz is uniquely positioned to capitalize on. We’re looking for software engineers who will modernize Hertz’s tech stack and, in the process, ship delightful products to meet the ever-increasing demands of our customers.\n\n\n**What you will do:**\n\n* Design, implement and maintain based applications that can be high-volume and low-latency\n* Contribute to all stages of software development lifecycle\n* Analyze user requirements to define business objectives\n* Envisioning system features and functionality\n* Develop and test software\n* Identify and resolve any technical issues arising\n* Create detailed design documentation\n* Propose changes to current infrastructure\n* Develop technical designs for application development\n* Write well designed, testable code\n* Conducting software analysis, programming, testing, and debugging\n* Support continuous improvement, investigating alternatives and technologies, and presenting for architectural review\n\n**What We're Looking For:**\n\n* 4-7 years of experience in the technology industry, and a B.S. in Computer Science or equivalent\n* Proficiency in one or more programming languages and common data structures / algorithms\n* Ability to design systems of large complexity\n* Ability to act at tech lead for projects end-to-end\n* Strong communication skills. You must be able to work with cross-functional partners to gather requirements and explain outcomes\n* Strong product sense. You must be able to align your work with business objectives and make appropriate tradeoffs\n* Learning mentality. You must be able to pick up new skills as needed and demonstrate a curiosity about new technologies\n\nWe expect the starting salary to be around $150,000 to $180,000 with annual bonus and profit sharing eligibility. The actual salary will be determined based on years of relevant work experience\n\n\n**What You’ll Get:**\n\n* Up to 40% off the base rate of any standard Hertz Rental\n* Paid Time Off\n* Medical, Dental & Vision plan options\n* Retirement programs, including 401(k) employer matching\n* Paid Parental Leave & Adoption Assistance\n* Employee Assistance Program for employees & family\n* Educational Reimbursement & Discounts\n* Voluntary Insurance Programs - Pet, Legal/Identity Theft, Critical Illness\n* Perks & Discounts –Theme Park Tickets, Gym Discounts & more\n\n  \n\n  \n\n  \nThe Hertz Corporation operates the Hertz, Dollar Car Rental, Thrifty Car Rental brands in approximately 9,700 corporate and franchisee locations throughout North America, Europe, The Caribbean, Latin America, Africa, the Middle East, Asia, Australia and New Zealand. The Hertz Corporation is one of the largest worldwide airport general use vehicle rental companies, and the Hertz brand is one of the most recognized in the world.\n**US EEO STATEMENT**At Hertz, we champion and celebrate a culture of diversity and inclusion. We take affirmative steps to promote employment and advancement opportunities. The endless variety of perspectives, experiences, skills and talents that our employees invest in their work every day represent a significant part of our culture – and our success and reputation as a company.\nIndividuals are encouraged to apply for positions because of the characteristics that make them unique.\nEOE, including disability/veteran"},{"_id":"6709d79b6ec29b27dacd9415","job_title":"Principal Cloud Engineer","company":"HERTZ","job_location":"Estero, FL, US","job_description":"**A Day in the Life:**\n\nPrincipal Cloud Platform engineer role is responsible to create strategic Cloud Platforms with empowered teams and adaptive mindsets. You will implement leading cloud native and multi-cloud platforms implementing Infrastructure-as-Code, Kubernetes, and Zero Trust architecture. You’ll apply Site Reliability Engineering to create resilient and scalable platforms. You’ll support client delivery teams across Hertz Cloud environments. You’ll keep pace with leading Cloud, DevSecOps, Containerization, Kubernetes and Cloud Engineering skills as you further specialize.\n\n\n**What You'll Do:**\n\n* You will lead and take part in the entire cycle of Cloud Platform engineering and development from architecture, hands-on implementation, documentation and support\n* You will design and engineer Government cloud platforms using Infrastructure-as-Code, GitOps, and containerization with backing support for microservice and serverless solutions\n* You will create cloud platforms that simplify and speed lean, agile, DevSecOps practices to improve software delivery speed, security and stability\n* Utilize the latest technology thinking and products from our Deloitte Tech Trends industry insights\n* Developing, documenting and executing cloud automation and Integration solutions to establish CI/CD, DevSecOps processes in order to assist in simplifying deployments and to assist customer adoption.\n* Create, configure and manage kubernetes clusters at scale. Implement best practices and configure and manage service mesh\n* Establish an IaC framework using terraform for AWS. Deploy and manage infrastructure in AWS. Automate manual tasks using python, ansible etc.,\n* Adopt development standards that closely align the Solutions Architecture team with our Engineering team.\n* Architect and migrate applications from datacenters to AWS Cloud.\n* Support, partner, and collaborate with the Hertz Security team.\n* Resource Optimization and Utilization\n\n**What We're Looking For:**\n\n* Bachelor’s degree in Computer Science, Software Engineering, and or equivalent work experience.\n* 10+ year of Experience with cloud technologies such as AWS, Azure, and GCP\n* Ability to communicate and collaborate effectively with multiple business departments.\n* Experience designing cloud architectures with automation tools such as Ansible, Terraform, and CloudFormation\n* Working Experience on designing and implementing full stack/Microservice infrastructure using IaC best practices\n* Understanding of secure software development methodologies and Code First mindset\n* Experience\n* Strong programming skills in Java, Python, Scripting, CloudFormation, Terraform, python, and or similar configuration languages (Ansible, Chef, etc.)\n* Experience in software development, systems engineering, or integration and test experience with mission systems on tactical platforms\n* Strong Working knowledge of the CI/CD process including debugging, test, and integration of software tools.\n* Strong communication skills and a self-starter that can thrive in a distributed remote work environment\n* Exposure to building CI/CD ecosystem.\n* Experience in docker multistage builds, working with architecting microservice applications.\n* Experience in spinnaker and harness CD tools\n* Experience with Infrastructure as Code and tools including Terraform, Ansible, and AWS CloudFormation\n* Experience in creating, deploying and managing kubernetes clusters at scale. Knowledge in implementing standards and best practices.\n* Implement DevSecOps framework using tools like twistlock, CheckMarx, SonarQube and Jfrog Xray.\n* Experience with AWS Cloud Service Provider Architecture deployment use cases and best practices.\n* Familiar with container technologies including Docker and Kubernetes,\n* Competent with scripting languages including Bash\n* Proficient in a modern Object-Oriented Language and willing to port skills to another language like Go and Python\n* Familiar with the continuous integration and continuous deployment mindset\n* Work as a cross-functional team member to support multiple work steams and products.\n\n**What You’ll Get:**\n\n* 40% off any standard Hertz Rental\n* Paid Time Off\n* Medical, Dental & Vision plan options\n* Retirement programs, including 401(k) employer matching\n* Paid Parental Leave & Adoption Assistance\n* Employee Assistance Program for employees & family\n* Educational Reimbursement & Discounts\n* Voluntary Insurance Programs - Pet, Legal/Identity Theft, Critical Illness\n* Perks & Discounts –Theme Park Tickets, Gym Discounts & more\n\n  \n\n  \n\n  \nThe Hertz Corporation operates the Hertz, Dollar Car Rental, Thrifty Car Rental brands in approximately 9,700 corporate and franchisee locations throughout North America, Europe, The Caribbean, Latin America, Africa, the Middle East, Asia, Australia and New Zealand. The Hertz Corporation is one of the largest worldwide airport general use vehicle rental companies, and the Hertz brand is one of the most recognized in the world.\n**US EEO STATEMENT**At Hertz, we champion and celebrate a culture of diversity and inclusion. We take affirmative steps to promote employment and advancement opportunities. The endless variety of perspectives, experiences, skills and talents that our employees invest in their work every day represent a significant part of our culture – and our success and reputation as a company.\nIndividuals are encouraged to apply for positions because of the characteristics that make them unique.\nEOE, including disability/veteran"},{"_id":"6709d79b6ec29b27dacd9416","job_title":"Sr. Automation Engineer","company":"TDK Headway Technologies, Inc.","job_location":"Milpitas, CA, US","job_description":"**TITLE: SR. AUTOMATION ENGINEER**\n\n**FLSA STATUS: EXEMPT**\n\n**REPORTS TO: MANAGER AUTOMATION ENGINEERING**\n\n**SUMMARY:**\n\n\nUnder the direction of the Manager of Automation Engineering, the Sr. Automation Engineer is responsible for developing models for the Fault Detection and Classification (FDC) and Process Control Systems (PCS) applications for semiconductor equipment using third party software; collecting, analyzing, and validating various types of data; collaborating with MIS, equipment and software vendors for initial network communication development, integration, and maintenance; and monitoring and optimizing FDC system performance. This position is located in Milpitas, California.\n\n**ESSENTIAL FUNCTIONS:**\n\n* Develops and delivers advanced FDC models and PCS applications for semiconductor equipment using third party software\n* Collects, analyzes, validates, and creates reports using various types of data sources; presents findings to other engineers and production teams\n* Collaborates with MIS regarding the purchases of equipment and software; meets with vendors and assists with the implementation and validation of new systems\n* Administers and maintains ARTIST system, including Oracle DB, ARTIST application servers, and outstanding upload/parse systems\n* Monitors and maintains the FDC system; recommends processes or procedures for optimizing the system and improving functionality\n* Uses advanced statistical modeling, data analysis, simulations, and algorithms to resolve complex automation issues\n* Partners with equipment, manufacturing, process, and QA engineering groups to develop models for equipment performance and wafer yield improvement\n* Develops and delivers reporting schemes and process solutions to ensure rapid response time for resolving equipment issues\n* Responds to inquiries from other engineering groups regarding automation-related issues and product or device requirements\n* Adheres to all safety policies and procedures as required\n* Performs other duties of a similar nature or level\\*\n\n**M****INIMUM QUALIFICATIONS**\n\n* Bachelors degree in Computer Science, Computer Engineering, Electrical Engineering, orMechanical Engineering; Masters degree preferred\n* Five years of experience software or hardware modeling, simulation or algorithms\n* Experience with Java, C/C++, Visual Basic, or C#. Web-related GUI programming languages and shell scripting, MATLAB, Linux, Windows OS, Oracle/SQL databases, and SEMI standards\n* Knowledge of GEM/SECS interfaces, logic design, semiconductor fabrication processes, time series data analysis, and statistical quality control\n* Proficient in the use of Microsoft Office applications\n\n**K****n****o****wledge, Skills, and Abilities:**\n\n* Knowledge of semiconductor industry principles, practices, and techniques\n* Knowledge of FDC systems and PCS applications as they relate to manufacturing equipment systems\n* Knowledge and ability to use Java, C/C++, Visual Basic, web-related GUI programming languages and shell scripting, MATLAB, Linux, Windows OS, and Oracle/SQL databases\n* Knowledge and ability to use Microsoft Office applications to create spreadsheets, Word documents, and PowerPoint presentations\n* Able to analyze data, create various reports, and recommend corrective action\n* Able to communicate effectively, both verbally and in writing, with all levels of contractors, consultants, employees, and management\n* Able to work independently, productively and collaboratively with all levels of employees and management\n* Able to comply with all safety policies and procedures\n* Demonstrated critical thinking skills\n* Demonstrated ability to develop reports, models, and simulations\n* Demonstrated organizational and time management skills\n* Demonstrated problem-solving and trouble shooting skills\n* Flexible and able to prioritize\n\n\nThe annual base salary for this full-time position is between $111,276.00-$163,641.00 + bonus target + benefits. Within the range the individual pay may differ depending on additional factors including job responsibilities, job related knowledge, skills, abilities, education, and experience. The annual base pay range shown is subject to change and may be modified periodically.\n\n**W****O****RKING CONDITIONS:**\n\n\nThe Sr. Automation Engineer works primarily in an office environment Monday to Friday. The schedule may be altered from time-to-time to meet business or operational needs; may travel from building-to-building as needed. May occasionally work in a class 100 ESD sensitive wafer manufacturing facility; wears a cleanroom (bunny) suit, including hood, gloves, safety glasses, booties, and mask. Stands and walks; performs various fine grasping movements, bends, and twists; operates a computer and enters information using a keyboard, operates a telephone, and other office equipment. May occasionally push, pull, or lift up to 10 pounds.\n\n* Other duties of a similar nature or level are duties that may be required, but may not be specifically listed in the job description or posting.\n\n\nTDK/Headway Technologies, Inc. provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, gender, national origin, age, disability, or genetics. Applicants requiring accommodation in order to complete the application process should contact the Headway Human Resources Department."},{"_id":"6709d79b6ec29b27dacd9417","job_title":"Senior .NET Developer (749179) 10/ 16/2024","company":"GS1 Consulting","job_location":"Indianapolis, IN, US","job_description":"Local candidates only. The Indiana Department of Health (IDOH) is seeking a senior .NET Developer for Long Term Acute Care program area.\n\nCandidates presented must be eligible for full time hire, without requiring sponsorship.\n\nDeveloper is responsible to maintain a number of stabilized .NET applications developed in VB.net, C# with Oracle, and SQL server as databases. Software developer position is to analyze software requirements, designing, developing, testing, and implementing the new Quality Assurance Management Information System (QAMIS) or make enhancements to existing application according to specifications from program team.\n\nEssential Duties / Responsibilities:\n\n* Use object-oriented techniques and best practices for design, development, unit testing and deployment.\n* Use Microsoft .NET Framework and a supported MVC framework, C# programming language to development of the applications.\n* Analyzing, designing, developing, testing, and implementing software programs and application enhancements.\n* Document all deliverables and perform system unit testing and validation of procedures.\n* Work with program area team on technical issues including system design and testing.\n* Analyzing information to recommend and plan the development and implementation of new systems or modifications of an existing system.\n* Work with Program team members on detailed business requirements, understanding business processes and technology, agency standards, and ensuring project goal alignment.\n* Write technical specifications based on conceptual design and stated business requirements.\n* Work with project manager to ensure project plan is maintained and project milestones are being met.\n* Have ability to work independently and under general supervision with latitude for independent judgment.\n* Responsible to modify existing applications from time to time due to changes in technology, security, state or federal law changes and national standards.\n\nJob Types: Full-time, Contract\n\nPay: $58.86 per hour\n\nCompensation Package:\n\n* 1099 contract\n\nSchedule:\n\n* 8 hour shift\n* Day shift\n\nApplication Question(s):\n\n* Work experience in analysis and addressing security related issues for applications built in multiple languages / 5 Years Required.\n* Expert understanding of SDLC / Required.\n* Strong verbal and written communication skills / Required.\n* Ability to solve complex programming issues / Required.\n* Bachelor’s Degree in Computer Science or related fields with IT experience / Required.\n* Experience in Healthcare Industry / Highly Desired.\n* Selected candidate will be required to work onsite 3 days per week. Please confirm you understand this requirement.\n* The manager has indicated this position is a possible contract to hire opportunity for eligible candidates only.\n\nExperience:\n\n* ASP.NET: 10 years (Required)\n* C#, MVC: 5 years (Required)\n* Web Services: 5 years (Required)\n\nLicense/Certification:\n\n* Current local candidates to Indianapolis Only (Required)\n\nWork Location: Hybrid remote in Indianapolis, IN 46204"},{"_id":"6709d79b6ec29b27dacd9418","job_title":"RPG Developer","company":"Sonaca North America","job_location":"MO, US","job_description":"Sonaca North America is driven by a passion for innovation and a commitment to excellence. As a leading provider of aerospace and defense solutions, we are dedicated to making air and space travel safe and sustainable. We have 12 locations across North America and our engineering expertise and operational excellence set us apart from the competition.  \n\nSince the beginning in 1948, we have a proven track record of delivering high-quality products and services that are reliable, safe, and efficient. Our team of experts is dedicated to staying ahead of the curve in the aerospace and defense industry, utilizing the latest technologies and processes to ensure that we deliver the best possible solutions to our customers.  \n\nPOSITION SUMMARY\nWe are currently seeking a Senior Applications Developer, whom under general direction, is responsible for working from requirements defined by users and/or Business Analysts. Use standard procedures and techniques to maintain or modify existing application programs, or to develop new applications programs of varying complexity and scope. The Senior Application Developer will always model LMI values and principles and act in a manner consistent with the LMI Code of Business Conducts and Ethics.\nEssential Job Responsibilities* Works with internal users to define requirements,\n* Develops system and programming designs and specifications, and\n* Uses standard procedures and techniques to maintain, modify, devise new or existing application programs of varying complexity and scope.\n* Assist other Analysts as required in evaluating requirements and recommend enhancements/changes to the architecture when applicable\n* Identifies all aspects of the assigned problem and evaluates user requirements in terms of the capabilities of the available software.\n* Develops the documentation, which outlines the logical steps to be followed in solving the problem and prepares system specifications including input and output formats and flowcharts.\n* Writes, debugs, tests, documents and maintains programs.\n* perform other duties including iSeries system administration.\n* Coordinates with other programmers, IT management, users, and software suppliers.\n* Attends and participates in departmental meetings.\n* Participates in special projects or performs other tasks as identified by management.\n* Establishes and meets responsible deadlines and personal work plans.\n\n\nEducation and Experience* Bachelor’s degree in Information Technology, Computer Science, Business, or related field or a minimum of 8 years of related work experience.\n* Familiarity with analysis and programming RPG.\n* Proven knowledge of RPG III, RPG IV, ILE, CL, subfiles, display files and OS/400\n* Familiarity working with FTP, sFTP EDI data interfaces\n* Writing complex SQL procedures/functions\n* Familiarity with Rocket/Aldon or similar Change Management software\n* Ability to work in a dynamic environment with multiple priorities and shifting time requirements. Must be able to promote a participative, team-oriented environment, working with customers (both internal and external), all employees, vendors and others in a professional respectful manner.\n* Excellent communication skills and be able to communicate clearly and professionally, both orally and in writing.\n* Ability to effectively present information and respond to questions from groups of managers, customers, employees, and vendors.\n* Ability to define problems, collect data, establish facts and draw valid conclusions.\n* Ability to compile and present data in a format that facilitates information sharing and decision making.\n\n  \n\nTravel  \n\n10% travel time.\nWhy Choose LMI Aerospace?\nWe take care of our people.* 401(k) retirement savings plan with a percentage company-match contribution\n* Competitive wages\n* Paid holidays\n* Paid time off\n* Medical, dental, vision, life, and accidental insurance\n* Short-term disability\n* Long-term disability\n* Employee assistance plan — for access to counseling, consulting and other community resources\n* Wellness program\n* Tuition assistance\n\n\nThis job description is only a summary of the typical functions of the job, not an exhaustive or comprehensive list of all possible job responsibilities, tasks, and duties. The responsibilities, tasks, and duties may differ from those outlined in the job description and other duties, as assigned, may be required. This document does not create an employment contract. Employees of the Company are employed on an “at will” basis and may be terminated at any time.\nSonaca North America is an equal employment opportunity employer. Consistent with applicable law, Sonaca North America provides access and opportunities to those with disabilities. This includes providing reasonable accommodation to individuals with disabilities and disabled veterans who seek to access the company’s online application system. If an applicant is unable to fully access the online application system, Sonaca North America will provide a reasonable accommodation. Applicants with disabilities may contact us at 636-916-2400 for assistance accessing the on-line application system. Callers should have a detailed description of the requested accommodation, their name and preferred method of contact ready for Sonaca North America‘s Human Resources Department. Sonaca North America will make every effort to respond within two (2) business days. This phone number is not for the general submission of application materials.\nSonaca North America is an E-Verify Employer.\nSonaca North America is an Equal Employment Opportunity/Affirmative Action/Disability/Veterans Employer\nNOTICE ON FRAUDULENT JOB OFFERS\nIt has been brought to our attention that there have been instances of fraudulent job offers, purporting to be from Sonaca North America and/or its affiliates (“LMI Aerospace”).  \n\nThis type of fraud is normally carried out through online services such as false websites, or through fake e-mails or call from people claiming to be from the company. These persons offer fraudulent employment opportunities to applicants and often ask for sensitive personal and financial information. The fraudsters may also request recipients to provide personal information and/or to make payments as part of their fake recruiting process.\nSonaca North America does not ask for any financial commitments from candidates as a pre-employment requirement and will always require candidates to formally apply for positions via the Careers Page or job postings.\nSonaca North America has no responsibility for fraudulent offers and if you believe you have been a victim of a fraudulent job offer concerning Sonaca North America, please email info@sonaca-na.com."},{"_id":"6709d79b6ec29b27dacd9419","job_title":"Life ray Developer / Lead","company":"Inabia Software & Consulting Inc.","job_location":"Remote, US","job_description":"**Role:** Life ray Developer / Lead\n  \n**Location :** Boston, CA (Remote)\n  \n**Rate:** $45-55/hr on C2C\n  \n**Client:** HCL\n  \n  \n\n**Note:** Please share the profiles which are not submitted for HCL in Last 3 Months\n  \n  \n\n**Mandatory Skill:** Life ray DXP\n  \n  \n\n**Job Description:**  \n\nBelow are the high-level expectations in addition to Liferay solutioning.\n  \nBuild a strategy for the move to Entra ID and how and if Saviynt will work with LiferayBuild a strategy for the migration to the cloud and all the integration pointsStrategy for on-prem vs.cloud solution\n  \n  \n\n(1.) To be responsible for providing technical guidance to a team of developers, enhancing their technical capabilities and increasing productivity.\n  \n(2.) To conduct comprehensive code reviews, establish and oversee quality assurance processes, performance optimization , implementation of best practices and coding standards to ensure succeful delivery of complex projects.\n  \n(3.) To ensure process compliance in the assigned module, and participate in technical discussionsorreview as a technical consultant for feasibility study (technical alternatives, best packages, supporting architecture best practices, technical risks, breakdown into components, estimations.\n  \n(4.) To collaborate with stakeholders to define project scope, objectives, deliverables and accordingly prepare and submit status reports for minimizing exposure and closure of escalations.\n  \n7lnFDmpb7h"},{"_id":"6709d79b6ec29b27dacd941a","job_title":"Senior Delphi developer","company":"Inabia Software & Consulting Inc.","job_location":"Overland Park, KS, US","job_description":"Title: Senior Delphi developer  \n\nLocation: Overland Park, KS (Remote)  \n\nDuration: 05+ months  \n\n  \n\nJob Description:  \n\n* Works with business and technical staff to develop application modules/features that meets business needs.\n* Builds applications compliant with application frameworks and standards and assists in maintaining them.\n* Identify application modules , interfaces and their interdependencies.\n* Assist the development team in platform verification.\n* Review regression test results.\n* Support for System , Integration and UAT testing.\n* Familiar with Software development life cycle, knowledge of agile framework, and has worked on project implementing agile methods.\n* Troubleshoots issues that arise and escalates as appropriate.\n\n\n  \n\nBasic Qualifications: (what are the skills required to this job with minimum years of experience on each)  \n\n* Excellent working knowledge of Delphi development and upgrade – 5 to 7 years\n* Understanding of ASP .NET technology – 1 to 3 years.\n* Effective communication skills to convey complex and technical information both orally and in writing.\n* Ability to work independently and effective coordination with teams.\n\n\n  \n\nMust have:  \n\n* Delphi upgrade experience on mobile applications.\n\n\n  \n\nEducation and Experience:  \n\n* Bachelor’s degree in computer science or related IT field\n* 5 to 7 years of experience in IT development\n* Bachelor’s in computer science or equivalent work experience\n\n\n\n\n\n077hbpGy7Y"},{"_id":"6709d79b6ec29b27dacd941b","job_title":"Lead Backend Engineer","company":"Corelight","job_location":"San Francisco, CA, US","job_description":"By making evidence the heart of security, we help customers stay ahead of ever-changing cyber-attacks.\n\n\n\nCorelight is the cybersecurity company that transforms network and cloud activity into evidence. Evidence that elite defenders use to proactively hunt for threats, accelerate response to cyber incidents, gain complete network visibility and create powerful analytics using machine-learning and behavioral analysis tools. Easily deployed, and available in traditional and SaaS-based formats, Corelight is the fastest-growing Network Detection and Response (NDR) platform in the industry. And we are the only NDR platform that leverages the power of Open Source projects in addition to our own technology to deliver Intrusion Detection (IDS), Network Security Monitoring (NSM), and Smart PCAP solutions. We sell to some of the most sensitive, mission critical large enterprises and government agencies in the world.\n\n\n\nAs a Lead Backend Engineer, you will play a crucial role in leading the development and architecture of the backend systems that power our products and services. You will be responsible for overseeing a team of backend engineers, guiding their work, and collaborating with cross-functional teams to deliver high-quality, scalable, and reliable software solutions. Your deep understanding of SaaS and cloud technologies, combined with your leadership skills, will be vital in shaping the future of Corelight's Open NDR SaaS Platform.\n\n\n\nResponsibilities\n\n\n* Lead the technical design discussions within the team and collaborate with other teams across the organization.\n* Design, develop and operate scalable, elastic and secure microservices based on serverless architectures.\n* Build REST APIs / GraphQL services to interface with large datasets and analytics using AWS technologies and services like AWS Lambda, API Gateway, DynamoDB, S3, and Cloudwatch.\n* Work in an Agile development team to design and deliver service features end-to-end from design to production deployment and monitoring.\n* Evangelize and drive adoption of software development best practices in code health, quality, test stability and maintainability.\n* Work closely with offshore teams on various development projects.\n\n\nMinimum Qualifications\n\n\n* Strong appreciation and support for our core values: low ego results, tireless service, and applied curiosity.\n* 7+ years of professional software development experience.\n* Experience building REST APIs / GraphQL to support a rich data-heavy visual user interface.\n* Experience using AWS Services (Lambda, AppSync, API Gateway) or equivalent.\n* Experience with Python, Java and/or Go.\n* Knowledge of Relational and NoSQL databases.\n* Experience using Docker, Kubernetes, and containerized microservices\n* Experience adopting & using Agile development methodologies\n* Excellent communication skills. You thrive by collaborating with multiple teams and use your communication skills to influence product directions.\n* Bachelor's degree in Computer Science or related fields, or equivalent experience\n\n\nPreferred Qualifications\n\n\n* Knowledge of Network-based Security Detections and Attack techniques desirable.\n* Experience with Search and Analytics tools like Splunk, Elasticsearch etc.\n* Experience with frontend technologies such as React is desirable.\n* Experience working in a distributed team.\n\n\nWe are proud of our culture and values - driving diversity of background and thought, low-ego results, applied curiosity and tireless service to our customers and community. Corelight is committed to a geographically dispersed yet connected employee base with employees working from home and office locations around the world. Fueled by an accelerating revenue stream, and investments from top-tier venture capital organizations such as Crowdstrike, Accel and Insight - we are rapidly expanding our team.\n\n\n\nCheck us out at www.corelight.com\n\n\nNotice of Pay Transparency:  \n\nThe compensation for this position may vary depending on factors such as your location, skills and experience. Depending on the nature and seniority of the role, a percentage of compensation may come in the form of a commission-based or discretionary bonus. Equity and additional benefits will also be awarded.\n\n\nCompensation Range\n$185,000—$220,000 USD"},{"_id":"6709d79b6ec29b27dacd941c","job_title":"Software Engineer II","company":"Flexcar","job_location":"Boston, MA, US","job_description":"**Job Title: Software Engineer II**  \n\n**Location: Onsite - Boston, MA**  \n\n**Employment Type: Full Time, Exempt**  \n\n**Compensation: $135,000 + Full Benefit Package and Bonus Opportunity**  \n\n  \n\n**About Us:**\n\n\nAt Flexcar, we provide customers with the flexibility of having a car of their own without the hassles of traditional car ownership. Convenient and affordable, Flexcar is here to disrupt a multi-billion-dollar industry by providing customers with a better alternative to leasing and ownership. We’re rapidly growing and looking for top software talent.\n\n\nAs a Software Engineer II, you'll have the opportunity to work on both customer-facing applications and internal tools. You can expect to own and solve complex problems dealing with all aspects of our world class ECommerce and Billing platforms as well as our customer, fleet and order management tools.\n\n**What you’ll do:**\n\n* Design, implement, and deploy services/APIs that drive key business objectives.\n* Collaborate with product designers, managers, and other engineers to develop innovative solutions.\n* Simplify complex technical and product challenges into maintainable software.\n* Share and adopt best practices while continuously raising the bar for excellence.\n* Be a leader and advocate for our customers in all that you do.\n\n**What we’re looking for:**\n\n* 3-5 years of production experience with Ruby on Rails (experience in a fast-paced environment is a plus).\n* Proficiency with SQL/NoSQL databases and RESTful APIs.\n* Experience with JavaScript, TypeScript, or Java is a plus.\n* Familiarity with DevOps, CI/CD, testing, and agile methodologies.\n* BS in Computer Science or equivalent.\n\n**Our Tech Stack:**\n\n* Backend: Ruby, JVM languages (Java, Groovy, Kotlin, Scala)\n* Databases: PostgreSQL, MongoDB, Redis, Oracle, Kafka\n* Infrastructure: Kubernetes/Docker, AWS (S3, RDS, EKS, ECR, etc.)\n\n**Why you’ll love working here:**\n\n* Join a diverse and passionate team in a flexible and innovative work environment.\n* Contribute to the success of the world's leading car-sharing network.\n* Your ideas and input will always be valued—we encourage creativity and the use of new tools.\n\n**What tops off the tank:**\n\n\nRest & Relax! Unlimited paid time off (we encourage a minimum of 10 days annually) plus twelve corporate company holidays\n\n\nSave for Your Future! 401(k) with company match from day one of hire\n\n\nExpand The Family! Up to twelve weeks of paid family leave\n\n\nDrive a Flexcar! Discounted employee rate on Flexcar products\n\n **Who Are We:**\n\nWe are fiercely disrupting the concept of automobile ownership Flexcar is on a mission to replace car ownership for the majority of car owners. Currently operational in 4 markets and continuing to grow, our goal is to offer a flexible alternative to car ownership that puts our members in the driver seat of their budget and their vehicle. Flexcar covers all maintenance costs, insurance costs, registration costs, and more, to provide an ownership alternative that is simple and seamless for our members. Flexcar empowers all walks of life the flexibility to have a car of their own without the hassles of traditional car ownership. Convenient and affordable, Flexcar is here to disrupt a 90 billion dollar industry by providing customers an alternative to car-sharing, leases, ownership, and car rentals.\n\n\n**The Extra Mile:**\n\nFlexcar is rapidly growing and we want you to be a Flexster. Our special team is passionate, kind, collaborative, driven, and all-in on building the next automotive game-changer from the ground-up. This truly is an amazing opportunity to not only contribute your talents as a team-member, but also to help build the future Flexcar.\n\n\nFlexcar is an Equal Opportunity Employer and prohibits discrimination and harassment of any kind. Flexcar provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state, or local laws.\n\n\nAMafKLrbcy"},{"_id":"6709d79b6ec29b27dacd941d","job_title":"Software Engineer, Level 1","company":"Independent Software","job_location":"Annapolis Junction, MD, US","job_description":"**What you will be doing!**\n\n\nAs a Software Engineer, Level 1 you will be responsible developing, maintaining, and enhancing complex and diverse software systems (e.g., processing-intensive analytics, novel algorithm development, manipulation of extremely large data sets, real-time systems, and business management information systems) based upon documented requirements. Works individually or as part of a team. Reviews and tests software components for adherence to the design requirements and documents test results. Resolves software problem reports. Utilizes software development and software design methodologies appropriate to the development environment. Provides specific input to the software components of system design to include hardware/software tradeoffs, software reuse, use of Commercial Off-the-shelf (COTS)/Government Off-the-shelf (GOTS) in place of new development, and requirements analysis and synthesis from system level to individual software components.\n\n**Job Requirements:**\n\n* Analyze user requirements to derive software design and performance requirements.\n* Debug existing software and correct defects\n* Provide recommendations for improving documentation and software development process standards\n* Design and code new software or modify existing software to add new features\n* Integrate existing software into new or modified systems or operating environments\n* Develop simple data queries for existing or proposed databases or data repositories\n* Write or review software and system documentation\n* Serve as team lead at the level appropriate to the software development process being used on any project\n* Design or implement complex database or data repository interfaces/queries\n* Develop or implement algorithms to meet or exceed system performance and functional standards\n* Assist with developing and executing test procedures for software components\n* Develop software solutions by analyzing system performance standards, confer with users or system engineers; analyze systems flow, data usage and work processes; and investigate problem areas\n* Modify existing software to correct errors, to adapt to new hardware, or to improve its performance\n* Design, develop and modify software systems, using scientific analysis and mathematical models to predict and measure outcome and consequences of design\n\n\nExperience and Education:\n* Seven (7) years' experience as a SWE, in programs and contracts of similar scope, type, and complexity\n* Bachelor's Degree in Computer Science or related discipline from an accredited college or university.\n* Four (4) years of additional SWE experience on projects with similar software processes may be substituted for a bachelor's degree.\n* Python experience\n* Experience building and deploying Docker containers in a Kubernetes environment\n* **Position requires active Security Clearance with appropriate Polygraph**\n\n  \n\nIndependent Software is an Equal Opportunity Employer EOE, M/F/D/V.\n\n\n\n\nJH5NaPYWi1"},{"_id":"6709d79b6ec29b27dacd941e","job_title":"Senior Full Stack Engineer","company":"Adlumin Inc.","job_location":"Remote, US","job_description":"**Location: Remote**  \n\n**Schedule: Full-Time**  \n\n**Travel: None**  \n\n  \n\n**About Adlumin:**  \n\nAdlumin, Inc. provides the enterprise-grade security operations platform and managed detection and response (MDR) services that keep mid-market organizations secure. With one license and one platform, Adlumin’s patented technology and seamless integrations provide everything organizations need effective for effective threat hunting, incident response, vulnerability management, darknet exposure monitoring, compliance support and much more. Adlumin is feature-rich enough for organizations with in-house expertise to operate on their own, yet purpose-built to enhance collaboration with and provide full, real-time visibility from trusted providers. www.adlumin.com.  \n\n  \n\n**About the Role:**  \n\nAdlumin, Inc. is looking to hire a Senior Full Stack Engineer to design, implement, and optimize full-stack architectures, leveraging serverless technologies and cloud-native solutions. The role requires strong collaboration across teams to enhance the efficiency, scalability, and security of applications, focusing on both back-end and front-end development while maintaining best practices in system reliability and optimization.The ideal candidate for this role should possess a bachelor’s degree in computer science, have a basic understanding of front-end tech in Rails, and back-end coding in platforms (Python, Ruby and JavaScript).  \n\n  \n\n**Responsibilities:*** Develop reusable and scalable code libraries to enhance application performance and maintainability.\n* Implement and maintain security monitoring systems for event logs and user activity, ensuring best practices in cybersecurity.\n* Collaborate closely with front-end and back-end teams to identify, troubleshoot, and resolve application bottlenecks and performance issues.\n* Continuously optimize server-side code and infrastructure, improving speed, efficiency, and resource management.\n* Design and implement data storage solutions tailored for high-volume event-driven architectures.\n* Ensure the stability and scalability of serverless technologies, focusing on zero downtime, automated deployments, and effective monitoring.\n* Stay current with industry trends and advancements in full-stack frameworks, cloud computing, and security best practices.\n\n\n  \n\n**Position Requirements:*** Bachelor’s degree in computer science, Software Engineering, or a related technical field.\n* 5+ years of experience as a Full Stack Engineer, with a strong focus on both front-end and back-end development.\n* Proven expertise in Python, Ruby, JavaScript, and modern web development frameworks like Ruby on Rails or similar.\n* Extensive experience designing and developing APIs and integrating third-party services in a SaaS environment.\n* In-depth knowledge and experience with AWS services, including Lambda, API Gateway, DynamoDB, and S3.\n* Strong understanding of serverless architectures and event-driven programming.\n* Ability to write clean, efficient, and scalable code with a focus on performance optimization.\n* Demonstrated ability to prioritize and manage multiple projects in a fast-paced, deadline-driven environment.\n* Experience with CI/CD pipelines, cloud infrastructure, and automated testing.\n* Strong communication skills and experience collaborating with cross-functional teams, especially in remote settings.\n* US Work Authorization required\n\n\n  \n\n**Why work for Adlumin?*** Great opportunity to work for a fast-growing company!\n* Generous PTO and benefits package (medical, dental, vision, stock options)\n* Home Office Bonus - $400\n* 401k options\n* Choice of laptop equipment (Mac or PC) to work remotely with\n\n\n  \n\n*Adlumin is proud to be an equal opportunity employer. We are committed to equal opportunity regardless of race, color, ancestry, religion, gender, gender identity, genetic information, parental or pregnancy status, national origin, sexual orientation, age, marital status, disability, or veteran status.*"},{"_id":"6709d79b6ec29b27dacd941f","job_title":"Senior Back End Developer","company":"Adlumin Inc.","job_location":"Remote, US","job_description":"**Location:** Remote  \n\n**Schedule:** Full-Time  \n\n**Travel:** None  \n\n  \n\n**About Adlumin:**  \n\nAdlumin, Inc. provides the enterprise-grade security operations platform and managed detection and response (MDR) services that keep mid-market organizations secure. With one license and one platform, Adlumin’s patented technology and seamless integrations provide everything organizations need effective for effective threat hunting, incident response, vulnerability management, darknet exposure monitoring, compliance support and much more. Adlumin is feature-rich enough for organizations with in-house expertise to operate on their own, yet purpose-built to enhance collaboration with and provide full, real-time visibility from trusted providers. www.adlumin.com.  \n\n  \n\n**About the Role:**  \n\nAdlumin, Inc. is seeking a skilled Senior Back End Developer to join our team. The ideal candidate will have an experienced team lead background with expertise in Python and Go, AWS cloud services, and serverless architectures.  \n\n  \n\n**Responsibilities:*** Design and implement scalable, secure, and high-performance backend services and APIs\n* Work closely with frontend developers and product managers to define feature specifications and build the next generation of products\n* Lead AWS cloud infrastructure management and optimization, ensuring high availability and fault tolerance\n* Implement robust security measures and ensure compliance with industry standards\n* Mentor junior engineers and conduct code reviews to ensure software quality\n* Collaborate with cross-functional teams to solve complex technical challenges\n* Stay abreast of emerging technologies and trends in cloud computing and cybersecurity\n* Team Development: Mentor and coach team members to enhance their skills and career growth\n* Performance Management: Conduct regular performance reviews and provide constructive feedback\n* Conflict Resolution: Address and resolve any conflicts within the team promptly and effectively\n* Recruitment and Onboarding: Participate in hiring processes and ensure new team members are properly onboarded\n* Goal Setting: Set clear, achievable goals for the team and monitor progress\n* Motivation and Engagement: Foster a positive work environment and keep the team motivated\n* Communication: Ensure open and transparent communication within the team\n* Strategic Planning: Align team objectives with the overall organizational strategy\n\n\n  \n\n**Position Requirements:*** Bachelor’s or master’s degree in computer science, Engineering, or a related field\n* Minimum of 5 years of experience in backend development, with a strong focus on AWS cloud services\n* Proficient in programming languages such as Python, Go, or Node.js.\n* Extensive experience with AWS services such as EC2, Lambda, S3, RDS, and DynamoDB\n* Strong understanding of RESTful API development and microservices architecture\n* Experience with containerization and orchestration technologies (Docker, Kubernetes)\n* Knowledge of cybersecurity principles and best practices is highly desirable\n* Familiarity with continuous integration/continuous deployment (CI/CD) pipelines and automated testing frameworks\n* Excellent problem-solving skills and the ability to work in a fast-paced, agile development environment\n* Strong communication and collaboration skills\n* US Work Authorization (Adlumin does not sponsor visas at this time)\n* Must be located within the US for consideration\n\n\n  \n\n**Why work for Adlumin?*** Great opportunity to work for a fast-growing company!\n* Generous PTO and benefits package (medical, dental, vision, stock options)\n* Home Office Bonus - $400\n* 401k options\n* Choice of laptop equipment (Mac or PC) to work remotely with\n\n  \n\n*Adlumin is proud to be an equal opportunity employer. We are committed to equal opportunity regardless of race, color, ancestry, religion, gender, gender identity, genetic information, parental or pregnancy status, national origin, sexual orientation, age, marital status, disability, or veteran status.*"},{"_id":"6709d79b6ec29b27dacd9420","job_title":"Electrical Software & Controls Engineer","company":"Astec Industries","job_location":"Yankton, SD, US","job_description":"BUILT TO CONNECT\n\n\nAstec is a global, environmentally focused infrastructure and manufacturing company of asphalt road building and aggregate processing. Our mission is to design and build the most innovative products for the industries we serve. Leveraging innovative solutions and technologies, we serve customers all over the world.\n\n  \n\nABOUT THE POSITION\n\n\nAt Astec, we are building a world class electrical and software engineering team. A team that values free thought for innovative idea generation and disciplined engineering for the realization of those ideas to drive solutions for our customers. By freeing our creative minds, we bring solutions our customers haven’t even realized they need yet. Through disciplined engineering we ensure the solutions we provide are effective, simple to use, reliable, and cost effective.\n\n  \n\nThe Controls Software Engineer will be a part of a dynamic team of engineers working on the development of control/automation code for heavy construction equipment, ranging from rock crushers, screens, conveying equipment, etc. The engineer will be involved in the creation of product requirements, decomposition to software requirements, structured software decomposition, code development, software design reviews, and software unit and integration testing. The engineer will move from project to project as required and may be working on multiple projects within a given timeframe. All project work will be scheduled by the New Product Development Manager(s) and the Continuous Improvement Manager(s) such that the engineer will not be over allocated but will have definite deadlines and visibility into upcoming work.\n\n  \n\nSoftware will be developed on PLCs, embedded controllers, and HMI displays. Currently all systems are coded in either CodeSys, TIA Portal or B&R Automation Studio. The Control Software Engineer will work with the Electrical Engineer(s) on a project to map I/O, define necessary configurations, understand sensor input requirements as well as device output drive requirements. The Control Software Engineer will work cooperatively with the Electrical Engineer(s) and the Mechanical Engineer(s) to develop the appropriate control algorithms to produce the equipment functionality required by the customer and Product Management.\n\n  \n\nThe Control Software Engineer will also work with other cross-functional teams, including but not limited to sales, manufacturing, purchasing, and service to ensure the successful completion of projects and launch of equipment.\n\n\nControls Software Engineer may at times be asked to travel for project testing and system integration testing, as well as to develop business relationships with customers, dealers, and suppliers. They may also participate in product focus groups to gain critical customer application and design suggestions to assist in the development of product lines.\n\n  \n\nESSENTIAL DUTIES AND RESPONSIBILITIES (may include but not limited to)\n\n* Use structured systems engineering approach for the development of the software used to control heavy construction equipment.\n* Uses knowledge of process automation techniques to advance the simplicity of operation and troubleshooting of equipment to maximize productivity by enhancing operator functionality and the minimization of equipment downtime.\n* Uses structured software design techniques to distill product requirements into a product software specification, product software design, and product software test plan and creates the corresponding documents.\n* Completes the controller/PLC programming and the HMI screen programming for product projects based on the software design.\n* Performs unit testing and integration testing of all controller/PLC/HMI systems to insure performance and realization of all product requirements.\n* Develops the software test plans for new designs and changes to existing designs, and coordinates the testing and validation using these plans,\n* Contributes to the development of product documentation, including production work instructions, training manuals, troubleshooting guides, and product test plans.\n* Identifies improvement opportunities and enhancements for product enhancements and/or cost reductions.\n* Contributes to project teams to ensure the successful completion of project objectives, including schedule, budget, and feature set.\n* Contributes to the development of new processes and procedures to enhance the software and hardware design capabilities and work products of the engineering team.\n* Leads cross-functional software and HMI design reviews.\n* Leads software design reviews for developed control software.\n* Assists customers, via telephone or on site, to resolve function and/or application issues.\n* Works with the Service Department to resolve field and warranty issues.\n* Works with the Technical Publications Department to develop and update operation/parts/service manuals.\n* Adheres to all Astec design and coding standards.\n* Performs engineering calculations as required during design cycle.\n* Follows proper safety procedures.\n* Performs other duties as assigned.\n\n  \n\nMINIMUM EDUCATION and/or EXPERIENCE REQUIRED\n\n* Bachelor of Science (B.S.) degree in Electrical / Computer Engineering or related field.\n* Minimum of five (5) years of experience in the design and development of industrial or mobile equipment control software.\n\n  \n\nSKILLS AND ABILITIES REQUIRED\n\n\nJob-related Skills and Abilities\n\n* Knowledgeable of development software and tools for embedded systems.\n* Proficient in C / C+ / Structure Text programming, preferably in automotive or mobile equipment applications.\n* Knowledgeable of network protocols such as CAN, Ethernet, Wireless 802.11, etc.\n* Proficient at interfacing software with the control and data acquisition from sensor, including pressure, proximity, angular, temperature, etc.\n* Proficient with developing code for the control of valves, motors, and other industrial devices.\n* Ability to work satisfactorily as a team member.\n* Good communication skills (both verbal and written).\n* Good organization and time-management skills.\n* Willingness to accept responsibility and take on new challenges.\n* Ability to exercise discretion and independent judgment on a customary and regular basis.\n* Proficiency with personal computer and Microsoft Office Suite software applications.\n* Adept at problem solving.\n\n  \n\nLanguage Skills\n\n* Ability to write reports, business correspondence and procedure manuals.\n* Ability to effectively present information and respond to questions from groups of managers, clients, customers, and the public.\n* Ability to write routine reports, correspondence, and effectively present information to customers and/or employees of organization and respond to questions from groups of managers, clients, customers, and the public.\n\n  \n\nReasoning Ability Skills\n\n* Ability to define problems, collect data, establish facts, and draw valid conclusions.\n* Ability to interpret an extensive variety of technical instructions in mathematical or diagram form and deal with several abstract and concrete variables.\n* Must have strong analytical and troubleshooting skills.\n\n  \n\nOTHER REQUIREMENTS\n\n* Pre-employment drug screen, physical (if required), and background check.\n* Flexibility to work additional hours as required.\n* Occasional travel (including international).\n* Valid driver's license and ability to safely operate a motor vehicle.\n\n  \n\nPREFERENCES\n\n* Experience with CodeSys, C/C++, and Ladder Logic programming.\n* Experience developing software/firmware controls for and interfaces to Telematics, hydraulic circuits, 12V/24V DC electric circuits, A/C motors, and/or control systems for off-road construction equipment.\n* Experience in the design and creation of software for the control & automation of off-road construction equipment.\n\n\nSAFETY\n\n\nAstec is dedicated to a culture of Behavior Based SAFETY and a Healthy Environment!\n\n* Proficient in promoting safe and healthy work environment.\n* Notify area supervisor of product discrepancies or equipment malfunctions.\n* Adhere to established company policies and procedures paying special attention to safety regulations.\n* Report defective materials, equipment, or questionable conditions to the area supervisor/manager to identify and correct the root cause.\n* Wear personal protective equipment (PPE) in accordance with training guidelines.\n\n  \n\nPHYSICAL DEMANDS\n\n\nThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable\n\n\naccommodations may be made to enable individuals with disabilities to perform the essential functions.\n\n  \n\nWhile performing the duties of this job, the employee is regularly required to remain in a stationary position a minimum of 50% of the time, move and frequently operate a computer and other office equipment and occasionally properly employ objects, tools and/or controls. The employee is frequently required to communicate and exchange accurate information. The employee is regularly required to reach and occasionally attain non-standard physical positions for varying amounts of time. Specific vision abilities include close vision, distance vision, peripheral vision, depth perception and ability to adjust focus.\n\n\nThe employee must regularly transport up to 10 pounds and occasionally transport up to 25 pounds. Lifting devices must be used or help must be requested for anything over 25 pounds.\n\n\nRequired to occasionally ascend/descend, balance and work at various heights.\n\n\nAbility to travel by land and/or air for extended periods of time.\n\n\nSpecific vision abilities required by this job include close, distance, color, and peripheral vision, depth perception, and ability to adjust focus.\n\n  \n\nOur Culture and Values\n\n\nEmployees that become part of Astec embody the values below throughout their work.\n\n* Continuous devotion to meeting the needs of our customers.\n* Honesty and integrity in all aspects of business.\n* Respect for all individuals.\n* Preserving entrepreneurial spirit and innovation.\n* Safety, quality, and productivity as means to ensure success.\n\n  \n\nWORK ENVIRONMENT\n\n\nThe work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\n  \n\nWhile performing the duties of this job, the employee is regularly exposed to a climate-controlled office environment and is occasionally exposed to a shop manufacturing environment.\n\n  \n\nOffice environment exposures include frequent and extensive telephone and computer use. The noise level in the office setting is usually moderate consistent with an office environment.\n\n  \n\nShop manufacturing environment exposures include exposure to moving mechanical parts, machinery, tools and equipment, vibration, fumes or airborne particles, motorized vehicles, welding and machining operations, outside weather conditions and exposure to the risk of electric shock. The employee may occasionally be exposed to varying levels of dirt, dust, toxic or caustic chemicals, very warm and/or very chilly temperatures. The noise level in the shop can be very loud at times consistent with an industrial assembly facility and may require hearing protection.\n\n  \n\nMines, road construction and forestry job site exposures include exposure to climate conditions indicative of the geographic location and the season. Field duties require that the employee work in close proximity to heavy roadbuilding and construction equipment (dump trucks, loaders, cranes, crushers, pavers, cold planers, material transfer vehicles, stabilizers, wheel loaders,\n\n\nexcavators, skidders, feller buncher, chippers, grinders etc.) and traffic associated with mines, road construction, forestry and recycling sites. The employee is frequently exposed to moving mechanical parts and fumes or airborne particles. The employee is occasionally exposed to high, precarious places, toxic or caustic chemicals, vibration, and risk of electrical shock. The noise level in this environment is usually loud and may require hearing protection.\n\n\nThe employee is occasionally exposed to travel hazards associated with automobile and/or airplane travel."},{"_id":"6709d79b6ec29b27dacd9421","job_title":"DEVELOPER FOR NCR COMPUTER SCIENTIST 4","company":"Veracity Engineering","job_location":"Atlantic City, NJ, US","job_description":"Facility/Facilities: Atlantic City, NJ\nVeracity Engineering is an industry leader in aviation engineering and management consulting. We apply proven principles and innovative approaches to solve tomorrow’s problems today. Since 2001, Veracity’s staff of experienced, passionate and creative professionals has provided our government and commercial clients with innovative solutions to modernize air traffic systems and advance global initiatives in safety, efficiency, and capacity.\n**SUMMARY**\n\n\n\nWe are looking for a developer (second level support) for our National Airspace System Common Reference team to meet future needs of our FAA customer. We are seeking highly motivated talent with Java, Linux or Openshift backgrounds.\n\n\n**Essential Job Functions:**\n\n\n\nDevelop and maintain application, using Java, Openshift. Kubernetes, Openshift administration, system configuration, such as Elastic Search, Kibana, Grafana Dashboard in Linux environment. Maintain Ansible and shell scripts. Maintain code base and support continuous integration using Git/Gitlab. Second level support for deployment and field issues.\n\n\n**Knowledge, Skills and Abilities:**\n\n\n**Required:**\n\n\n* Experience supporting Second Level Engineering on NAS systems.\n* Experience with SLE System Support Directives (SSD) development, test and deployment processes\n* Experience supporting SWIM Capabilities in the NAS\n* Experience in Java development or object oriented programming.\n* Able to support application configurations in Linux environments.\n* Manage and configure with various databases, systems.\n* Detail oriented in documentation and motivated in learning.\n\n\n**Preferred:**\n\n\n* Experience with Ansible, Linux Admin (RHEL8), selinux\n* Experience with kubernetes, docker, kubernetes.\n* Elastic Search, Kibana, Grafana or ELK\n* Messaging: Pubsub message system, such as Kafka or JMS Message queue or Active MQ\n\n\n**Work Environment and Physical Demands**\n\n\n* Limited travel\n* Onsite\n\n\nAt Veracity, we want our employees to excel and grow professionally. With an emphasis on continuing education, we demonstrate our commitment to employee growth and development by providing tuition reimbursement for education and certifications. In addition to tuition reimbursement, we offer one of the best benefits packages in the industry: competitive health benefits package, paid time off, 401K matching, and vested from day one to name just a few of our benefits and perks.\n\n\n\nU.S. Eligibility Requirements (Standard for all U.S. Positions)\n\n\n* Interested candidates must submit an application and resume/CV online to be considered.\n* Must be 18 years of age or older.\n* Must be willing to submit to a background investigation; any offer of employment is conditioned upon the successful completion of a background investigation.\n* Must have unrestricted work authorization to work in the U.S. For U.S. employment opportunities, Veracity hires U.S. citizens, permanent residents, asylees, refugees, and temporary residents. Temporary residence does not include those with non-immigrant work authorization (F, J, H, or L visas), such as students in practical training status. Exceptions to these requirements will be determined based on the shortage of qualified candidates with a particular skill. Veracity will require proof of work authorization.\n* Must be willing to execute Veracity’s Confidentiality and Non-Disclosure Agreement which requires, among other things, post-employment obligations relating to non-solicitation, confidentiality, and non-disclosure\n\n\n*Veracity believes that all persons are entitled to equal employment opportunity and does not discriminate against nor favor any applicant because of race, sex, color, disability, national origin, religion, creed, age, marital status, veteran status, gender, gender identity/expression, actual or perceived sexual orientation, or any other protected characteristic. Equal employment opportunity will be extended in all aspects of the employer-employee relationship, including, but not limited to, recruitment, hiring, training, promotion, transfer, demotion, compensation, benefits, layoff, and termination. In addition, Veracity will make reasonable accommodations to known physical or mental limitations of an otherwise qualified applicant with a disability, unless the accommodation would impose an undue hardship on the operation of our business.*"},{"_id":"6709d79b6ec29b27dacd9422","job_title":"WMSCR SYSTEM ADMINISTRATOR COMPUTER SCIENTIST 4","company":"Veracity Engineering","job_location":"Atlantic City, NJ, US","job_description":"Facility/Facilities: Atlantic City, NJ\nVeracity Engineering is an industry leader in aviation engineering and management consulting. We apply proven principles and innovative approaches to solve tomorrow’s problems today. Since 2001, Veracity’s staff of experienced, passionate and creative professionals has provided our government and commercial clients with innovative solutions to modernize air traffic systems and advance global initiatives in safety, efficiency, and capacity.\n**SUMMARY/ Duties Works independently under general guidelines or objectives**\n\n\n\nWorks independently with minimal supervision. Provides expertise in software requirements analysis, design, design reviews, development, software testing, integration, installation, and maintenance of complex computer systems. Experience with software programming in the languages used for NAS and NAS support systems which may include but not limited to languages such as C, C++, Java, XML and SQL.  \n\nProvides expertise in the development and improvement of software development processes. Must be familiar with interfacing databases to client-side interfaces. Familiarity with object-oriented programming techniques, client/server development, cross-browser development, and Unix/Linux skills maybe required. May need to work with specialists from other disciplines such as hardware, software, logistic support, and testing to produce fully integrated and responsive components and systems. Interprets and analyzes complex information systems data to develop technical documentation, system diagrams, and presentation materials.\n\n\n\nProvides expertise in system administration, managing and maintaining the operating system, configuration of user accounts, network settings and other system parameters. Interprets and analyzes complex information systems data to develop technical documentation, system diagrams, and presentation materials.\n\n\n**ESSENTIAL JOB FUNCTIONS**\n\n\n\n* Provide 2nd level engineering support for WMSCR\n\n\n* Support system development/testing/integration/deployment activities for WMSCR\n\n\n* Provision, install, configure, monitor and maintain Linux systems hardware and software infrastructure\n\n\n* Perform ongoing performance tuning, hardware and software upgrades, and resource optimization as required.\n\n\n* Develop and manage Linux shell scripts to support application software testing and administration\n\n\n* Able to debug software issues in Linux and Windows environments\n\n\n\nAt Veracity, we want our employees to excel and grow professionally. With an emphasis on continuing education, we demonstrate our commitment to employee growth and development by providing tuition reimbursement for education and certifications. In addition to tuition reimbursement, we offer one of the best benefits packages in the industry: competitive health benefits package, paid time off, 401K matching, and vested from day one to name just a few of our benefits and perks.\n\n\n\nU.S. Eligibility Requirements (Standard for all U.S. Positions)\n\n\n* Interested candidates must submit an application and resume/CV online to be considered.\n* Must be 18 years of age or older.\n* Must be willing to submit to a background investigation; any offer of employment is conditioned upon the successful completion of a background investigation.\n* Must have unrestricted work authorization to work in the U.S. For U.S. employment opportunities, Veracity hires U.S. citizens, permanent residents, asylees, refugees, and temporary residents. Temporary residence does not include those with non-immigrant work authorization (F, J, H, or L visas), such as students in practical training status. Exceptions to these requirements will be determined based on the shortage of qualified candidates with a particular skill. Veracity will require proof of work authorization.\n* Must be willing to execute Veracity’s Confidentiality and Non-Disclosure Agreement which requires, among other things, post-employment obligations relating to non-solicitation, confidentiality, and non-disclosure\n\n\n*Veracity believes that all persons are entitled to equal employment opportunity and does not discriminate against nor favor any applicant because of race, sex, color, disability, national origin, religion, creed, age, marital status, veteran status, gender, gender identity/expression, actual or perceived sexual orientation, or any other protected characteristic. Equal employment opportunity will be extended in all aspects of the employer-employee relationship, including, but not limited to, recruitment, hiring, training, promotion, transfer, demotion, compensation, benefits, layoff, and termination. In addition, Veracity will make reasonable accommodations to known physical or mental limitations of an otherwise qualified applicant with a disability, unless the accommodation would impose an undue hardship on the operation of our business.*"},{"_id":"6709d79b6ec29b27dacd9423","job_title":".NET CORE DEVELOPER COMPUTER SCIENTIST 3","company":"Veracity Engineering","job_location":"Atlantic City, NJ, US","job_description":"Facility/Facilities: Atlantic City, NJ\nVeracity Engineering is an industry leader in aviation engineering and management consulting. We apply proven principles and innovative approaches to solve tomorrow’s problems today. Since 2001, Veracity’s staff of experienced, passionate and creative professionals has provided our government and commercial clients with innovative solutions to modernize air traffic systems and advance global initiatives in safety, efficiency, and capacity.\n**SUMMARY**\n\n\n\nWe are looking for an experienced .NET CORE Developer to support RMLS applications. This individual will collaborate with team members in resolving technical issues within the RMLS system, as well as document and test solutions. May need to support software installation.\n\n\n**ESSENTIAL JOB FUNCTIONS**\n\n\n* Knowledge and experience in software development and test under agile methodology.\n* Develops new features and modifies the structure of existing software products.\n* Experience troubleshooting application problems.\n* Provide support for the deployment of the applications.\n* Provide field support.\n\n\n**Highly Desired Skills:**\n\n\n* Extensive web development (.NET CORE, MVC, CSS, HTML)\n* Database developer background (Oracle/SQL)\n* Development experience in Oracle replicated environment\n* JavaScript programming\n* ASP.NET\n* AJAX and Web Service\n\n\n**Other Job Functions**\n\n\n\nAttends and may lead meetings, design reviews, working groups and briefings. Reports issues and problems and recommends solutions. Performs other related duties in line with tasks assignments.\n\n\n**Knowledge, Skills and Abilities**\n\n\n\n(See Essential Job Functions – Above)\n\n\n* Excellent writing and verbal skills\n* Excellent customer relations skills\n* Ability to work in a team environment\n\n\n**Additional Skills a Plus:**\n\n\n* PHP\n* Python\n* Test Driven Development\n* Web server side knowledge (Apache/IIS)\n\n\n**Work Environment and Physical Demands**\n\n\n\nFAA William J. Hughes Technical Center.\nAt Veracity, we want our employees to excel and grow professionally. With an emphasis on continuing education, we demonstrate our commitment to employee growth and development by providing tuition reimbursement for education and certifications. In addition to tuition reimbursement, we offer one of the best benefits packages in the industry: competitive health benefits package, paid time off, 401K matching, and vested from day one to name just a few of our benefits and perks.\n\n\n\nU.S. Eligibility Requirements (Standard for all U.S. Positions)\n\n\n* Interested candidates must submit an application and resume/CV online to be considered.\n* Must be 18 years of age or older.\n* Must be willing to submit to a background investigation; any offer of employment is conditioned upon the successful completion of a background investigation.\n* Must have unrestricted work authorization to work in the U.S. For U.S. employment opportunities, Veracity hires U.S. citizens, permanent residents, asylees, refugees, and temporary residents. Temporary residence does not include those with non-immigrant work authorization (F, J, H, or L visas), such as students in practical training status. Exceptions to these requirements will be determined based on the shortage of qualified candidates with a particular skill. Veracity will require proof of work authorization.\n* Must be willing to execute Veracity’s Confidentiality and Non-Disclosure Agreement which requires, among other things, post-employment obligations relating to non-solicitation, confidentiality, and non-disclosure\n\n\n*Veracity believes that all persons are entitled to equal employment opportunity and does not discriminate against nor favor any applicant because of race, sex, color, disability, national origin, religion, creed, age, marital status, veteran status, gender, gender identity/expression, actual or perceived sexual orientation, or any other protected characteristic. Equal employment opportunity will be extended in all aspects of the employer-employee relationship, including, but not limited to, recruitment, hiring, training, promotion, transfer, demotion, compensation, benefits, layoff, and termination. In addition, Veracity will make reasonable accommodations to known physical or mental limitations of an otherwise qualified applicant with a disability, unless the accommodation would impose an undue hardship on the operation of our business.*"},{"_id":"6709d79b6ec29b27dacd9424","job_title":"Sr. Software Engineer (Java/IAM)","company":"Ascending","job_location":"Remote, US","job_description":"**itle:** Sr. Software Engineer (IAM/Java)\n\n**Type:** Long-term Contract\n\n**Location:** Fully Remote\n\n**Job Description:**\n\n\nWe are seeking a Sr. Software Engineer to support a mature team within a large financial regulator. The Software Engineer will join a team of seasoned developers responsible for the upkeep of a large identity platform. This person will play a crucial role maintaining, enhancing, and adding features to an IAM platform used enterprise wide.\n\n**Required Skills:**\n\n* Bachelor's degree in computer science engineering or a related discipline\n* Experience with Identity and Access Management tools\n* Proficient in coding with Java, Spring & Spring Boot, SQL, scripting, and Junit for building enterprise-level applications.\n* Experience with REST Api development, web services\n* Hands-on experience with AWS specifically ECS, Lambda, API Gateway, and storage services.\n\n**Preferred Skills:**\n\n* Experience with ForgeRock/Ping or any other identity products\n* Experience with Splunk\n* Hands-on experience with frontend development\n* Knowledge of Continuous Deployment/Integration practices including automated unit/integration/regression tests with tools such as Jenkins, Maven, or Gradle.\n* AWS professional certification\n\n\n\n\nnrxT2CjzKm"},{"_id":"6709d79b6ec29b27dacd9425","job_title":"Full Stack Software Engineer – TopoMap Application","company":"Xcellent Technology Solutions","job_location":"Remote, US","job_description":"Environment: Remote  \n\n4-6 Years Experience  \n\nDegree Required  \n\n  \n\nAre you ready to take on a professionally challenging role that will push your technical expertise and problem-solving skills to new heights? We are seeking a highly skilled **Full Stack Software Engineer** to work on our cutting-edge **TopoMap web application**, an essential tool powered by an extensive Python-based backend and a dynamic JavaScript-driven web interface.  \n\n  \n\nIn this role, you won’t just be building; you’ll be **orchestrating the entire development and deployment process**. While Esri manages much of the backend work, you’ll dive deep into its functionality, making key modifications and ensuring seamless integration with the web interface. This is your chance to truly understand and influence the backend architecture while collaborating with a leading GIS platform.  \n\n  \n\nYou will play a pivotal role in **designing and implementing the CI/CD pipeline**, from **server provisioning** via **Terraform** to standing up **ArcGIS Services** and deploying both backend and frontend code.  \n\n  \n\n**Why this role is for you:*** **Architect Your Own CI/CD Pipeline:** You will take full ownership of the pipeline that provisions servers from Git using Terraform, deploys code, and automates ArcGIS services. This is a chance to build systems that have a lasting impact on our infrastructure.\n* **Master Complex Systems:** Not only will you work with modern web technologies, but you’ll also engage with Esri’s GIS platform and the Python backend, gaining valuable experience in advanced geospatial services.\n* **Push the Boundaries of Full Stack Engineering:** Your role will cover everything from infrastructure as code (Terraform) to modifying backend services and working on the front end. You'll grow your expertise in multiple areas and be at the forefront of cutting-edge development practices.\n\n**Required skillsets include:*** Continuous Integration and Continuous Deployment pipelines in GitLab  \n\nAWS Automation (Terraform, CDK, CloudFormation)\n* Automated Configuration Scripting Languages (YAML, Python, PowerShell, Chef/cinc)\n* AWS Compute Infrastructure (EC2, AutoScale Groups, Lambda, Step Functions)\n* API Development (AWS Lambda, SQS, APIGateway)\n\n**Desirable skillsets include:*** AWS Networking (CloudFront, Account Trust, IAM, Security Groups, Routing/Subnets)\n* Basic web development (JavaScript, NodeJS, ReactJS, CSS)\n* Containerization (Kubernetes, Docker, AWS ECS/EKS)\n* Esri ArcGIS Enterprise (Server, Portal, Data Store)\n* Knowledge of geospatial data and applications.\n\n**Salary Range - 90K-100K plus robust benefits package:**  \n\n  \n\nIf you thrive on solving complex technical challenges and want to be a key player in developing robust, scalable applications, this position is for you. Come help us build the future of geospatial technology!  \n\n\n\n\nM0QkyPBwmq"},{"_id":"6709d79b6ec29b27dacd9426","job_title":"DevOps Engineer","company":"ASSYST, Inc.","job_location":"Remote, US","job_description":"ASSYST is seeking a highly experienced DevOps Engineer to join our clients dynamic DevSecOps team. The ideal candidate will have 8+ years of experience in automating and streamlining complex enterprise IT environments, with proven expertise in developing, configuring, and maintaining Continuous Integration/Continuous Deployment (CI/CD) pipelines and tools. The role involves working closely with IT developers to improve collaboration across operations, development, and testing functions, with a focus on optimizing processes for scalability, automation, and high availability.  \n\n  \n\nThis position requires working under minimal direction, exercising considerable latitude for independent judgment, and providing on-call support, including nights and weekends, for critical environments.  \n\n  \n\n**Job Title: DevOps Engineer**  \n\n**Location: Austin, TX (Remote - Candidates must be located within the state of Texas)**  \n\n  \n\n**Key Responsibilities:**\n\n\n* Design, monitor, and enhance batch jobs and operational processes for improved performance and efficiency.\n* Implement and enhance CI/CD solutions by developing and maintaining automated pipelines for consistent and reliable deployments.\n* Utilize configuration management tools to automate updates and fixes across production and non-production environments.\n* Review and analyze current deployment processes, propose improvements, and streamline code deployments to minimize errors.\n* Install, configure, build, and deploy applications for Eligibility Supporting Technology across development, test, training, and production environments.\n* Maintain thorough documentation of processes and procedures.\n* Provide on-call triage support to ensure high availability for users across multiple environments (development, test, training, and production).\n* Assist with release and sprint-related activities to ensure smooth development cycles.\n* Develop and maintain automation solutions for existing processes while also designing new, scalable solutions.\n* Create detailed plans and proposals for new automation solutions, presenting them for approval.\n\n\n**Required Skills & Experience:**\n\n\n* 10+ years of experience automating full lifecycle enterprise IT environments using Infrastructure as Code (IaC), Configuration as Code (CaC), and CI/CD tools.\n* 10+ years of experience designing and implementing automation solutions for scalability, repeatability, and recoverability, using tools such as Terraform, Ansible Automation Platform, Jenkins, Liquibase, GitHub Actions, and more.\n* 10+ years of experience working with environments such as IBM WebSphere, MQ, Oracle, and AWS.\n* 8+ years of experience with programming or scripting languages like Python, GoLang, Shell, Ruby, Perl, Bash.\n* 8+ years of experience with containers and orchestration platforms like Kubernetes, Docker, OpenShift, PODMAN, and packaging tools like Helm Charts and Kustomize.\n* 8+ years of experience with both Linux and Windows operating systems.\n* 8+ years of experience designing and implementing cloud solutions using the AWS Well-Architected Framework.\n* Excellent written and verbal communication skills, with an ability to work collaboratively across teams.\n* Preferred Skills & Experience:\n* 5+ years of development experience using Java technologies such as Java, J2EE, Spring Boot, EJB, JSP, JSF/Struts.\n* Experience with WebSphere ND, MQ, Oracle, SQL, PL/SQL Developer, LDAP, Splunk, and Dynatrace.\n\n  \n\n  \n\n*ASSYST is an Equal Opportunity Employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, disability, military status, national origin or any other characteristic protected under federal, state, or applicable local law.*"},{"_id":"6709d79b6ec29b27dacd9427","job_title":"Senior Backend Software Engineer (Remote)","company":"ICF","job_location":"Reston, VA, US","job_description":"Description\n\n\nAs a Sitecore Technical Lead at ICF Next, you will apply your analytical and critical thinking skills to help solve client challenges. You will work in a fast-paced and diverse environment, enjoy flexible work arrangements, and will have a management team that encourages your career development and growth. This role requires strong web application development skills in a Sitecore/C# development environment, the ability to properly prioritize, own and drive the work, and work collaboratively with multi-disciplinary teams in an Agile environment.\n\n **The Work**\n\n\nICF is supporting California State Government customer applications, which are built with Sitecore and React components. The delivery team consists of delivery support, front and back-end developers, UX/UI designers, content strategists, SMEs, business analysts, testers, and infrastructure and security professionals. The team works in 2-week iterations (10-week program increments) to develop new features, functionality, and modernization supporting both Information Technology and Marketing roadmaps.\n\n\nAs a contractor to federal or state governments, all hires may be required to complete additional background screenings at the time of hire or any time thereafter as requested.\n\n**Responsibilities:**\n\n* Collaborate with cross-functional teams to service dedicated client account in an Agile environment\n* Develop impactful features and/or fixes from a back-end development perspective for an enterprise-level web application\n* Implement and/or introduce modernization to Sitecore and .NET C# applications\n* Coordinate with and work alongside front-end developers to integrate front-end development deliverables with the Sitecore Content Management System (CMS)\n* Optimize technical documentation standards, internal processes, and solutioning\n* Troubleshoot complex systems and 3rd party integrations\n* Ensure comprehensive testing and remediation is performed on completed work alongside QA team members, as well as developing unit tests\n* Provide accurate documentation and ticket updates to the team’s Microsoft DevOps platform to enable accurate insight into the work being performed\n* Help business analysts write out granular user stories from a back-end development perspective by identifying any gaps, breaking down requirements into tasks, and/or providing estimates.\n* Troubleshoot current and legacy systems\n* Talk directly with the client to explain the technical side of the application for any errors found or new features developed\n* Participate in agile ceremonies, including sprint planning, daily standups, and retrospective meetings\n* Suggest areas for improvement in internal processes along with possible solutions\n* Foster client relationship from a technical aspect\n* Participate in incident response as a member of the on-call incident management rotation\n\n**Required Skills and Qualifications:**\n\n* You must be a U.S. Citizen (required by government for the position)\n* All work must be conducted within the U.S.\n* 9+ years as a full stack engineer involving delivery of complex, website related design/development that includes system integrations with more than one third-party system in addition to integration with Sitecore **OR** 5+ years of experience and a Baccalaureate-level degree in Computer Science, Information Systems, Engineering, or other related scientific or technical discipline\n* 3+ years developing secure web applications using modern techniques, languages, and frameworks\n* 3+ years developing and consuming web-based RESTful APIs with JSON payloads\n* 3+ years using distributed version control systems (e.g., git)\n* 3+ years designing and implementing RDBMS data models, data load processes, as well as optimizing and maintaining those implementations\n* 2+ years operating in a technical lead capacity using agile software development methodologies\n* 2+ years architecting modern web application systems and/or critical website-related system enhancements\n* 2+ years working with/around automated configuration management, continuous integration/deployment, and monitoring solutions\n* 2+ years modernizing applications and interfaces leveraging containerized applications and microservices\n* 2+ years working on sites with accessibility requirements and standards\n* Have at least **ONE** of the following certifications\n\n\n\t+ MSFT Certified Developer\n\t+ Sitecore Developer Certification\n\t+ MSFT Certified Solutions Developer\n\t+ Azure Developer Associate\n* Must be willing to travel to California for fingerprinting\n\n**Professional Skills:**\n\n* Strong analytical, problem-solving, and time management skills\n* Ability to work in a fast-paced, multi-workstream project team\n* Very strong oral and written communication skills\n* Excellent attention to detail\n\n**Preferred Skills:**\n\n* Experience with CI/CD pipelines, ideally Azure DevOps\n* Experience writing unit tests\n* Experience troubleshooting and resolving security vulnerabilities within the application\n* Experience working with Sitecore and C# websites\n* Proficiency in the concepts involved with Object-Oriented Programming (OOP)\n* Experience troubleshooting complex systems and third-party integrations\n\n**Working at ICF**\n\n\nWorking at ICF means applying a passion for meaningful work with intellectual rigor to help solve the leading issues of our day. Smart, compassionate, innovative, committed, ICF employees tackle unprecedented challenges to benefit people, businesses, and governments around the globe. We believe in collaboration, mutual respect, open communication, and opportunity for growth. If you’re seeking to make a difference in the world, visit www.icf.com/careers to find your next career. ICF—together for tomorrow.\n\n\nICF is an equal opportunity employer that values diversity at all levels. (EOE – Minorities/Females/ Protected Veterans Status/Disability Status/Sexual Orientation/Gender Identity). For more information, please read our EEO & AA policy.\n\n*Reasonable Accommodations are available for disabled veterans and applicants with disabilities in all phases of the application and employment process. To request an accommodation please email* *icfcareercenter@icf.com* *and we will be happy to assist. All information you provide will be kept confidential and will be used only to the extent required to provide needed reasonable accommodations. Read more about non-discrimination:* EEO is the law *and* Pay Transparency Statement*.*\n\n**Working at ICF**\n\n\nICF is a global advisory and technology services provider, but we’re not your typical consultants. We combine unmatched expertise with cutting-edge technology to help clients solve their most complex challenges, navigate change, and shape the future.\nWe can only solve the world's toughest challenges by building an inclusive workplace that allows everyone to thrive. We are an equal opportunity employer, committed to hiring regardless of any protected characteristic, such as race, ethnicity, national origin, color, sex, gender identity/expression, sexual orientation, religion, age, disability status, or military/veteran status. Together, our employees are empowered to share their expertise and collaborate with others to achieve personal and professional goals. For more information, please read our EEO & AA policy.\n\n\nReasonable Accommodations are available, including, but not limited to, for disabled veterans, individuals with disabilities, and individuals with sincerely held religious beliefs, in all phases of the application and employment process. To request an accommodation please email Candidateaccommodation@icf.com and we will be happy to assist. All information you provide will be kept confidential and will be used only to the extent required to provide needed reasonable accommodations. Read more here: Requesting an Accommodation for the ICF interview process.\n\n\nRead more about workplace discrimination rights, the Pay Transparency Statement, or our benefit offerings which are included in the Transparency in (Benefits) Coverage Act.\n\n **Pay Range** - There are multiple factors that are considered in determining final pay for a position, including, but not limited to, relevant work experience, skills, certifications and competencies that align to the specified role, geographic location, education and certifications as well as contract provisions regarding labor categories that are specific to the position.\n\n\nThe pay range for this position based on full-time employment is:\n\n\n$102,285.00 - $173,884.00\nNationwide Remote Office (US99)"},{"_id":"6709d79b6ec29b27dacd9428","job_title":"Backend Software Engineer (Remote)","company":"ICF","job_location":"Reston, VA, US","job_description":"Description\n\n**Backend Software Engineer (Remote)**\n\n\nAs a Senior Software Developer at ICF Next, you will apply your analytical and critical thinking skills to help solve client challenges. You will work in a fast-paced and diverse environment, enjoy flexible work arrangements, and will have a management team that encourages your career development and growth. This role requires strong web application development skills in an Azure/Sitecore/C# development environment, the ability to properly prioritize, own and drive the work, and work collaboratively with multi-disciplinary teams in an agile environment.\n\n **The Work**\n\n\nICF is supporting California State Government customer applications, which are built with Sitecore and React components. The delivery team consists of delivery support, front- and back-end developers, UX/UI designers, content strategists, SMEs, business analysts, testers, and infrastructure and security professionals. The team works in 2-week iterations (10-week program increments) to develop new features, functionality, and modernization supporting both Information Technology and Marketing roadmaps.\n\n**Responsibilities:**\n\n* Collaborate with cross-functional teams to service dedicated client account in an Agile environment\n* Develop impactful features and/or fixes from a back-end development perspective for an enterprise-level web application\n* Implement and/or introduce modernization to Sitecore and .NET C# applications\n* Coordinate with and work alongside front-end developers to integrate front-end development deliverables with the Sitecore Content Management System (CMS)\n* Optimize technical documentation standards, internal processes, and solutioning\n* Troubleshoot complex systems and 3rd party integrations\n* Ensure comprehensive testing and remediation is performed on completed work alongside QA team members, as well as developing unit tests\n* Provide accurate documentation and ticket updates to the team’s Microsoft DevOps platform to enable accurate insight into the work being performed\n* Help business analysts write out granular user stories from a back-end development perspective by identifying any gaps, breaking down requirements into tasks, and/or providing estimates.\n* Troubleshoot current and legacy systems\n* Participate in agile ceremonies, including sprint planning, daily standups, and retrospective meetings\n* Suggest areas for improvement in internal processes along with possible solutions\n* Foster client relationship from a technical aspect\n* Participate in incident response as a member of the on-call incident management rotation\n\n**Required Skills and Qualifications:**\n\n* You must be a U.S. Citizen (required by government for the position)\n* All work must be conducted within the U.S.\n* 7+ years of experience developing enterprise-level web applications as a back-end engineer **OR** 3+ years of experience and a bachelor's degree in computer science, Information Systems, Engineering, or other related scientific or technical discipline\n* 3+ years of experience installing, configuring, and supporting high-availability databases for large-scale complex applications and monitoring the department’s cloud-based solutions and environments\n* 2+ years of experience supporting and/or leading designing large-scale complex databases\n* 2+ years of experience performance tuning databases and indexes for large-scale SQL databases, troubleshooting/resolving database performance issues, connectivity issues, security issues, etc.\n* Must be able to travel to California for fingerprinting\n\n**Professional Skills:**\n\n* Proficiency in the concepts involved with object-oriented programming (OOP)\n* Strong understanding of .NET, C#, SQL, MVC\n* Proficiency with at least one version control system, ideally git\n* Familiarity with developing solutions alongside a Content Management System (CMS) such as Sitecore, Adobe Experience Manager (AEM), WordPress, or similar\n* Strong analytical, problem-solving, and time management skills\n* Ability to work in a fast-paced, multi-workstream project team\n* Very strong oral and written communication skills\n* Excellent attention to detail\n\n**Preferred Skills:**\n\n* Experience developing using Entity Framework\n* Experience writing unit tests\n* Experience troubleshooting and resolving security vulnerabilities within an application\n* Familiarity with CI/CD pipelines\n\n**Working at ICF**\n\n\nWorking at ICF means applying a passion for meaningful work with intellectual rigor to help solve the leading issues of our day. Smart, compassionate, innovative, committed, ICF employees tackle unprecedented challenges to benefit people, businesses, and governments around the globe. We believe in collaboration, mutual respect, open communication, and opportunity for growth. If you’re seeking to make a difference in the world, visit www.icf.com/careers to find your next career. ICF—together for tomorrow.\n\n\nICF is an equal opportunity employer that values diversity at all levels. (EOE – Minorities/Females/ Protected Veterans Status/Disability Status/Sexual Orientation/Gender Identity). For more information, please read our EEO & AA policy.\n\n*Reasonable Accommodations are available for disabled veterans and applicants with disabilities in all phases of the application and employment process. To request an accommodation please email* *icfcareercenter@icf.com* *and we will be happy to assist. All information you provide will be kept confidential and will be used only to the extent required to provide needed reasonable accommodations. Read more about non-discrimination:* EEO is the law *and* Pay Transparency Statement*.*\n\n**Working at ICF**\n\n\nICF is a global advisory and technology services provider, but we’re not your typical consultants. We combine unmatched expertise with cutting-edge technology to help clients solve their most complex challenges, navigate change, and shape the future.\nWe can only solve the world's toughest challenges by building an inclusive workplace that allows everyone to thrive. We are an equal opportunity employer, committed to hiring regardless of any protected characteristic, such as race, ethnicity, national origin, color, sex, gender identity/expression, sexual orientation, religion, age, disability status, or military/veteran status. Together, our employees are empowered to share their expertise and collaborate with others to achieve personal and professional goals. For more information, please read our EEO & AA policy.\n\n\nReasonable Accommodations are available, including, but not limited to, for disabled veterans, individuals with disabilities, and individuals with sincerely held religious beliefs, in all phases of the application and employment process. To request an accommodation please email Candidateaccommodation@icf.com and we will be happy to assist. All information you provide will be kept confidential and will be used only to the extent required to provide needed reasonable accommodations. Read more here: Requesting an Accommodation for the ICF interview process.\n\n\nRead more about workplace discrimination rights, the Pay Transparency Statement, or our benefit offerings which are included in the Transparency in (Benefits) Coverage Act.\n\n **Pay Range** - There are multiple factors that are considered in determining final pay for a position, including, but not limited to, relevant work experience, skills, certifications and competencies that align to the specified role, geographic location, education and certifications as well as contract provisions regarding labor categories that are specific to the position.\n\n\nThe pay range for this position based on full-time employment is:\n\n\n$84,533.00 - $143,706.00\nNationwide Remote Office (US99)"},{"_id":"6709d79b6ec29b27dacd9429","job_title":"Software Engineer II","company":"Conservice","job_location":"Logan, UT, US","job_description":"### **Overview**\n\n\n\nAs the Utility Experts, we partner with real estate owners and managers to optimize cash flow and conserve resources through our software-enabled utility management platform. We thrive on looking for ways to make improvements to processes, products and individual performance, accepting ownership for all positive and negative actions while recognizing actions have the potential to affect many others and striving to resolve all situations in a positive manner, sharing the successes and the challenges equally, and never being satisfied with the status quo and always looking for ways to reach beyond our goals.\n\n\n### **Responsibilities**\n\n\n\nAs a Software Engineer II, you will:\n\n\n* Developing medium to large websites, console applications, RESTful and GraphQL APIs using the Microsoft stack with C# and JavaScript.\n* Contributing to an agile project team consisting of Full Stack Developers, Technical Leads, Projects Managers, and Strategists to help understand and document client requirements, estimate work, develop new solutions, and enhance existing solutions.\n* Building and maintaining internal tools to streamline our development process, proactively react to issues and enhance productivity.\n* Understanding and collaborating on our development and coding best practices.\n* Actively participating in code reviews.\n* Building packages and deploying software to integration environments such as Microsoft Azure and Jenkins.\n\nRequirements:\n* 5+ years of experience developing web applications and RESTful APIs in C#, JavaScript, and Microsoft MVC.\n* 5+ years of experience with modern software design patterns, debugging and refactoring.\n* 3+ years of experience with JavaScript frameworks with React, Vue.js, or Angular. (React preferred)\n* Experience troubleshooting HTML, JavaScript, and CSS issues.\n* Experience resolving cross-browser compatibility issues.\n* Experience with MS SQL, Postgres as well as other databases like CouchDB, or MongoDB.\n* Experience with Visual Studio Tooling.\n* Experience with code versioning tools, such as Git or SVN.\n* Experience with continuous integration and automated build products like Jenkins or Azure DevOps.\n* Familiarity with Microsoft Azure or Amazon Web Services (AWS).\n\n### **A plus to have**\n\n\n* Experience with creating and maintaining RESTful micro services.\n* Experience with creating and maintaining GraphQL micro services.\n* Strong testing and quality assurance ethic.\n* Excellent verbal and written communication skills.\n* Ability to thrive in an independent environment.\n\n\n**Education & Experience**\n\n\n* Bachelor's degree (or close to graduating or equivalent work experience) in Software Engineering, Systems Engineering, Computer Science, Information Analysis or similar."},{"_id":"6709d79b6ec29b27dacd942a","job_title":"Senior HTML Frontend Developer","company":"PerkSpot","job_location":"Chicago, IL, US","job_description":"PerkSpot is searching for a **Senior HTML Frontend Developer** to join our Creative team! Founded in 2006, PerkSpot is dedicated to inspiring others to love where they work by providing exclusive access to the best discounts available - anywhere. We ensure employees see offers curated to their interests, allowing them to save on electronics, home goods, meal delivery, mortgages, travel, and all the other little—and big—things that will make life a bit easier.\n\n\nWe’re looking for a developer with strong attention to detail and a keen eye for design, capable of taking fully specced designs and translating them into pixel-perfect code. In this role, you’ll have the exciting opportunity to advance PerkSpot’s front-end experience by collaborating closely with creative, product, and marketing teams to deliver the very best user experiences. While embedded in the Creative team, you’ll have a strong dotted line to the Engineering team, allowing you to bridge design and development in a highly collaborative environment. You’ll also play a key role in implementing a refresh of our email communications and on-site CMS landing pages. If you thrive in a fast-paced, rewarding environment where you can see the immediate impact of your work, this is the perfect role for you!\n\n**What you’ll accomplish:**\n\n* Code, proof, test, and troubleshoot email and CMS HTML templates, both stand-alone and part of recurring campaigns\n* Collaborate closely with designers & copywriters to ensure creative, marketing & product initiatives are executed with excellence\n* Refresh our email communications and CMS landing pages\n* Participate in solutions for complex business and application requirements\n* Create new feature sets adhering to the established SDLC, with strong emphasis on Unit Testing and Release Procedures\n* Work on troubleshooting and correcting code defects\n* Participate in team meetings and collaborate in programming tasks with all engineers\n\n**What we’re looking for:**\n\n* 8-10 years of experience building email and/or CMS HTML templates\n* Bachelor's Degree in Engineering, Computer Science, or other advanced technical or science degree, or equivalent work experience\n* Coding experience using .NET, HTML, and other HTML development tools\n* **JavaScript Proficiency** – Experience with JavaScript/ES6+ to create dynamic, interactive elements and enhance user experiences, with a solid understanding of modern libraries or frameworks (e.g., React, Vue.js, or Angular)\n* **CSS/SCSS Expertise** – Mastery in styling, including responsive and adaptive design techniques\n* **HTML Email Best Practices** – Knowledge of how to ensure emails render properly across different clients (e.g., Outlook, Gmail) and mobile devices\n* **Cross-Browser Compatibility** – Knowledge of developing for multiple browsers and ensuring consistent behavior\n* **Accessibility (WCAG Compliance)** – Familiarity with accessibility standards and ensuring that all code adheres to WCAG guidelines\n* **CSS Frameworks (Bootstrap)** – Experience with CSS frameworks for speeding up UI development\n* **Email Campaign Tools** – Experience using Sailthru, SendGrid, Mailchimp, Marketo, or similar email campaign tools\n* **CMS Experience** – Experience in CMS preferred: WordPress, Umbraco, or similar CMS tools\n* **Agile Development** – Understanding of Agile processes and a focus on test-driven development\n* **Version Control Systems (Git)** – Experience in using Git or similar version control systems\n\n**About PerkSpot:**\n\n\nPerkSpot is the trusted employee discount platform that provides meaningful, personalized savings on the things that matter most. Our approach is simple, inspiring others to love where they work by offering the steepest, most intentional discounts on over 1,000 reputable brands. From local deals to big-name nationwide offerings, our 98% retention rate speaks for itself.\n\n\nWe are an established company with a strong foundation, growing consistently and steady. What does that mean for you? The opportunity to hit the ground running and see the impact of your work! As a leader in the industry, we’re committed to doing more - developing better products, reaching more employers, and getting more members engaged with our platform. Our passion is to make every place a great place to work, starting with our own.\n\n**Your first few months as a PerkSpotter:**\n\n\nProviding value doesn’t have to wait, from day one we are open to your big ideas. In your first few months, you will..\n\n\n* **Meet the team!** We think our people are pretty great so we want to ensure you’re introduced to all of the right team members to help you succeed. You’ll spend quite a bit of time with our team of Product Managers, Quality Assurance Analysts, UX Designers, Email Marketing, Operations, as well as with our Engineering team!\n* **Get to know PerkSpot!** Immerse yourself in the business, engage with internal stakeholders, and participate in monthly company-wide All Hands meetings.\n* **Sharpen your skills!** You will bring your expertise to support the development of next-level experiences for our users, while also gaining valuable experience collaborating with our email marketing and operations teams.\n* **See your impact!** Develop templates, designs, and processes that directly improve the user experience for our 20M+ members and driving revenue and growth for the company.\n* **Participate in company-wide events!** Whether it’s office miniature golf or a raffle gameshow, company culture is at the forefront of our business.\n\n**The perks and benefits:**\n\nWith a name like PerkSpot, it’s no secret that employee perks are kind of our thing. Below are a few of the many perks and benefits we offer to our people.\n\n\n* Comprehensive medical, dental, vision insurance effective on your first day of employment, and 100% employer-funded short-term & long-term disability insurance\n* Generous PTO policy & fully-paid parental leave\n* 401(k) with company match and free financial consulting from Mariner Financial\n* WFH flexibility and home-office expense budget for new hires\n* On-site gym access and bring your pet to work!\n* Access to our exclusive perks & discounts\n\n**How to apply:**\n\n\nAll applications will be kept strictly confidential. Please submit a resume and cover letter telling us how you stack up to the qualifications, plus any other information you feel would be relevant to PerkSpot. Don’t be afraid to show your spark and personality!\n\n\nAll positions require a full background screening.\n\n\nOffering a diverse, equitable, and inclusive culture is a priority at PerkSpot. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, or national origin, disability or protected veteran status, or any other legally protected basis, in accordance with applicable law.\n\n\n\n\nbFg6TekxeP"},{"_id":"6709d79b6ec29b27dacd942b","job_title":"Frontend Developer (WordPress + Elementor)","company":"Avintiv Media","job_location":"Remote, US","job_description":"Role: **Front-end Developer (for WordPress websites using Elementor + customization)**  \n***\\*Elementor experience required***\n\nAVINTIV  \nRemote Position\n\nPay: $25-35/hr\n\nAt AVINTIV, our mission is quite simple: to build and grow some of the most competitive and impactful businesses in the world, changing commerce as we know it. Our team has the experience, knowledge, and capabilities to create and build entire brands from the ground up that compete with some of the largest companies in the world. This valuable experience comes from our track record of building and growing over 400 successful brands, resulting in the generation of hundreds of millions of dollars in revenue for our esteemed clients.\n\nWe are single-handedly improving and evolving every industry that we touch by simply following our passion and pushing the status quo with every brand that we build and grow! At AVINTIV, our culture and team take precedence. While skills matter, we prioritize hiring individuals who align with our values and culture. After all, we’re also looking to have fun as we change the world at the same time.\n\n**Job role overview:**\n\nWe're actively seeking a dynamic and ambitious individual to join our team as a Front-end Developer. Our ideal candidate is a Front-End Web Developer who is passionate about blending design and programming. As a Front-End Developer, you'll be instrumental in crafting engaging and user-friendly experiences on the web. Your main focus will be on bringing the visual and interactive elements of websites to life. Collaborating closely with our UI/UX design team, you'll transform design concepts into polished, responsive code.\n\nYour proficiency in WordPress, Elementor, PHP, HTML, CSS, and JavaScript will be crucial in ensuring that our digital platforms not only have an appealing appearance but also deliver seamless functionality across different devices and browsers. Additionally, we value expertise in leveraging custom designs from tools like Adobe XD and Figma and creating custom themes within WordPress using Elementor Pro. If you're excited about the intersection of design and development and eager to contribute to creating exceptional online experiences, we want to hear from you!\n\n**Who should apply:**\n\nWe're seeking visionary individuals who are not just seeking a job but are eager to drive transformative change. If you're an experienced Front-end Developer with a proven track record, your expertise is invaluable to us. Attention to detail, adherence to timelines and budgets, and a commitment to meeting or exceeding company standards are essential traits for success in this role.\n\nCandidates should have advanced experience converting UI/UX design files into WordPress templates, building custom plugins, troubleshooting software bugs, and ensuring website security. We encourage you to apply if you thrive on overcoming challenges, enjoy tackling new projects, and possess the drive to deliver tangible results. This isn't just a job opportunity; it's an invitation for visionary professionals to help shape the future of global business growth and operations.\n\n**What you’ll do:**\n\n**Collaborate with Designers:** Work alongside UX/UI designers to translate design into a functional and engaging user experience.\n\n**Develop Websites:** Code responsive and user-friendly websites based on client specifications or approved UI/UX design files. This includes the creation or customization of WordPress template files and Elementor Pro templates.\n\n**Adhere to Development Standards and Best Practices:** Maintain high code quality that adheres to community standards for accessibility, CSS coding, PHP coding, HTML coding, JavaScript coding, and Semantic HTML5 standards using a consistent markdown style guide.\n\n**Implement SEO Best Practices:** Optimize website templates for SEO strategies and techniques outlined by our in-house SEO department.\n\n**Conduct Cross-Browser and Cross-Device Testing:** Create a consistent user experience across various platforms and devices.\n\n**Optimize Website Performance:** Code and test websites to adhere to Google’s PageSpeed Insights, Page Experience, and Core Web Vitals reporting standards.\n\n**Develop Custom WordPress Code:** Extend the platform’s functionality as necessary through custom development of WordPress custom post types, plugins, or REST API connections.\n\n**Manage Back-End Services and Database Configuration:** Oversee technical aspects of the CMS and server-side configurations for optimal performance.\n\n**Maintain WordPress Core and Plugin Software:** Regularly test and implement software updates related to WordPress core, plugins, or theme files.\n\n**Troubleshoot and Resolve Issues:** Address website bugs or problems related to themes, plugins, or hosting environments.\n\n**Stay Updated on WordPress Updates:** Research, learn and implement the latest WordPress software and coding updates.\n\n**Provide Technical Support and Training**: Offer support and training to clients or internal teams for managing and updating the WordPress CMS.\n\n**Maintain Comprehensive Documentation:** Document code, solutions, and methodologies for future reference or team member use.\n\n**Software and coding proficiencies (3-4 Years of Experience):**\n\n* Front-end programming software such as HTML, CSS, Bootstrap, JavaScript (vanilla JS, jQuery, ES6), Angular, and React\n* Back-end software such as PHP, Java, Python, Node.js, Ruby, Sass\n* MySQL database usage and optimization\n* Wp-CLI commands\n* REST API and GraphQL\n* WordPress core architecture\n* Gutenberg blocks\n* Popular page builders such as Elementor, Beaver Builder, or Divi\n* WooCommerce and other e-commerce extensions\n* WordPress multisite\n* Headless CMS and full site editing\n* Semantic HTML5 coding\n* Accessibility (WCAG 2.0+, WCAG 3, UAAG, ARIA, etc.)\n* SEO best practices\n* Design software such as Adobe Cloud, Photoshop, Illustrator, XD, AEM, and Figma\n* Version control software such as Gulp, Grant, Blaze meter, SVN, or GitHub\n\n**What you’ll bring:**\n\n* **Education and Experience:** Bachelor’s Degree in Computer Science or a related field, or 3+ years of proven experience as a mid-level Front-end Developer\n* **Wordpress Skills:** 3-4 years of experience of development experience with Wordpress, custom wordpress themes, plugin development, etc.\n* **Analytical Skills:** Strong analytical and problem-solving skills with the ability to interpret data and make data-driven managerial decisions.\n* **Communication Skills:** Excellent written and verbal communication skills with the ability to communicate effectively with both clients and internal teams.\n* **Organizational Skills:** Exceptional organizational and multitasking abilities with attention to detail in project planning and execution.\n* **Time management skills:** Be able to manage multiple projects and prioritize tasks to meet deadlines and achieve business objectives.\n* **Collaboration skills:** The ability to work in teams with strong collaboration and interpersonal skills to work effectively with colleagues, clients, and external partners.\n\n**What we offer:**\n\n* **Working Environment:** AVINTIV is 100% remote, where you can work from your kitchen or a sunny beach- whatever makes you happy\n* **Work Schedule:** Flexible working schedule\n* **Compensation:** At or above market salary with many opportunities for growth.\n* **PTO:** Generous time off, including holidays, vacation, sick, and personal time\n* **Growth:** Chance to be a part of a fast-growing company\n* **Culture:** 5-star Glass Door rated company with a friendly work environment\n\n**Why AVINTIV?**\n\nWith countless employment options currently available, you may be wondering, \"Why should I choose to work here?\" Firstly, our company was founded by an entrepreneur who, like you, sought to tackle a wide range of business challenges. As evidenced by our 5-star Glassdoor reviews, we genuinely care about our team and their future. Despite being a top-ranked U.S. agency, we remain a boutique firm, free from the corporate and political dramas that plague larger corporations. Our focus is on transforming our clients' lives, improving their customers' experiences, and enjoying the journey along the way. Over the last six years, we've seen year-over-year growth ranging from 30% to 200%, and we're continuously creating new opportunities for internal career advancement before seeking external candidates. You can be confident that by joining our team, you'll have endless prospects to progress your career.\n\nJob Types: Part-time, Contract\n\nPay: $25.00 - $35.00 per hour\n\nBenefits:\n\n* Flexible schedule\n* Paid time off\n\nCompensation Package:\n\n* Hourly pay\n\nSchedule:\n\n* Monday to Friday\n\nApplication Question(s):\n\n* How many years of experience do you have fixing website speed issues?\n* How many years of experience do you have working with Javascript and CSS?\n* How many years of experience do you have working in an agency setting?\n* Please share a link to your portfolio.\n* How many years of experience do you have as a Front-end Developer?\n* How many years experience do you have working with Elementor?\n* Do you have experience customizing widgets and elements within Elementor?\n* Please share an example of an Elementor based website you've fully built and launched.\n* How many years experiences of using pre-provided PSD/Figma/Adobe XD mockups and coding them into WordPress websites do you have?\n\nEducation:\n\n* Bachelor's (Preferred)\n\nWork Location: Remote"},{"_id":"6709d79b6ec29b27dacd942c","job_title":".NET Developer","company":"Fyin.com","job_location":"Denver, CO, US","job_description":"**Job Overview**\n\nSeeking an experienced full stack .NET Web Developer to work in a dynamic, fast-paced environment that provides growth and learning opportunities. The successful candidate will be a highly skilled professional who enjoys being challenged by new technologies and working with an energetic team of developers.\n\nUnder general supervision, with broad scope for the exercise of independent initiative and judgment, this developer is responsible for the system analysis, technical design, development, testing, enhancement, and maintenance of various applications that support FYIN's business functions. The selected candidate will be required to perform tasks related to the development of software applications, work with the Umbraco CMS, and data transformation activities for the Agency.\n\nThis position is in person in our Denver office.\n\n**Responsibilities**\n\n* Responsible for full software development life cycle, including user interface design, database development, back-end architecture, deployment and maintenance of the defined solution based on business and functional requirements.\n* Design, write, unit test, and document application code to successfully deliver secure, robust, transactional and service-oriented architectures.\n* Understand FYIN's strategic initiatives and develop technology solutions that deliver the required business value.\n* Understand complex business processes/applications with intent to re-write/enhance using current tools/technology.\n* Provide supporting documentation for all phases of development/implementation.\n* Develop technical specifications, including data flow diagrams.\n* Maintain data security and internal controls of environment to adequately protect Agency assets and records.\n* Work directly with FYIN's client-partners as needed.\n\n**Qualifications**\n\n* Strong demonstrable experience in systems architecture and N-tier application development using Microsoft’s web technology stack (ASP.NET MVC, C#, IIS 8, ADO.NET, Entity Framework, Web API).\n* Strong experience implementing standards-based front-end development (HTML5, XHTML, JavaScript, CSS).\n* Experience with scripting languages including JavaScript (intermediate to advanced level), jQuery and data exchange formats (XML, JSON) in a service-oriented or microservices architecture.\n* Experience with Responsive Web Design (RWD) patterns.\n* Ability to build/create/maintain application databases utilizing MS SQL Server.\n* Ability to work in a fast-paced environment, recognize and react to changing business needs and effectively prioritize tasks.\n* Must be self-motivated and able to work both independently and in conjunction with team members and business units. Enthusiasm and flexibility to work on a variety of projects are necessary, as well as the ability to rapidly acquire new domain familiarity.\n* Ability to meet deadlines, identify issues and resolve with minimal direction.\n* Ability to analyze, document and validate software requirements.\n* Experience with the Software Development Life Cycle Methodology (SDLC) and Agile development methodologies.\n* Experience reverse engineering legacy monolithic client-server applications and re-engineering and rewriting in segments in a loosely coupled service-oriented architecture.\n* Ability to speak and write clearly and succinctly in a variety of communication settings and styles.\n\n**Preferred Skills:**\n\n* ASP.NET CORE\n* C#, .NET, Visual Studio, VS Code, ASP.NET, II, .NET Core, Vue.js\n* Umbraco CMS\n* Web application development including JavaScript, JSON, AJAX.\n* MS SQL Server, T-SQL, Tables, Stored Procedures, Views\n* Entity Framework (EF) and other ORM's\n* Web Services/WCF/Web API experience\n* Experience in designing rich dynamic web applications using HTML5 features along with Responsive Design using CSS3\n\nIf you meet the above qualifications, please submit your resume and we will be in touch with next steps.\n\nJob Type: Full-time\n\nPay: $65,000.00 - $120,000.00 per year\n\nBenefits:\n\n* 401(k) matching\n* Dental insurance\n* Flexible schedule\n* Health insurance\n* Health savings account\n* Paid time off\n* Vision insurance\n\nSchedule:\n\n* 8 hour shift\n* Monday to Friday\n\nExperience:\n\n* .NET: 3 years (Required)\n\nAbility to Commute:\n\n* Denver, CO 80203 (Required)\n\nAbility to Relocate:\n\n* Denver, CO 80203: Relocate before starting work (Required)\n\nWork Location: In person"},{"_id":"6709d79b6ec29b27dacd942d","job_title":"Software Engineer, Core Platform","company":"ServiceNow","job_location":"San Diego, CA, US","job_description":"**Company Description**  \n\nIt all started in sunny San Diego, California in 2004 when a visionary engineer, Fred Luddy, saw the potential to transform how we work. Fast forward to today — ServiceNow stands as a global market leader, bringing innovative AI-enhanced technology to over 8,100 customers, including 85% of the Fortune 500®. Our intelligent cloud-based platform seamlessly connects people, systems, and processes to empower organizations to find smarter, faster, and better ways to work. But this is just the beginning of our journey. Join us as we pursue our purpose to make the world work better for everyone.\n\n **Job Description** **What you get to do in this role:**\n\n\n* Build high-quality, clean, scalable and reusable code by enforcing best practices around software engineering architecture and processes (Code Reviews, Unit testing, etc.)\n* Work with the product owners to understand detailed requirements and own your code from design, implementation, test automation and delivery of high-quality product to our users.\n* Design software that is simple to use to allow customers to extend and customize the functionality to meet their specific needs\n* Help design and implement new products and features while also enhancing the existing product suite\n  \n\n  \n\n  \n\n**Qualifications** **To be successful in this role you have:**\n\n\n* 0-2+ years of experience with Java or a similar OO language\n* Passion for JavaScript and the Web as a platform, reusability, and componentization\n* Experience with data structures, algorithms, object-oriented design, design patterns, and performance/scale considerations\n* Experience with any of the modern UI frameworks like Angular, React or Vue\n* Analytical and design skills\n* Working knowledge and ability to use tools to assist with daily tasks (IDE, debugger, build tools, source control, ServiceNow instances, profilers, system administration/Unix tools)\n\n  \n\nFD21\n\n*Not sure if you meet every qualification? We still encourage you to apply! We value inclusivity, welcoming candidates from diverse backgrounds, including non-traditional paths. Unique experiences enrich our team, and the willingness to dream big makes you an exceptional candidate!*\n\n\nFor positions in this location, we offer a base pay of $109,400 - $169,600, plus equity (when applicable), variable/incentive compensation and benefits. Sales positions generally offer a competitive On Target Earnings (OTE) incentive compensation structure. Please note that the base pay shown is a guideline, and individual total compensation will vary based on factors such as qualifications, skill level, competencies, and work location. We also offer health plans, including flexible spending accounts, a 401(k) Plan with company match, ESPP, matching donations, a flexible time away plan and family leave programs. Compensation is based on the geographic location in which the role is located and is subject to change based on work location.\n\n **Additional Information** **Work Personas**\n\n\nWe approach our distributed world of work with flexibility and trust. Work personas (flexible, remote, or required in office) are categories that are assigned to ServiceNow employees depending on the nature of their work. Learn more here.\n\n\n**Equal Opportunity Employer**\n\n\nServiceNow is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, creed, religion, sex, sexual orientation, national origin or nationality, ancestry, age, disability, gender identity or expression, marital status, veteran status, or any other category protected by law. In addition, all qualified applicants with arrest or conviction records will be considered for employment in accordance with legal requirements.\n\n\n**Accommodations**\n\n\nWe strive to create an accessible and inclusive experience for all candidates. If you require a reasonable accommodation to complete any part of the application process, or are unable to use this online application and need an alternative method to apply, please contact talent.acquisition@servicenow.com for assistance.\n\n\n**Export Control Regulations**\n\n\nFor positions requiring access to controlled technology subject to export control regulations, including the U.S. Export Administration Regulations (EAR), ServiceNow may be required to obtain export control approval from government authorities for certain individuals. All employment is contingent upon ServiceNow obtaining any export license or other approval that may be required by relevant export control authorities.\n\n\nFrom Fortune. ©2024 Fortune Media IP Limited. All rights reserved. Used under license."},{"_id":"6709d79b6ec29b27dacd942e","job_title":"Staff Software Engineer - AI Incubation","company":"Ironclad","job_location":"San Francisco, CA, US","job_description":"Location\n\n\nSan Francisco, CA, Remote, New York, NY\nType\n\n\nFull time\nDepartment\n\n\nEngineering, Product & Design\nCompensation\n\n\nTier 1\nBase Salary Range: $190K – $210K • Offers Equity\n\n\n\nThe base salary range represents the minimum and maximum of the salary range for this position based at our San Francisco headquarters. The actual base salary offered for this position will depend on numerous factors, including individual proficiency, anticipated performance, and the location of the selected candidate. Our base salary is just one component of Ironclad’s competitive total rewards package, which also includes equity awards (a new hire grant, along with opportunities for additional awards throughout your tenure), competitive health and wellness benefits, and a commitment to career growth and development.\n  \nIronclad is the #1 contract lifecycle management platform for innovative companies. Every company, in every country, in every industry runs on contracts, but managing these contracts slows companies down and costs them millions of dollars. L’Oréal, Staples, Mastercard, and other leading innovators use Ironclad to collaborate and negotiate on contracts, accelerate contracting while maintaining compliance, and turn contracts into critical carriers of operational business intelligence. It’s the only platform flexible enough to handle every type of contract workflow, whether a sales agreement, an HR agreement or a complex NDA.  \n\nIronclad is writing the narrative that shows how beautiful and functional contracting will change business. We’re a leader in the Forrester Wave for Contract Lifecycle Management. We have been recognized as a Fortune Great Place to Work for four consecutive years. Our innovation and work culture have been recognized by Glassdoor's Best Places to Work 2023, Forbes’ 50 Most Promising AI Companies, Wing Venture Capital's Enterprise Tech 30, and Gartner's Magic Quadrant. We work in a highly collaborative environment, and strive to foster a positive, inclusive culture. We’re backed by leading investors like Accel, Y Combinator, Sequoia, and BOND. For more information, visit www.ironcladapp.com or follow us on LinkedIn and Twitter.\n\n **Engineering @ Ironclad**\n\n\nAs a Staff Software Engineer at Ironclad on the AI Incubation team, you'll work cross-functionally to identify business problems and architect, build, and verify solutions. You'll build a platform that lets lawyers scale themselves and their businesses 100x more effectively. At Ironclad, we’ve built a product that brings a two thousand year old profession into the digital age, and you’ll play a pivotal role in driving the foundation forward.\n\n\nWe seek experienced engineers with strong coding fundamentals and a track record of shipping high quality products. We work in a highly collaborative environment, and strive to foster a positive, inclusive culture and offer remote work flexibility. If you’d like to join us on our mission to build the product that legal teams love, let’s talk!\n\n**What you'll do:**\n\n* Collaborate cross functionally with product managers, designers, and other engineers to spec, design, and build features and systems\n* Partner with quality engineers to define, build and maintain testing strategy\n* Lead technical discussions, mentor and provide thoughtful feedback to other engineers on the team\n* Grow your teams by interviewing and recruiting talented engineers to Ironclad\n* Designing and building data-intensive solutions that helps Ironclad to scale\n* Work on a modern stack built upon: TypeScript, ReactJS, Node.js, Java, and Docker containers in Kubernetes on Google Cloud Platform (experience with these specific technologies not required)\n\n**What we look for:**\n\n* At least 5+ years of software experience architecting, building, launching and maintaining complex systems (a formal degree is not required, we are prioritizing industry experience)\n* Leadership across teams and a drive towards improving overall technical architecture and achieving company-wide goals\n* Passion for software engineering to build and ship great product\n* Hands-on experience shipping valuable products to production with real user feedback\n* A high bar for quality\n* Strong cross-team communication and collaboration skills\n* Strong software engineering fundamentals: modularity, abstraction, data structures, and algorithms\n* Optional experience in taking products from 0 to 1\n* Optional experience in building products powered by GenAI or ML\n* Optional experience in prompt engineering\n* Ironclad’s Values: drive, intent, integrity, and empathy\n\n **Benefits:**\n\n* Health, dental, and vision insurance\n* 401k\n* Wellness reimbursement\n* Take what you need vacation policy\n* Generous parental leave for both primary and secondary caregivers\n\n**Base Salary Range: $190,000 - $210,000**\n\n\nThe base salary range represents the minimum and maximum of the salary range for this position based at our San Francisco headquarters. The actual base salary offered for this position will depend on numerous factors, including individual proficiency, anticipated performance, and the location of the selected candidate. Our base salary is just one component of Ironclad’s competitive total rewards package, which also includes equity awards (a new hire grant, along with opportunities for additional awards throughout your tenure), competitive health and wellness benefits, and a commitment to career growth and development.\n\n\nPursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records."},{"_id":"6709d79b6ec29b27dacd942f","job_title":"Jr. Software Developer","company":"EKC Enterprises, Inc.","job_location":"Fresno, CA, US","job_description":"**Job Title:** \n\nJr Software Developer\n\n**Location:**\n\nIn-Person, Fresno, CA\n\n**Job Type:** (Full -Time)\n\n**About Us:**\n\nAre you looking for a full-time job while you pursue a degree in a stem-field? Would you like to gain experience while you are paid?\n\nAt EKC Enterprises, we believe in building relationships rooted in integrity, accountability, and excellence. Our mission is to consistently exceed expectations, ensuring that our clients continuously choose us for their low-voltage solutions. Specializing in the design, reselling, installation, and integration of cutting-edge low-voltage products, technologies, and services, we collaborate with industry-leading manufacturers and partners to bring you unparalleled results. Experience our commitment to quality and let us help you achieve success with our comprehensive low-voltage solutions.\n\n**Responsibilities:**\n\n- Assist in designing, coding, and testing software applications (QA/QC).\n\n- Develop, Design, and Debug company applications.\n\n- Work with APIs to enhance connectivity between company applications.\n\n- Collaborate with the development team to maintain and improve existing applications.\n\n- Participate in code reviews, debugging, and documentation.\n\n- Work on front-end development with JavaScript and React.\n\n- Work with version control systems (e.g., Git) to track code changes.\n\n- Participate in team meetings and contribute to the development process.\n\n**Requirements:**\n\n- Currently pursuing a degree in Computer Science, Software Engineering, or a related field.\n\n- Solid understanding of at least one object-oriented programming language.\n\n- Basic knowledge of JavaScript, HTML, and CSS or willingness to learn.\n\n- Familiarity with React or willingness to learn.\n\n- Strong problem-solving skills and attention to detail.\n\n- Ability to work both independently and within a team.\n\n- Good communication skills and a positive attitude.\n\n**Nice To Haves:**\n\n- Experience working with React and modern JavaScript frameworks (can be professional or personal projects).\n\n- Understanding of version control systems like Git.\n\n- Familiarity with modern development tools and processes (e.g., npm, yarn, CI/CD).\n\n**What We Offer:**\n\n- Hands-on learning experience with modern development tools and technologies.\n\n- Mentorship from experienced developers.\n\n- A collaborative and dynamic work environment.\n\n- Experience in the software development field\n\n- Flexibility between work and school\n\n- Weekends off\n\nJob Type: Full-time\n\nPay: $18.00 - $27.00 per hour\n\nExpected hours: 40 per week\n\nBenefits:\n\n* Flexible schedule\n\nSchedule:\n\n* 8 hour shift\n* Monday to Friday\n* No weekends\n\nAbility to Commute:\n\n* Fresno, CA 93703 (Required)\n\nWork Location: In person"},{"_id":"6709d79b6ec29b27dacd9430","job_title":"Automations & Controls Engineer","company":"Tetra Tech","job_location":"San Diego, CA, US","job_description":"Discover your full potential. At Tetra Tech, we collaborate with industry-leading experts for a sustainable future for our world. We combine consulting and engineering with advanced analytics and technology to solve the world’s most complex challenges. Our global innovation hubs will enable you to share ideas and best practices while growing your professional network. Wherever you are in your career journey, you will benefit from working with world-class engineers, scientists, and technical specialists.\n\n  \n\n\n\nApply today and join the company that is **Leading with Science®.**\n\n  \n\n\n\nWe currently have an opening for an **Automation Engineer** to join our successful Digital Water team. The position is based in the Bay Area region and will support Tetra Tech’s municipal and industrial water and wastewater market. The selected candidate shall experience a unique opportunity to be involved with SCADA projects located in various areas of the country. working with a team of in-house experts in all disciplines.\n\n  \n\n\n**Your Role:**\n\n\n* Responsible for PLC and HMI programming;\n* Participate in Simulation and testing, and provide startup assistance;\n* Assist in the development of company programming standards and templates;\n\n  \n\n\n**Qualifications:**\n\n\n* Bachelor’s Degree in an engineering discipline or related technical degree is preferred;\n* 0-2 years of related automation/controls experience with HMI’s, PLC’s and general SCADA integration;\n* Experience with Allen-Bradley (RSLogix 5000 PLC software), Industrial Communication Networks (Ethernet, ControlNet, DeviceNet etc.) is a plus;\n* Siemens Step 7 (TIA Portal) is a plus;\n* Knowledge of any of the following HMI software platforms is a plus;\n+ Wonderware InTouch & System Platform;\n+ Rockwell FactoryTalk View (SE and ME);\n+ GE iFIX;\n+ VTScada;\n+ Ignition by Inductive Automation;\n\nSalary: $85,500 - 105,000 depending on experience\n\n\n**A****bout Tetra Tech**  \n\n\nTetra Tech combines the resources of a global, multibillion-dollar company with local, client-focused delivery in more than **550** locations around the world. Our reputation rests on the technical expertise and dedication of our employees — **28****,000** associates working together to provide smart, scalable solutions for challenging projects. We are proud to be home to leading technical experts in water, environment, infrastructure, resource management, energy, and international development.  \n\n\nTetra Tech offers comprehensive benefit options that allow employees to design a plan based on individual needs and assist in planning for long-term financial security. Available benefits include health insurance, term life, disability, accidental death & dismemberment coverage, time off with pay (TOWP), 401k, and an Employee Stock Purchase Plan.  \n\n\nAt Tetra Tech, health and safety play a vital role in our success. Tetra Tech’s employees work together to comply with all applicable health & safety practices and protocols, including health orders and regulations related to COVID-19 that are mandated by local, state, and federal authorities.  \n\n\nExplore our open positions at https://www.tetratech.com/careers. Follow us on social media to learn more about our people, culture, and opportunities:  \n\n\n* **Linked****I****n: @TetraTechCareers**\n* **Twitter: @TetraTechJobs**\n* **Facebook: @TetraTechCareers**\n  \n\n\n**Tetra Tech** is proud to be an Equal Opportunity Employer. Diversity, inclusion, and equity are among Tetra Tech’s core values. Throughout our history, the company has prioritized the equitable inclusion of all people. All qualified candidates will be considered without regard to race, color, religion, national origin, military or veteran status, gender, age, disabilities, sexual orientation, gender identity, pregnancy and pregnancy-related conditions, genetic information, and any other characteristics protected by the law. We invite resumes from all interested parties. Please visit our website at www.tetratech.com to see the array of diverse services and exciting projects we are currently working on.  \n\n\nTetra Tech is a VEVRAA federal contractor, and we request priority referral of veterans for available positions.  \n\n\nWe thank all applicants for their interest, however, only those candidates selected for interviews will be contacted. Please no phone calls or agencies."},{"_id":"6709d79b6ec29b27dacd9431","job_title":"iOS Developer","company":"Zion Zest LLC","job_location":"Dallas, TX, US","job_description":"**Job Summary**  \nWe are seeking a skilled iOS Developer to join our dynamic team. The ideal candidate will have a strong background in application development and a passion for creating innovative mobile solutions. You will be responsible for designing, developing, and maintaining iOS applications that enhance user experience and meet business objectives.\n\n**Duties**\n\n* Design and implement user-friendly iOS applications using Swift and Objective-C.\n* Collaborate with cross-functional teams to define, design, and ship new features.\n* Maintain code quality through unit testing and code reviews.\n* Utilize GitHub for version control and collaboration on projects.\n* Implement MVC architecture to ensure efficient application structure.\n* Integrate third-party libraries and APIs as needed.\n* Participate in continuous integration processes using tools like Jenkins.\n* Troubleshoot and debug applications to optimize performance.\n* Stay updated with the latest industry trends and technologies to ensure best practices in application development.\n\n**Requirements**\n\n* Proficiency in Swift and Objective-C programming languages.\n* Experience with GitHub for version control.\n* Strong understanding of MVC design patterns.\n* Familiarity with JavaScript and XML for application development.\n* Knowledge of computer networking concepts relevant to mobile applications.\n* Experience with continuous integration practices is a plus.\n* Ability to work collaboratively in a team environment.\n* Excellent problem-solving skills and attention to detail.\n* Strong communication skills, both verbal and written.\n\nJoin us in shaping the future of mobile technology by applying your expertise as an iOS Developer!\n\nJob Types: Full-time, Contract\n\nPay: $100,000.00 - $105,000.00 per year\n\nBenefits:\n\n* 401(k)\n* Dental insurance\n* Health insurance\n\nSchedule:\n\n* 8 hour shift\n\nExperience:\n\n* Application development: 3 years (Required)\n* Objective-C: 1 year (Required)\n\nAbility to Commute:\n\n* Dallas, TX 75202 (Required)\n\nAbility to Relocate:\n\n* Dallas, TX 75202: Relocate before starting work (Required)\n\nWork Location: In person"},{"_id":"6709d79b6ec29b27dacd9432","job_title":"Python Developer","company":"TechnoKraft","job_location":"New York, NY, US","job_description":"**Job Title : Python Developer**\n\n**BNYM**\n\n**Location :New York, New jersey**\n\n**Fulltime and Contract**\n\n**$130k/annum and $75 /hr on C2C**\n\nNeed Python developer with scripting language bash or Powershell.\n\nAutomation experience is must.\n\nIf candidate has IAM exp that should be fine\n\nJob Types: Full-time, Contract\n\nPay: $125,000.00 - $130,000.00 per year\n\nBenefits:\n\n* 401(k)\n* Dental insurance\n* Health insurance\n\nSchedule:\n\n* 8 hour shift\n\nExperience:\n\n* PowerShell: 1 year (Required)\n* IAM: 1 year (Required)\n\nWork Location: In person"},{"_id":"6709d79b6ec29b27dacd9433","job_title":"OPS SYSTEMS PROGRAMMER I","company":"State of Florida","job_location":"Tallahassee, FL, US","job_description":"Requisition No: 839157\n\n\nAgency: Elder Affairs\n\n\nWorking Title: OPS SYSTEMS PROGRAMMER I - 65650005\n\n\n Pay Plan: Temp\n\n\nPosition Number: 65650005\n\n\nSalary: $17.50-$23.00 HOURLY\n\n\nPosting Closing Date: 10/25/2024\n\n\n**Total Compensation Estimator** **Tool**\n\n\n**DEPARTMENT OF ELDER AFFAIRS**\n\n\n**BUREAU INFORMATION TECHNOLOGY**\n\n  \n\n\n**\\*\\*\\*\\*\\*OPEN COMPETITIVE\\*\\*\\*\\*\\***\n\n  \n\n\n**ATTENTION CANDIDATES**\n\n  \n\n\n**Candidate Profile (application) must be complete in its entirety.**\n\n\n* Include supervisor names and phone numbers of all periods of employment.\n* Account for and explain any gaps in employment so that the hiring process is not delayed. Gaps of employment for 3 months or more **MUST** be addressed on application.\n* Experience, education, training, knowledge, skills, and/or abilities as well as responses to pre-qualifying questions must be verifiable to meet the minimum qualifications.\n* It is unacceptable to use the statement “See Resume” in place of entering work history.\n* Periods of employment should be entered with the most recent/current listed first.\n* If you are a retiree of the Florida Retirement System (FRS), please contact the FRS to determine if your current benefits may be affected if you are reemployed with the State of Florida in an FRS-covered position. Your current retirement benefits may be canceled, suspended, or deemed invalid depending upon the date of your retirement.\n* If claiming Veteran’s Preference, candidates **MUST** attach supporting documentation (DD214).\n* If claiming Right to First Interview, candidates **MUST** attach a copy of your official layoff letter when applying.\n* **All documentation is due by the close of the vacancy announcement.**\n\n\n**If you experience problems applying online, please call the People First Service Center at (877) 562-7287.**\n\n  \n\n\n**PAPER APPLICATIONS WILL NOT BE ACCEPTED BY THE AGENCY. APPLICATIONS MUST BE SUBMITTED THROUGH THE PEOPLE FIRST SYSTEM.**\n\n  \n\n\n**Mission Statement:** To promote the well-being, safety, and independence of Florida’s elders, their families, and caregivers.\n\n\n**Vision Statement:** For all Floridians to live well and age well.\n\n  \n\n\nWe are seeking an enthusiastic individual with a desire to share our Agency’s mission to promote the well-being, safety, and independence of Florida's seniors, their families, and caregivers, and the vision for all Floridians to live well and age well. If you have good judgment, a desire to enrich the lives of others, and share our mission and vision, please consider joining our team.\n\n  \n\n\n**WHERE YOU WILL WORK****:**\n\n\nThe Department of Elder Affairs is in the Southwood Office complex in Tallahassee, Florida’s Capital City. Lined with rolling hills, oak trees, and canopied roads Tallahassee combines traditional charm with a modern pace of life. Home to two major universities, Tallahassee has a vibrant art and music scene, stately gardens, as well as a vast number of nature trails for those who love the outdoors. Tallahassee is a highly desirable location for both those seeking their first job and those ready to enter the next exciting chapter in their career. Also, with no state income tax, Florida is a great place to work regardless of where you are on the career ladder. For more information about Tallahassee, please visit: https://www.talchamber.com/visit-tallahassee/.\n\n  \n\n\n**BENEFITS OF WORKING FOR THE STATE OF FLORIDA****:**\n\n\nWorking for the State of Florida is more than a paycheck. The State’s total compensation package for employees features a highly competitive employee benefits including:\n\n\n* Participation in state group insurance (must meet eligibility requirements\\*). For more details consult with People First at 877-562-7287 or go to: https://www.mybenefits.myflorida.com/health/eligibility\\_and\\_enrollment/ops\\_employees\n* Participation in the Florida Deferred Compensation Plan (457b). (For additional details and online enrollment visit MyFloridaDeferredComp.com)\n* State of Florida 401(a) FICA Alternative Plan (tax deferred Retirement Savings Plan). (For more information, please click Social Security Alternative Plan (aigrs.com) and read OPS Social Security Alternative Plan)\n* Flexible Spending Accounts\n\n\n* **Seasonal and part-time OPS employees (less than 30 hours average per week) refer to the links above for detailed eligibility requirements.**\n\n  \n\n\n**DUTIES AND RESPONSIBILITIES:**\n\n\n* Works with team leader and program owners for understanding of the functional and system requirements;\n* Work as a member of a small, multifunctional technical team;\n* Gather requirements for business processes;\n* Develop and design new applications in Microsoft Power Platform/Dynamics 365;\n* Maintain existing applications by identifying and correcting software defects;\n* Enhance existing systems by analyzing business objectives, preparing an action plan, and identifying areas for modification and improvement;\n* Modify applications based on functional and system requirements;\n* Continuing education by investigating and developing skills in new technologies;\n* Document current and future processes that impact technology operations and services. Share created documentation to a central repository for use by other members of Information Systems;\n* Suggest procedural changes – if applicable- to improve operations specific to Information Systems;\n* Continuously evaluate and improve efficiency of technology resources;\n* Perform related work as required.\n\n  \n\n\n\n\n**KNOWLEDGE, SKILLS & ABILITIES REQUIRED:**\n\n\n* Basic understanding of applications;\n* Knowledge of Power Platform (Power BI, Power Automate, Power Pages) preferred;\n* Knowledge of Office 365 (MS Teams and SharePoint preferred);\n* Knowledge of Front End, Java Script, HTML, and CSS;\n* Knowledge of Back End Azure, SQL Data Storage and Retrieval, Store Procedures, Batch Jobs, and PowerShell;\n* Willingness to learn;\n* Strong written and verbal communication skills;\n* Ability to establish and maintain effective working relationships with others;\n* Ability to plan, organize, and coordinate work assignments;\n* Strong critical thinking and research skills;\n* Ability to solve technical problems quickly and completely;\n* Ability to prioritize tasks and service requests;\n* Computer Science degree, web development, or applications development degree preferred.\n\n  \n\n\n\n\n**SPECIAL NOTES:**\n\n\n**Preference will be given to the Department of Elder Affairs employees.**\n\n  \n\n\n**BACKGROUND CHECKS:**\n\n\nA Successful completion of a Level 2 Criminal History Background Check is required for all applicants selected for this position.\n\n  \n\n\n**APPLICANT INFORMATION:**\n\n\n**Applicants should apply on-line via the People First Website** **https://peoplefirst.myflorida.com****by 11:59 p.m. (EST) on the closing date of the position vacancy advertisement but are strongly encouraged to apply by 6:00 p.m. on the closing date to avoid any system down times or any other complications that may arise.**\n\n  \n\n\nIf you have problems applying on-line, call the **People First Service Center** at **1-877-562-7287**. Paper applications will not be accepted by the agency.\n\n  \n\n\nThe Department of Elder Affairs is an \"older worker-friendly\" employer and also lists vacancies on the Silver Edition website, found at http://silver.employflorida.com, that connects persons age 50 and older with other businesses/volunteer organizations/employers who specify they are \"older worker-friendly.\"\n\n  \n\n\nThe Department of Elder Affairs is an E-Verify employer and will provide the Social Security Administration (SSA) and, if necessary, the Department of Homeland Security (DHS), with information from each New Employee’s I-9 Form to confirm work eligibility.\n\n\n\nThe State of Florida is an Equal Opportunity Employer/Affirmative Action Employer, and does not tolerate discrimination or violence in the workplace.\n\n\nCandidates requiring a reasonable accommodation, as defined by the Americans with Disabilities Act, must notify the agency hiring authority and/or People First Service Center (1-866-663-4735). Notification to the hiring authority must be made in advance to allow sufficient time to provide the accommodation.\n\n\nThe State of Florida supports a Drug-Free workplace. All employees are subject to reasonable suspicion drug testing in accordance with Section 112.0455, F.S., Drug-Free Workplace Act."},{"_id":"6709d79b6ec29b27dacd9434","job_title":"Staff Data Platform Software Engineer - RaptorDB","company":"ServiceNow","job_location":"Kirkland, WA, US","job_description":"**Company Description**  \n\nIt all started in sunny San Diego, California in 2004 when a visionary engineer, Fred Luddy, saw the potential to transform how we work. Fast forward to today — ServiceNow stands as a global market leader, bringing innovative AI-enhanced technology to over 8,100 customers, including 85% of the Fortune 500®. Our intelligent cloud-based platform seamlessly connects people, systems, and processes to empower organizations to find smarter, faster, and better ways to work. But this is just the beginning of our journey. Join us as we pursue our purpose to make the world work better for everyone.\n\n **Job Description** **Team:**\n\n\nDatabase Provisioning builds the tools that safely operate and manage the databases running within ServiceNow data centers.\n\n\nThe CLI interface tools that we create are used by internal operations and support teams and by every automation running in a ServiceNow data center. As a team, our challenge is to deliver high-quality solutions that operate reliably without interruption at a massive scale. Our work is fundamental to ServiceNow’s reliability, reputation, and success.\n\n\nAs a team, we believe that ease of use, quality, scale, and customer feedback are the pillars of our development process. We work within a very collaborative environment with distributed teams that empower you to be successful in your work.\n\n**What you get to do in this role:**\n\n* Design software for operating PostgreSQL databases in production that is simple to use and integrates at scale.\n* Work with stakeholders to understand detailed requirements.\n* Build high-quality, clean, scalable, and reusable code by enforcing best practices around software engineering architecture, testing, and processes (Code Reviews, Unit testing, etc.)\n* Work with a team that owns the technological choices and their code from design, implementation, test automation, and delivery of high-quality features.\n* Work in an environment with a strong collaboration and knowledge-sharing spirit.\n* Work in an international team with colleagues in Europe and the USA.\n\n**To be successful in this role you have:**\n\n* Expertise in managing and operating databases in production, particularly PostgreSQL, MySQL, MariaDB, or Oracle.\n* Experience with data structures, algorithms, object-oriented design, design patterns, and performance/scale considerations.\n* Experience in collaborating and negotiating with senior technical stakeholders to discover and understand complex requirements for a task or problem.\n* Linux experience that includes a deep knowledge and understanding of its internals.\n* Excellent technical problem-solving skills, including root cause analysis of issues in production.\n* Experience in these languages & tools: Ruby, Puppet, Jenkins.\n* Experience with CI/CD systems: Jenkins, TeamCity, etc.\n* Enjoy collaborating with engineering teams located in different time zones (PT, ET, CET)\n* Great analytical and design skills.\n* Excellent communication, networking, and self-management skills.\n\n  \n\n**Qualifications**  \n\n* 6+ years of hands-on experience with backend development\n* Experience in Linux: CentOS, RedHat, etc.\n* Some experience with: Ruby, Puppet, Python, or Go.\n* Database experience, particularly with PostgreSQL, MySQL, MariaDB, or Oracle\n\n  \n\nWJ24\n\n*Not sure if you meet every qualification? We still encourage you to apply! We value inclusivity, welcoming candidates from diverse backgrounds, including non-traditional paths. Unique experiences enrich our team, and the willingness to dream big makes you an exceptional candidate!*\n\n\nFor positions in this location, we offer a base pay of $149,200 - $261,200, plus equity (when applicable), variable/incentive compensation and benefits. Sales positions generally offer a competitive On Target Earnings (OTE) incentive compensation structure. Please note that the base pay shown is a guideline, and individual total compensation will vary based on factors such as qualifications, skill level, competencies, and work location. We also offer health plans, including flexible spending accounts, a 401(k) Plan with company match, ESPP, matching donations, a flexible time away plan and family leave programs. Compensation is based on the geographic location in which the role is located and is subject to change based on work location.\n\n **Additional Information** **Work Personas**\n\n\nWe approach our distributed world of work with flexibility and trust. Work personas (flexible, remote, or required in office) are categories that are assigned to ServiceNow employees depending on the nature of their work. Learn more here.\n\n**Equal Opportunity Employer**\n\n\nServiceNow is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, creed, religion, sex, sexual orientation, national origin or nationality, ancestry, age, disability, gender identity or expression, marital status, veteran status, or any other category protected by law. In addition, all qualified applicants with arrest or conviction records will be considered for employment in accordance with legal requirements.\n\n**Accommodations**\n\n\nWe strive to create an accessible and inclusive experience for all candidates. If you require a reasonable accommodation to complete any part of the application process, or are unable to use this online application and need an alternative method to apply, please contact talent.acquisition@servicenow.com for assistance.\n\n**Export Control Regulations**\n\n\nFor positions requiring access to controlled technology subject to export control regulations, including the U.S. Export Administration Regulations (EAR), ServiceNow may be required to obtain export control approval from government authorities for certain individuals. All employment is contingent upon ServiceNow obtaining any export license or other approval that may be required by relevant export control authorities.\n\n\nFrom Fortune. ©2024 Fortune Media IP Limited. All rights reserved. Used under license."},{"_id":"6709d79b6ec29b27dacd9435","job_title":"Release Manager, Business Process Engineering","company":"Novocure","job_location":"Wayne, PA, US","job_description":"Location:\nWayne, PA, US, 19087 Philadelphia, PA, US, 19104 Portsmouth, NH, US, 03801 Boston, MA, US, 02114\nDescription:\nThe **Release Manager** will be responsible for orchestrating the planning, scheduling, and controlling of releases across the enterprise for various deployment stages and environments while enabling ITIL (Information Technology Infrastructure Library) leading practices where applicable. This role serves as a gatekeeper by ensuring the integrity of the release and environments are protected, and that the correct components are being released. Releases include, but are not limited to, new application deployments, application updates, operating system updates, and security improvements.\n\n  \n\n\nDevelopment of processes for the release management lifecycle and progression of code releases in various environments is part of the role. The Release Manager will work collaboratively with IT delivery teams, management, and business to define the most efficient and least impactful release cadence. The Release Manager understands that balancing the need for timely software delivery with the necessity for stability and security is pivotal.\n\n  \n\nThis is a full-time, exempt position located in our Portsmouth, NH or Chesterbrook, PA offices (remote employee acceptable) reporting to the Sr. Portfolio Manager.\n\n  \n\n**ESSENTIAL DUTIES AND RESPONSIBILITIES:**\n\n\n* Defines and owns the release calendar,\n* Plans the release cadence, windows, and cycles across all portfolios, including overseeing release plans, dependencies, risks, and contingencies\n* Negotiates release activities,\n* Measures and monitors release progress to ensure integrity and delivery,\n* Coordinates release content and effort based off the IT Project Roadmap, Change Requests, operating system updates, and third-party applications, including managing the governance of the change control process, including Change Advisory Board leadership,\n* Conducts release review meetings,\n* Gatekeeps and coordinates Go/No Go activities and approvals,\n* Develops deployment plans and checklists in coordination with the Portfolio team,\n* Manages risks and resolves challenges that impact release quality, scope, and schedule,\n* Escalates issues, constraints, and risks in a timely manner to management,\n* Communicates release plans and changes,\n* Validates release notes,\n* Develops release management processes and lifecycle in a manner of continuous improvement, leveraging ITIL leading practices and industry standards.\n\n  \n\n\n**QUALIFICATIONS/KNOWLEDGE:**\n\n* H.S Diploma or bachelor’s degree in computer science or related field,\n* 6+ years of experience in highly respected technology, biotech, consulting, or related firms,\n* Excellent written and oral presentation skills,\n* Excellent analytical skills,\n* Ability to plan and negotiate release activities,\n* Experience in cross-functional communication and teamwork,\n* Experience in managing release trains preferred,\n* Medical technology, specialty pharmaceutical, or durable medical equipment experience preferred,\n* Strong understanding of ITIL principles and practices,\n* Experience with agile, scrum, and modern software development tools such as AzureDevOps, Atlassian/JIRA, and ServiceNow a plus,\n* Multi-national corporate knowledge preferred.\n\n  \n\n\n\n\n**OTHER:**\n\n* Travel up to 40%\n* Ability to lift up to 20 pounds\n\n  \n\n\n\n\nNovocure considers a range of factors, including background and experience, when determining base compensation. These considerations mean actual compensation will vary.\n\n\nEqual Opportunity Employer, including disability/veterans.\n\n  \n\n\nOur patient-forward values\n\n\n– innovation\n\n\n– focus\n\n\n– drive\n\n\n– courage\n\n\n– trust\n\n\n– empathy\n\n  \n\n\n#LI-RJ1\n\n\n#LI-Remote\n\n  \n\n  \n\n**Nearest Major Market:** Philadelphia"},{"_id":"6709d79b6ec29b27dacd9436","job_title":"Senior Software Developer (Europe - Remote)","company":"Socotra","job_location":"Remote, US","job_description":"Europe, Remote | Remote\nSocotra is transforming core technology operations for the trillion-dollar insurance industry. Our born-in-the-cloud platform streamlines the end-to-end insurance policy lifecycle, including underwriting, policy administration, claims, billing, and reporting. Socotra is built on modern architecture, allowing carriers to increase their speed to market, lower product and production costs, experience cloud-based reliability, and easily integrate with new technologies.\n\n\nWe seek a talented, self-motivated Senior Software Developer to join our expanding engineering team in Europe. As a key engineering team member, you will help build, evolve, and scale our core technology platform to drive product innovation and success. This is your opportunity to make a big impact at a high-growth startup with an expanding client list of Fortune 500 insurers and backed by prominent investors.\n\n**Experience we are looking for:**\n\n* 6+ years of software development experience with an excellent understanding of core Java concepts and clean code principles; very good experience in Java server-side technologies (preferably Spring based) and good testing skills & working knowledge of JUnit, Mockito\n* Proven experience with a relational database such as MySQL, Oracle, and Postgres.\n* Solid understanding of common data structures and algorithms, and OO design.\n* Docker - building images, debugging Git: git-flow / PR reviews\n\n**Nice to have:**\n\n* Cloud services - experience with any of the main cloud providers\n* Microservices architecture, gRPC\n* Kubernetes / minikube\n\n**What you will do:**\n\n* Work as a key member of an agile team to design, develop, and test end-to-end projects that meet our clients' requirements.\n* Design and implement scalable REST API's, backend processes for a configurable insurance cloud platform.\n* Provides technical guidance and assumes responsibility in all development activities.\n* Bring an awareness of industry trends and potential new technologies that can offer a positive impact on our customer base.\n* Mentor team members in design collaboration, code reviews, development tools and processes\n\n**Benefits:**\n\n* Fitness Benefit\n* Work-from-home stipend\n* BetterHelp\n* LinkedIn Learning\n\n\nThis position is entirely remote.\n\n\nSalary: 350-450 Euros per day depending on experience and location\n\n  \n\nCompensation: €350.00 – €450.00 per day"},{"_id":"6709d79b6ec29b27dacd9437","job_title":"Software Engineer - New College Graduate","company":"Teradyne","job_location":"Deer Park, IL, US","job_description":"**Our Purpose**\n\n  \n\nTERADYNE, where experience meets innovation and driving excellence in every connection. We are fueled by creativity and diversity of thought and in our workforce. Our employees are supported to innovate and learn something new every day.\n\n  \n\n  \n\nWe cultivate a culture of inclusion for all employees that respects their individual strengths, views, and experiences. We believe that our differences enable us to be a better team – one that makes better decisions, drives innovation and delivers better business results.\n\n **Opportunity Overview**\n\n  \n\nThe Software Engineering team in Deer Park, IL is looking for a Software Engineer with passion for learning, developing high quality software, solving complex problems and becoming part of a smart and innovative team. Are you able to balance a variety of tasks related to requirements definition, software system design, development, testing, trouble-shooting, and maintenance? Interact with multi-functional teams from the product definition stage through product release? Then you're exactly who we're looking for!\n\n **In this role, the ideal candidate will:**\n\n  \n\n* Design, implementation, test, and deployment of software components for Teradyne’s family of Automatic Test Equipment\n* Create robust designs with a focus on scalability, high performance and maintainability\n* Work with software verification engineers to devise, document and execute effective test strategies and plans\n* Work with hardware and firmware engineers to create software for embedded instrument products\n* Conceive and implement fully functional and high performing software solutions\n* Tackle difficult problems and come up with innovative software solutions\n* Participate in brainstorming sessions and contribute ideas to improve our product, our process and our team\n\n **All About You**\n\n  \n\nWe seek individuals who share our passion and determination. Our commitment to customer success drives us to go the extra mile. If you’re ready to join us in this mission, take a closer look at the minimum criteria for the position.\n\n  \n\n* This role has some hybrid flexibility however the candidate must be able to work on-site at the Deer Park, IL office.\n* This position is not eligible for visa sponsorship.\n* Able to clearly express your ideas and concepts both written and verbally\n* Driven to get the job done and are not afraid to really commit, and go above and beyond to do it\n* Experience with C++, C# and .NET development\n* Solid knowledge of data structures and algorithms, and operating systems (Windows)\n* Experience with development tools: Visual Studio, GitExperience with development lifecycles including AgileHardware knowledge and prior ATE experience is a plus.\n* Co-op or internship experience a plus\n\n **Education**\n\n  \n\n* BS or MS in Computer Engineering, Electrical Engineering or Computer Science\n* Relevant internship or practical software development experience is a plus\n\n  \n\n#LI-HP1"},{"_id":"6709d79b6ec29b27dacd9438","job_title":"Full Stack Developer","company":"Trellix","job_location":"Remote, US","job_description":"**About Trellix:**\n\n\n\nTrellix is a global company redefining the future of cybersecurity and soulful work. The company’s comprehensive, open and native cybersecurity platform helps organizations confronted by today’s most advanced threats gain confidence in the protection and resilience of their operations. Trellix, along with an extensive partner ecosystem, accelerates technology innovation through artificial intelligence, automation, and analytics to empower over 50,000 business and government customers with responsibly architected security. More at https://trellix.com.\n\n\n\n\n\n***Role Overview:***\n\n\n\nFull Stack Developer\n\n\n\n\n\n* Design and development of new features on the Endpoint Security (ENS) Real Protect cloud solution space which drives growth and revenue to the company.\n* Design and development of new security features on the cloud which includes but not limited to machine learning based solutions such as Real Protect and on-premise offerings such as ePO, Endpoint Security (HX).\n* Design, coding, testing, bug fixing, code refactoring, code review and automation of new features.\n* Monitor and resolve product performance issues and memory footprint issues to improve the customer experience.\n* Sustenance of released versions of the products by resolving field issues which includes root cause analysis, bug fixing, automation and participating in maintenance release cycle.\n* Participate in product release roadmap, educating and training other teams like documentation, sustenance and product support teams.\n* Lead research tasks and innovation by working with subject matter experts and product roadmap plans.\n* Determine methods and procedures on new assignments and may coordinate activities of other personnel.\n* Actively participate in the grooming the user stories for the future sprints. Interview candidates on technical skillset and provide recommendation to manager.\n* Mentoring interns, junior team members on design, review and implementation.\n* Telecommuting permitted from anywhere in the U.S.\n* Requires Bachelors in Computer Science, Data Science and Machine Learning, Distributed Systems, Networking, Cybersecurity, or related field and 5 years of progressive experience as Full Stack Developer, Software Engineer, Software Engineering Intern, or related.\n* In the alternative, Employer will accept a Masters in Computer Science, Data Science and Machine Learning, Distributed Systems, Networking, Cybersecurity, or related field and 2 years of experience as Full Stack Developer, Software Engineer, Software Engineering Intern, or related.\n* 1 year must include experience with (1) Node.js, (2) Python, (3) NodeJS Front-end / Backend Frameworks, (4) Front-end JavaScript frameworks such as PolymerJS/VueJS/ReactJS, (5) with relational database systems such as Cassandra/ MySQL/ Postgres etc., (6) NoSQL database systems such as Aerospike, MongoDB, DynamoDB, Redis or similar, (7) AWS technologies such as EC2, S3, ECR, (8) designing products with web technologies that support cybersecurity products, (9) Experience designing web technologies for EDR/XDR solutions, (10) distributed systems, (11) Kubernetes, and (12) working / designing native cloud applications systems at scale.\n\n\n***Company Benefits and Perks:***\n\n\n\n\n\nWe work hard to embrace diversity and inclusion and encourage everyone to bring their authentic selves to work every day. We offer a variety of social programs, flexible work hours and family-friendly benefits to all of our employees.\n\n\n* Retirement Plans\n* Medical, Dental and Vision Coverage\n* Paid Time Off\n* Paid Parental Leave\n* Support for Community Involvement\n\n\nWe're serious about our commitment to diversity which is why we prohibit discrimination based on race, color, religion, gender, national origin, age, disability, veteran status, marital status, pregnancy, gender expression or identity, sexual orientation or any other legally protected status.\n\n\n\nApply Now\n\n\nShare This Job\nShare on Facebook\nShare on X\nShare on Linkedin\nShare on Email"},{"_id":"6709d79b6ec29b27dacd9439","job_title":"Staff Software Development Engineer","company":"Trellix","job_location":"Tampa, FL, US","job_description":"**About Trellix:**\n\n\n\nTrellix is a global company redefining the future of cybersecurity and soulful work. The company’s comprehensive, open and native cybersecurity platform helps organizations confronted by today’s most advanced threats gain confidence in the protection and resilience of their operations. Trellix, along with an extensive partner ecosystem, accelerates technology innovation through artificial intelligence, automation, and analytics to empower over 50,000 business and government customers with responsibly architected security. More at https://trellix.com.\n\n\n\n\n\n***Role Overview:***\n\n\n\n–\n\n\n\n\n\nSoftware Engineers conduct or participate in multidisciplinary research and collaborate with design, layout and/or hardware engineers in the design, development, and utilization of productivity enhancement layout tools and design rule checkers, electronic data processing systems software. Determines computer user needs, advises hardware designers on machine characteristics that affect software systems such as storage capacity, processing speed, and input/output requirements, designs and develops compilers and assemblers, utility programs, and operating systems. Responds to customer/client requests or events as they occur. Develops solutions to problems utilizing formal education, judgement and formal software process.\n\n\n\n\n\n***Company Benefits and Perks:***\n\n\n\n\n\nWe work hard to embrace diversity and inclusion and encourage everyone to bring their authentic selves to work every day. We offer a variety of social programs, flexible work hours and family-friendly benefits to all of our employees.\n\n\n* Retirement Plans\n* Medical, Dental and Vision Coverage\n* Paid Time Off\n* Paid Parental Leave\n* Support for Community Involvement\n\n\nWe're serious about our commitment to diversity which is why we prohibit discrimination based on race, color, religion, gender, national origin, age, disability, veteran status, marital status, pregnancy, gender expression or identity, sexual orientation or any other legally protected status.\n\n\n\nApply Now\n\n\nShare This Job\nShare on Facebook\nShare on X\nShare on Linkedin\nShare on Email"},{"_id":"6709d79b6ec29b27dacd943a","job_title":"AES - DE - FS - Java FS React","company":"Zensar Technologies","job_location":"Atlanta, GA, US","job_description":"Full-Stack – UI (React) Engineer\n\n\n5+ YRS\n\n\nUSA  \n\n\n\nLooking for a workplace where people realize their full potential, are recognized for the impact they make, and enjoy the company of the peers they work with? Welcome to Zensar! Read on for more details on the role and about us.  \n\n\n\n**Skills required to contribute:**\n\n**Mandatory Experience:**\n\n* Hands on experience in ReactJS with Typescript\n* Experience in NODEJS will be preferred\n* Experience in HTML5, CSS3 and styling with SASS (or any other pre-processor). Good knowledge and experience with multi browser compatibility and responsive web design\n* Managing and owning all aspects of technical development and delivery\n* Understanding requirements and writing technical architecture documents\n* Ensuring the code reviews and development best practices / processes to be followed\n* Experience in writing unit testing using Jasmine or any other technology Good experience in GIT Good knowledge in REST API’s and integration. Basic Understanding of Security ( HTTP Interceptors, JWT, Token script etc)\n* Responsive Web Design using Bootstrap, Media Query etc.\n* Hands on experience working in Scrum agile environment with tools like JIRA, Confluence\n* Experience working in Onsite/Offshore Scrum Agile team with cross functional stakeholders\n* Experience in back end integration using SOAP/REST services\n* Exposure to Cloud deployment (AWS/GCP/AZURE)\n* Experience in Object Oriented JavaScript Back end integration with SOAP & REST services jQuery\n* Good to have experience in replatform work from legacy to ReactJS.\nReactJS with .net/java as Fullstack experience is advantage  \n* \n\nSuitable candidate will have the below attributes\n\n\n* 5 years of experience in frontend development using react and having sound JS framework experience\n* Bachelor’s degree in Comp Sc.\n* Excellent communication skills and onshore-offshore co-ordination skills.\n* Work in agile environment\nProblem solving skills  \n* \n\nAdvantage Zensar  \n\n\n\nWe are a digital solutions and technology services company that partners with global organizations across industries to achieve digital transformation. With a strong track record of innovation, investment in digital solutions, and commitment to client success, at Zensar, you can help clients achieve new thresholds of performance. A subsidiary of RPG Group, Zensar has its HQ in India, and offices across the world, including Mexico, South Africa, UK and USA.  \n\n\n\nZensar is all about celebrating individuality, creativity, innovation, and flexibility. We hire based on values, talent, and the potential necessary to fill a given job profile, irrespective of nationality, sexuality, race, color, and creed. We also put in policies to empower this assorted talent pool with the right environment for growth.  \n\n\n\nAt Zensar, you Grow, Own, Achieve, Learn.  \n\n\n\nLearn more about our culture: https://www.zensar.com/careers/who-we-are  \n\n\n\n**Ready to #ExperienceZensar?**\n\nBegin your application by clicking on the ‘Apply Online’ button below.\n\n\nBe sure to have your resume handy!\n\n\nIf you’re having trouble applying, drop a line to careers@zensar.com."},{"_id":"6709d79b6ec29b27dacd943b","job_title":"Senior Perl Engineer","company":"Flowspace","job_location":"Remote, US","job_description":"**Summary:**\n\n\nThis is a remote position. A senior software engineer at this level has the ability to handle both daily coding projects, and also successfully lead teams/projects, under the mentorship of our Engineer Manager. This is a rock solid team member who requires very little oversight, completing projects in full as well as handling well tested coding.\n\n\nThis role will be a point person on a technical area or product, partners with level II engineers for technical direction and best practices, and understands and executes on the vision of the company, cultivating technical and professional growth.  \n\n  \n\n**What You'll Do:**\n\n* Write and ship code daily. Works closely with the entire team to ensure our customers and internal team have the functionality they need to get the job done.\n* The Software Engineer owns what they build, gets creative with solutions, writes tests, and contributes directly to our core product.\n* Takes ownership of their work.\n* Reimagines how an industry works. Flowspace is creating clean, beautiful software in a market dominated by outdated enterprise solutions.\n* Maintains existing software code to meet the same standards/criteria as new code\n* Alpha testing new code\n* Documents newly implemented features and bug fixes\n* Assist with and/or performing upgrades, training, and implementation\n* Go-to expert in an area of the codebase, and understands the broad architecture of the entire platform.\n* Provides technical guidance and direction to other teams and the company at large.\n* Introduces new technologies to the platform when mature, needed, and appropriate.\n* Regularly delivers software on time, makes accurate estimates of complexity and time, and delivers on those estimates.\n* Breaks work down into actionable milestones, known for drama-free rollouts.\n* Sets the technical direction, performance considerations, and testing of a project.\n* Thinks through all considerations and uses, never releases code that doesn't accomplish what was originally intended.\n* Makes others on the team better engineers. Respected as a technical leader and as a mentor with the development team and to the company at large. Respected as a technical leader to other departments.\n* Dependable, puts in the work and carries the load, picks things up when the team falters.\n\n**Who We're Looking For:**\n\n* 7+ years of software development experience\n* Web application development experience with Perl and Javascript\n* Can write code, collect and manage feedback from teammates and product managers, implement APIs, and internally prioritize your workload.\n* Knowledgeable in CS fundamentals. Strong architecture skills and an eye for aesthetics.\n* Proven ability to lead junior and mid level engineers\n* Proven technical judgment in at least one area of the application\n\n**Bonus Points:*** 5+ years of full-stack web application development experience with Perl and Javascrip\n* Professional experience with Go and Rails, ability to work in multiple languages routinel\n* Bachelor’s degree in Computer Science, Computer Engineering, or related field of stud\n* Experience modernizing code maintaining working functionality\n\n\nThe base salary range for this role is $140,000 - $170,000/year.\n\n\nCompensation packages are based on factors unique to each candidate, including but not limited to skill set, certifications, and specific geographical location.\n\n**Join our team!**\n\n\n* Meaningful equity in a venture backed start-up. Everyone gets stock options!\n* Competitive Salary\n* Top of the line medical, vision, dental, and life insurance\n* Flexible time off, plus a separate banks for sick time\n* Paid parental leave\n* Mental Health / Wellness benefits + discounts for certain programs\n* Work From Home stipend, towards your home office\n* 401K with matching\n* A clear success path within the company. We want you to grow and lead with us!\n\n\nAt Flowspace, we know that the more inclusive we are, the better our work will be, and we strive to hire and retain talent that represents a variety of backgrounds, perspectives, and skill sets.\n\n\nWe are committed to equal opportunity employment and we take pride in encouraging diversity, equity, and inclusion across all of our teams, without regard to race, color, religion (including religious dress and religious grooming practices), sex, gender (including gender identity and gender expression), national origin, age, physical and mental disability, medical condition (including pregnancy, childbirth, breastfeeding and related medical conditions), genetic predisposition or carrier status, marital, parental or registered domestic partnership status, sexual orientation, transgender status, military or veteran status, or any other characteristic protected by applicable law.\n\n\n*Please note: We do not accept resumes from external staffing agencies or independent recruiters for any of our openings unless otherwise directed or approved by our HR, Recruiting Department. Please do not forward resumes to our hiring managers or offices. Flowspace is not responsible for any fees related to unsolicited resumes/applications, that have not first been approved.*\n\n\n*Disclaimer*\n\n\n*The above job description is meant to describe the general nature and level of work being performed. It is not an exhaustive list of all responsibilities, duties and skills required for the position. Employees will be required to follow any other job-related instructions and to perform other job-related duties requested by their supervisor in compliance with Federal and State Laws. All job requirements are subject to possible modification to reasonably accommodate individuals with disabilities. Some requirements may exclude individuals who pose a direct threat or significant risk to the health and safety of themselves or other employees.*\n\n\n*Requirements are representative of minimum levels of knowledge, skills and/or abilities. To perform this job successfully, the employee must possess the abilities or aptitudes to perform each duty proficiently. Continued employment remains on an “at-will” basis.*\n\n\nv81oQhU2a8"},{"_id":"6709d79b6ec29b27dacd943c","job_title":"Lead Software Engineer - Remote","company":"Optum","job_location":"Saint Petersburg, FL, US","job_description":"**Opportunities at WellMed,** part of the Optum family of businesses. We believe all patients are entitled to the highest level of medical care. Here, you will join a team who shares your passion for helping people achieve better health. With opportunities for physicians, clinical staff and non-patient-facing roles, you can make a difference with us as you discover the meaning behind **Caring. Connecting. Growing together.**\n\n  \n\n\n\nYou’ll enjoy the flexibility to work remotely \\* from anywhere within the U.S. as you take on some tough challenges.\n\n  \n\n**Primary Responsibilities:**\n\n\n* Lead complex hands-on development and implementation of world-class software solutions\n* Mentor software engineers and lead software engineering code quality and best practices\n* Assist in story definition, evaluation, translation, and business requirements gathering from product owners and business stakeholders\n* Estimate delivery effort, as well as effectively identify and prioritize high-value deliverables as a leader of the scrum team\n* Influence design, development, and deployment of product architecture through collaboration with Technical Product owners\n* Lead platform modernization initiatives from legacy systems to new scalable solutions including functional and non-functional aspects like security and performance\n* Recommend modern, scalable, resilient solutions to improve existing systems\n* Accountable for rapid, reliable, and repeated delivery of quality platform solutions to the enterprise\n\n  \n\n\n\nYou’ll be rewarded and recognized for your performance in an environment that will challenge you and give you clear direction on what it takes to succeed in your role as well as provide development for other roles you may be interested in.\n\n**Required Qualifications:**\n\n\n* Undergraduate degree or equivalent experience\n* 5+ years of experience developing .Net-based solutions in an enterprise environment, influencing both development and architecture activities\n* 2+ years of experience working with SQL server technologies\n* 2+ years of experience with JavaScript and single-page applications\n\n  \n\n\n* All employees working remotely will be required to adhere to UnitedHealth Group’s Telecommuter Policy.\n\n  \n\n\n**California, Colorado, Connecticut, Hawaii, Nevada, New Jersey, New York, Rhode Island, Washington, Washington, D.C. Residents Only:** The salary range for this role is $104,700 to $190,400 annually. Pay is based on several factors including but not limited to local labor markets, education, work experience, certifications, etc. UnitedHealth Group complies with all minimum wage laws as applicable. In addition to your salary, UnitedHealth Group offers benefits such as, a comprehensive benefits package, incentive and recognition programs, equity stock purchase and 401k contribution (all benefits are subject to eligibility requirements). No matter where or when you begin a career with UnitedHealth Group, you’ll find a far-reaching choice of benefits and incentives.  \n\n  \n\n**Application Deadline:** This will be posted for a minimum of 2 business days or until a sufficient candidate pool has been collected. Job posting may come down early due to volume of applicants.\n\n  \n\n\n*At UnitedHealth Group, our mission is to help people live healthier lives and make the health system work better for everyone. We believe everyone–of every race, gender, sexuality, age, location and income–deserves the opportunity to live their healthiest life. Today, however, there are still far too many barriers to good health which are disproportionately experienced by people of color, historically marginalized groups and those with lower incomes. We are committed to mitigating our impact on the environment and enabling and delivering equitable care that addresses health disparities and improves health outcomes — an enterprise priority reflected in our mission.*\n\n  \n\n\n*Diversity creates a healthier atmosphere: UnitedHealth Group is an Equal Employment Opportunity/Affirmative Action employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, national origin, protected veteran status, disability status, sexual orientation, gender identity or expression, marital status, genetic information, or any other characteristic protected by law.*\n\n  \n\n*UnitedHealth Group is a drug - free workplace. Candidates are required to pass a drug test before beginning employment.*"},{"_id":"6709d79b6ec29b27dacd943d","job_title":"Sr. Software Engineer - Remote","company":"Optum","job_location":"San Antonio, TX, US","job_description":"**Opportunities at WellMed,** part of the Optum family of businesses. We believe all patients are entitled to the highest level of medical care. Here, you will join a team who shares your passion for helping people achieve better health. With opportunities for physicians, clinical staff and non-patient-facing roles, you can make a difference with us as you discover the meaning behind **Caring. Connecting. Growing together.**\n\n  \n\n\n\nYou’ll enjoy the flexibility to work remotely \\* from anywhere within the U.S. as you take on some tough challenges.\n\n  \n\n**Primary Responsibilities:**\n\n\n* Develop full stack applications following an Agile development methodology in a team environment\n* Resolve technical issues through debugging, research, and investigation\n* Conduct code review to ensure the work delivered by the team is of high-quality standards\n* Test and validate coding to ensure accuracy, compliance, efficiency, and scalability\n* Contribute to the continuous improvement of the software engineering team and processes\n* Contribute code, tests, automation, application design and architecture to an agile team of engineers working across the application stack and portfolio\n* Collaborate with scrum teams in grooming user stories and developing acceptance criteria so that we can deliver value to our customers\n* Solve technical problems to discover solutions at any level of the stack (backend, frontend, database and infrastructure)\n* Communicate, learn, and share ideas across teams\n\n  \n\n\n\nYou’ll be rewarded and recognized for your performance in an environment that will challenge you and give you clear direction on what it takes to succeed in your role as well as provide development for other roles you may be interested in.\n\n**Required Qualifications:**\n\n\n* Undergraduate degree or 4+ years of engineering experience\n* 4+ years of development experience with C#\n* 2+ years of experience working with SQL server technologies\n* 2+ years of experience with Javascript and single-page applications\n\n  \n\n\n**Preferred Qualifications:**\n\n\n* Proven ability to effectively work independently or with a team as a software engineer\n* Proven ability to effectively articulate and communicate concerns, issues or inquires in a timely manner\n\n  \n\n\n* All employees working remotely will be required to adhere to UnitedHealth Group’s Telecommuter Policy.\n\n  \n\n\n**California, Colorado, Connecticut, Hawaii, Nevada, New Jersey, New York, Rhode Island, Washington, Washington, D.C. Residents Only:** The salary range for this role is $88,000 to $173,200 annually. Pay is based on several factors including but not limited to local labor markets, education, work experience, certifications, etc. UnitedHealth Group complies with all minimum wage laws as applicable. In addition to your salary, UnitedHealth Group offers benefits such as, a comprehensive benefits package, incentive and recognition programs, equity stock purchase and 401k contribution (all benefits are subject to eligibility requirements). No matter where or when you begin a career with UnitedHealth Group, you’ll find a far-reaching choice of benefits and incentives.  \n\n  \n\n**Application Deadline:** This will be posted for a minimum of 2 business days or until a sufficient candidate pool has been collected. Job posting may come down early due to volume of applicants.\n\n  \n\n\n*At UnitedHealth Group, our mission is to help people live healthier lives and make the health system work better for everyone. We believe everyone–of every race, gender, sexuality, age, location and income–deserves the opportunity to live their healthiest life. Today, however, there are still far too many barriers to good health which are disproportionately experienced by people of color, historically marginalized groups and those with lower incomes. We are committed to mitigating our impact on the environment and enabling and delivering equitable care that addresses health disparities and improves health outcomes — an enterprise priority reflected in our mission.*\n\n  \n\n\n*Diversity creates a healthier atmosphere: UnitedHealth Group is an Equal Employment Opportunity/Affirmative Action employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, national origin, protected veteran status, disability status, sexual orientation, gender identity or expression, marital status, genetic information, or any other characteristic protected by law.*\n\n  \n\n*UnitedHealth Group is a drug - free workplace. Candidates are required to pass a drug test before beginning employment.*"},{"_id":"6709d79b6ec29b27dacd943e","job_title":"Principal Cloud Engineer - Remote","company":"Optum","job_location":"Eden Prairie, MN, US","job_description":"Optum is a global organization that delivers care, aided by technology to help millions of people live healthier lives. The work you do with our team will directly improve health outcomes by connecting people with the care, pharmacy benefits, data and resources they need to feel their best. Here, you will find a culture guided by diversity and inclusion, talented peers, comprehensive benefits and career development opportunities. Come make an impact on the communities we serve as you help us advance health equity on a global scale. Join us to start **Caring. Connecting. Growing together.**\n\n  \n\nWe are seeking two highly skilled Principal Cloud Engineers to join our growing team, reporting directly to the Director of Cloud Networking. These roles are critical in designing, deploying, and managing complex multi-cloud solutions across Azure, AWS, and GCP. The ideal candidates will have deep technical expertise and proven experience in engineering cloud infrastructure that is secure, scalable, and optimized for performance.\n\n  \n\nAs a Principal Cloud Engineer, you will be a key player in our cloud transformation efforts, utilizing your advanced engineering skills to create innovative solutions that meet our business needs. You will work collaboratively with cross-functional teams to ensure the seamless integration of cloud technologies and provide ongoing support and optimization for our cloud environments.\n\n  \n\nYou’ll enjoy the flexibility to work remotely \\* from anywhere within the U.S. as you take on some tough challenges.\n\n  \n\n**Primary Responsibilities:**\n\n\n* Design and Deployment: Architect, design, and deploy complex multi-cloud solutions across Azure, AWS, and GCP, ensuring they meet business and technical requirements\n* Infrastructure as Code: Develop and maintain Infrastructure as Code (IaC) using tools such as Terraform, CloudFormation, and Deployment Manager for consistent and repeatable cloud infrastructure deployment\n* Security and Compliance: Implement security best practices across all cloud environments, including identity and access management, encryption, and network security. Ensure compliance with industry standards and regulatory requirements\n* Performance Optimization: Monitor and optimize the performance of cloud infrastructure, addressing any bottlenecks and implementing improvements to enhance efficiency and scalability\n* Automation: Build and maintain automation scripts and processes to streamline cloud operations, including deployment, scaling, and monitoring\n* Troubleshooting and Support: Provide advanced troubleshooting and support for cloud infrastructure issues, ensuring high availability and minimal downtime for critical systems\n* Cost Management: Analyze and optimize cloud costs across multiple platforms, implementing cost-saving measures and ensuring efficient resource utilization\n* Collaboration: Work closely with the Director of Cloud Networking and other stakeholders to understand business needs and translate them into technical solutions. Collaborate with development, operations, and security teams to ensure seamless integration and operation of cloud services\n\n  \n\n  \n\nYou’ll be rewarded and recognized for your performance in an environment that will challenge you and give you clear direction on what it takes to succeed in your role as well as provide development for other roles you may be interested in.\n\n**Required Qualifications:**\n\n\n* 5+ years of hands-on experience in cloud engineering, with a solid focus on deploying and managing solutions across 2 or more of Azure, AWS, and GCP\n* 3+ years of experience with Infrastructure as Code (IaC) tool Terraform. Similar experience in CloudFormation, or Deployment Manager considered\n* 3+ years of experience with scripting skills in languages such as Python, PowerShell, or Bash\n* 3+ years of Multi-Cloud Expertise: Proven experience in designing, deploying, and managing complex multi-cloud environments, with a deep understanding of the unique challenges and opportunities of each platform\n* 3+ years of cloud security experience: In-depth knowledge of cloud security practices, including identity and access management, network security, encryption, and compliance with security frameworks such as NIST\n* 1+ relevant certification in Azure, AWS, and GCP (e.g., Google Certified Professional Cloud Architect, AWS Certified Solutions Architect, Microsoft Certified: Azure Solutions Architect)\n\n  \n\n  \n\n**Preferred Qualifications:**\n\n\n* Problem-Solving: Proven excellent problem-solving skills, with the ability to troubleshoot complex cloud infrastructure issues and implement effective solutions\n* Team Collaboration: Proven ability to work effectively in a collaborative team environment, with a focus on sharing knowledge and continuous improvement\n* Self-Motivated: Proven highly self-motivated and able to work independently with minimal supervision, while also being a proactive team player\n\n  \n\n  \n\n* All employees working remotely will be required to adhere to UnitedHealth Group’s Telecommuter Policy\n  \n\n**California, Colorado, Connecticut, Hawaii, Nevada, New Jersey, New York, Rhode Island, Washington** **or** **Washington, D.C. Residents Only:** The salary range for this role is $104,700 to $190,400 annually. Pay is based on several factors including but not limited to local labor markets, education, work experience, certifications, etc. UnitedHealth Group complies with all minimum wage laws as applicable. In addition to your salary, UnitedHealth Group offers benefits such as, a comprehensive benefits package, incentive and recognition programs, equity stock purchase and 401k contribution (all benefits are subject to eligibility requirements). No matter where or when you begin a career with UnitedHealth Group, you’ll find a far-reaching choice of benefits and incentives.\n\n  \n\n**Application Deadline:** This will be posted for a minimum of 2 business days or until a sufficient candidate pool has been collected. Job posting may come down early due to volume of applicants.\n\n  \n\n*At UnitedHealth Group, our mission is to help people live healthier lives and make the health system work better for everyone. We believe everyone–of every race, gender, sexuality, age, location and income–deserves the opportunity to live their healthiest life. Today, however, there are still far too many barriers to good health which are disproportionately experienced by people of color, historically marginalized groups and those with lower incomes. We are committed to mitigating our impact on the environment and enabling and delivering equitable care that addresses health disparities and improves health outcomes - an enterprise priority reflected in our mission.*\n\n\n\n*Diversity creates a healthier atmosphere: UnitedHealth Group is an Equal Employment Opportunity/Affirmative Action employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, national origin, protected veteran status, disability status, sexual orientation, gender identity or expression, marital status, genetic information, or any other characteristic protected by law.*\n\n  \n\n*UnitedHealth Group is a drug-free workplace. Candidates are required to pass a drug test before beginning employment.*"},{"_id":"6709d79b6ec29b27dacd943f","job_title":"Lead Analytics Engineer - Remote","company":"Optum","job_location":"Downers Grove, IL, US","job_description":"Optum is a global organization that delivers care, aided by technology to help millions of people live healthier lives. The work you do with our team will directly improve health outcomes by connecting people with the care, pharmacy benefits, data and Cthey need to feel their best. Here, you will find a culture guided by diversity and inclusion, talented peers, comprehensive benefits and career development opportunities. Come make an impact on the communities we serve as you help us advance health equity on a global scale. Join us to start **Caring. Connecting. Growing together.**\n\n  \n\n\n\n\nOur team provides Analytic Application development and support for Optum Payment Integrity. We provide data analytic development services that identify overpayments or recoveries for Fraud Waste Abuse and Error (FWAE), and Provider Education. This position will develop new analytics, enhance existing analytics, and maintain and improve the applications that support these analytics using bigdata tools, Azure, Pyspark and PL/SQL.  \n\n\n\nYou’ll enjoy the flexibility to work remotely \\* from anywhere within the U.S. as you take on some tough challenges.\n\n  \n\n\n**Primary Responsibilities:**\n\n\n* Design, develop and implement analytics rules engines\n* Research, evaluate, and deploy new tools, frameworks, and patterns to build sustainable Big Data platform\n* Identify gaps and opportunities for improvement of existing solutions\n* Define and develop APIs for integration with various data sources in the enterprise\n* Analyze and define customer requirements\n* Assist in defining product technical architecture\n* Make accurate development effort estimates to assist management in project and resource planning\n* Create prototypes, proof-of-concepts & design and code reviews\n* Collaborate with management, quality assurance, architecture, and other development teams\n* Write technical documentation and participate in production support\n* Keep skills up to date through ongoing self-directed training\n\n  \n\n\n  \n\nYou’ll be rewarded and recognized for your performance in an environment that will challenge you and give you clear direction on what it takes to succeed in your role as well as provide development for other roles you may be interested in.\n\n**Required Qualifications:**\n\n\n* 8+ years of experience in hands-on software development\n* 5+ years of experience in Oracle databases and PL/SQL\n* 3+ years of experience in development with Python using Pandas, and Spark\n* 2+ years of experience in Azure cloud platform or similar cloud platform\n* 2+ years in Bigdata tools, like Databricks, Spark, Cassandra\n\n  \n\n\n**Preferred Qualifications:**\n\n\n* Bachelor’s degree\n* 2+ years of experience with Agile/Scrum methodology and best practices\n* Experience in scheduling tools, such as ADF/Airflow\n* Data analysis experience\n* Functional testing experience\n* Healthcare industry experience\n* Understanding of SOA (service-oriented architecture) concepts\n* Proven excellent analysis, process, problem solving and critical thinking skills\n\n\n* All employees working remotely will be required to adhere to UnitedHealth Group’s Telecommuter Policy\n\n\n\n**California, Colorado, Connecticut, Hawaii, Nevada, New Jersey, New York, Rhode Island, or Washington Residents Only:** The salary range for this role is $104,700 to $190,400 annually. Pay is based on several factors including but not limited to local labor markets, education, work experience, certifications, etc. UnitedHealth Group complies with all minimum wage laws as applicable. In addition to your salary, UnitedHealth Group offers benefits such as, a comprehensive benefits package, incentive and recognition programs, equity stock purchase and 401k contribution (all benefits are subject to eligibility requirements). No matter where or when you begin a career with UnitedHealth Group, you’ll find a far-reaching choice of benefits and incentives.\n\n  \n\n\n\n\n**Application Deadline:** This will be posted for a minimum of 2 business days or until a sufficient candidate pool has been collected. Job posting may come down early due to volume of applicants.\n\n  \n\n\n*At UnitedHealth Group, our mission is to help people live healthier lives and make the health system work better for everyone. We believe everyone–of every race, gender, sexuality, age, location and income–deserves the opportunity to live their healthiest life. Today, however, there are still far too many barriers to good health which are disproportionately experienced by people of color, historically marginalized groups and those with lower incomes. We are committed to mitigating our impact on the environment and enabling and delivering equitable care that addresses health disparities and improves health outcomes — an enterprise priority reflected in our mission.*\n\n  \n\n\n\n*Diversity creates a healthier atmosphere: UnitedHealth Group is an Equal Employment Opportunity/Affirmative Action employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, national origin, protected veteran status, disability status, sexual orientation, gender identity or expression, marital status, genetic information, or any other characteristic protected by law.*\n\n  \n\n\n*UnitedHealth Group is a drug-free workplace. Candidates are required to pass a drug test before beginning employment.*"}]